<template>
  <CardArrayByAndml :andml="andml1" />
</template>

<script setup lang="ts">
const andml1 = `
&1 このページについて
最近、「TRPG」という言葉を聞く機会があった人が多いのではないでしょうか？
TRPGをやるYouTuberの方が増えたり、TRPGを原作とした映画があったり……。
&br
このページではそんな絶賛流行中のTRPGについて、 &em_TRPG初心者 の方や、「TRPGって聞いたことあるけどなんだかわからない……」 という方、「TRPGをやってみたいけどよくわからない……」という方向けに、 &em_「TRPGとは何か」から、「TRPGの魅力」や「TRPGの始め方」までを解説する ページとなっています。
&br
「TRPGとは何か」は &em_極力専門用語を説明なしに使わず 、 &em_他のジャンルの例 なども使い、わかりやすくTRPGについて解説します。
&br
「おすすめのTRPGシステム」も &em_クトゥルフ神話TRPG など人気な5つのTRPGシステムを &em_「初心者におすすめか」の観点から比較 しつつ紹介します。
&br
このページを読めば、「TRPGって何？」って人も、 &em_TRPGを始められます！
ぜひこのページを読んで、一緒に楽しいTRPGライフを送りましょう！

&2 TRPG経験者の方にも
また、TRPG経験者の方にも「TRPGって何？」「TRPGやりたいんだけど」と &em_質問された際に役立つページになっている （と思う）ので、1回読んでいただければ幸いです。

&1 TRPGとは？
TRPGはアナログゲームの1つです。
と説明すると &em_「アナログゲームってなんぞや」 ってなると思うので、まずはTRPGの立ち位置を紹介します。
&br
まずゲームは大きく分けて「デジタルゲーム（コンピューターゲーム）」と「アナログゲーム（テーブルゲーム）」に分けられます。
それぞれについて簡単に解説します。
&br
※ 分類や例は一例に過ぎません。いろいろな分類があります。

&2 デジタルゲーム（コンピューターゲーム）
デジタルゲームは何らかの電子機器を用いて遊ぶゲームです。
コンピューターゲームやビデオゲームなどと呼ばれることもあります。
&br
- スマホゲーム
- コンシェーマーゲーム（ &em_Nintendo¥sSwitch 、3DS、 &em_PS5 など……）
- PCゲーム
- アーケードゲーム
&br
上記のようなものは &em_全てデジタルゲーム です。
これらは遊ぶための機器によって分類しましたが、内容によっても
&br
- RPG（ロールプレイングゲーム）
- FPS（1人称視点のシューティングゲーム、 &em_PUBG など）
- サンドボックスゲーム（ &em_MineCraft など）
- シミュレーションゲーム（ &em_信長の野望 、Cities:¥sSkylinesなど）
&br
などさまざまな分類があります。

&2 アナログゲーム（テーブルゲーム）
アナログゲームは電子機器を使わない（もしくはメインとして使わない）ゲームです。
テーブルゲームや非電源ゲームと呼ばれることもあります。
&br
例えば、以下のようなものがあります。
&br
- 物を使わないゲーム
-- &em_しりとり
- ボードゲーム（ボード（盤）とコマ（駒）を使うゲーム）
-- 囲碁・将棋・チェス・オセロ
-- 人生ゲーム・カタン
- カードを使うゲーム
-- &em_トランプ ・花札・UNO
-- TCG（トレーディングカードゲーム）
- その他
-- 麻雀
-- 黒ひげ危機一発
-- ジェンガ
-- マーダーミステリー
&br
これらをやったことがある人は多いでしょう。
※ 「メインとして使わない」としたのは、囲碁・将棋で時間を測るためにタイマーを使ったりするからです。
&br
また、 &em_アナログゲームがデジタルゲーム化される こともよくあります。
囲碁・将棋が遊べるゲームなどです。
&br
やはりデジタルゲーム同様に、アナログゲームも内容によっても分類できます。
例えば将棋やチェスなどをシミュレーションゲームの1種とすることもできます。
&br
&em_TRPGはこのアナログゲームの1つのジャンル なのです。
「1つのジャンル」といった通り、TRPGにもさまざまなものがあります。これらを「システム」と呼びます。
システムには例えば &em_「新クトゥルフ神話TRPG」 だったり、「エモクロアTRPG」だったり、「ソード・ワールド2.5」だったりがあります。
&br
デジタルゲームに「ポケットモンスタースカーレット」「PUBG」「MineCraft」「マリオカート8DX」「大乱闘スマッシュブラザーズ」などがある感覚です。
もしくはTCGに「ポケモンカード」「遊戯王」「デュエル・マスターズ」がある感覚です。
&br
と、いうシステムの話は置いておいて、 &em_まずはTRPGの全貌 を見ていきます。

&2 一旦まとめ
長くなってしまいましたが、 &em_「ゲームにはデジタルゲームとアナログゲームがある」 ことはわかっていただけたでしょうか。
また、「アナログゲーム」と聞いて「何だかわからないな……」って思っていた方にも「しりとり」や「トランプ」など &em_知っているアナログゲームがある ことに気がついていただけたと思います。
&br
では、TRPGとは何なのでしょうか？
それは以下で解説します。

&1 TRPGってなんの略？
TRPGについて説明するために、まずは「TRPG」が何の略なのか、解説します。
TRPGは &em_テーブルトークRPGの略 です。

&2 RPGとは
RPGというのはロールプレイングゲームですね。ゲームジャンルとしてRPGを聞いたことがある方は多いと思います。
RPGの有名タイトルとしては以下のようなものがあります。
&br
- 「ポケットモンスター」シリーズ
- 「ドラゴンクエスト」シリーズ
- 「ファイナルファンタジー」シリーズ
&br
これらを知ってる人は多いのではないでしょうか？
&em_RPGとはキャラクターになりきって遊ぶゲーム です。

&2 一旦まとめ
TRPGは &em_このようなRPGを「トーク」によってするもの です。

&1 TRPGで使うもの
TRPGについて理解を深めてもらうため、 &em_トークによってRPGをする ために使う物を見ていきます。
TRPGではシステムによって違いがあるものの、主に「ルールブック」「キャラクターシート」「サイコロ」「ペン」 を使います。

&2 ルールブック
ルールブックは、 &em_ルールが書かれた本 です。最近では本ではなく、ウェブサイト上にルールが書かれたTRPGも存在します。
RPGを遊ぶ上で、ルールがなければ「俺が最強！」って言い張る人がいるかも知れません。なのでルールがあり、それを記したルールブックがあります。
&br
&em_ルールブックはシステムごと にあり、それぞれのシステムにおける「キャラクターの作り方」や「ゲームの進め方」、「ゲームの舞台設定」などが書かれています。
&br
「ゲームの舞台設定って何？　難しそう」って思った方、 &em_心配しないで ください。
ゲームの舞台設定というのは「 &em_ポケモン という不思議な生き物がいる世界で、ポケモントレーナーという人たちがいる」とか、「魔法が使える子供たちは &em_ホグワーツ という魔法学校に通う」とか、そういうやつです！
&br
ルールブックは本屋さんやおもちゃ屋さんに売っていて、買う必要があります。電子書籍が出ていることもあります。
Nintendo Switchのゲームカセットを買う感覚です。
ただし、システムによってはウェブサイトなどで &em_無料で一部または全部が公開されている こともあります。

&2 キャラクターシート
キャラクターシートは &em_キャラクターの設定を書いた紙 です。最近では紙ではなく、キャラクターのデータを入力できるウェブサイトを使う場合もあります。
RPGではなりきるキャラクターが必要なので、その設定を書いたキャラクターシートをあらかじめ作っておくことになります。
&br
「キャラクターを作るのって難しそう」と言う方もいるかもしれませんが、 &em_心配しなくて大丈夫 です。
ルールブックに &em_キャラクターの例（サンプルキャラクター） があったり、他の参加者に助けてもらいながら作ることもできます。
&br
ほとんどのTRPGのシステムでは、 &em_デジタルゲームのRPGよりも自由にキャラクターを作る ことができます。
&br
キャラクターシートはルールブックについているので、コピーして使います。
ただし、前述の通り入力可能なウェブサイトがあり、これを使うことも多いです。

&2 サイコロ（ダイス）
サイコロは基本的に皆さんの知っているサイコロです。すごろくなどで使うあれです。
&br
ただ、皆さんが知っているサイコロは1〜6までの数字が書かれた立方体が多いでしょう。
しかし、TRPGのシステムによっては、「 &em_1〜10 までの数字が書かれている面が10個のサイコロ」や「 &em_1〜4 までの数字が書かれている面が4個のサイコロ」など &em_特殊なサイコロ を使うこともあります。
&br
サイコロは、ランダムに物事を決定する際に使います。
例えば &em_「急な流れの川を渡れるか」 や、 &em_「難しい本を理解できるか」 であったり、戦闘があるシステムなら &em_「攻撃が当たるか」 や、 &em_「相手の攻撃がかわせるか」 であったり、魔法があるシステムなら &em_「魔法が成功するか」 であったりします。
&em_「必ず成功する・必ず失敗する」 ではドキドキが減ってしまうため、サイコロを使うのです。
&br
ただし、サイコロを使わないシステムもあります。
&br
なお、最近ではウェブサイト上で遊ぶこともあり、この場合はそのウェブサイトでサイコロに代わる機能があることが多いです。
なので &em_必ずしもサイコロを買わないといけないわけではありません。

&2 ペン
ペンはご存知の通りのペンです。ボールペンでもシャーペンでも鉛筆でも大丈夫です。万年筆や筆ペン、ネームペンでも……。
&br
TRPGを遊んでいると、「ダメージを受けて体力が減る」とか、「怖いものを見て精神的ダメージを受ける」とか、そういうことがあります。
ほのぼのとしたTRPGのシステムも数多くありますが、そういうシステムでも「他のキャラクターと仲良くなる」といったことがあります。
&em_これらを記録するためにペンを使う のです。
&br
なお、最近ではウェブサイト上で遊ぶこともあり、この場合はそのウェブサイトでペンに代わる機能があることが多いです。

&2 一旦まとめ
TRPGでは &em_トークによってRPGをする ため、主にルールブック・キャラクターシート・サイコロ・ペンを使います。
&br
ルールブックにはルールが書いてあり、舞台設定などもあります。
キャラクターシートはキャラクターについて書いた紙です。
サイコロはランダムな物事の決定に使います。
ペンはイベントなどを記録するために使います。
&br
こうしてデジタルゲームのRPGのようにRPGができるのです。

&1 ゲームマスターとプレイヤー
TRPGは多くの場合、2人以上で遊ぶゲームです。
この際、遊ぶ人はゲームマスター（GM）とプレイヤー（PL）に分かれることになります。

&2 ゲームマスターとは
ゲームマスターは &em_ゲームを進行する役目 の人です。
多くの場合、1人がなります。
デジタルゲームでは電子機器がやることをやるわけです。
と、言うと「難しそう」「面倒臭そう」と思われるかも知れませんが、確かに難しいことや大変なこともありますが、 &em_ゲームマスターをやることでしか得られない楽しさ もあります。
&br
ただし、初めてならまずはプレイヤーをやってみるのがおすすめです。
なのでゲームマスターをやってくれる人は探すのが良いでしょう。詳しくは下記の「TRPGの始め方」で詳しく解説します。
&br
なお、システムによってはゲームマスターではなく、キーパー（KP）などと呼ぶこともありますが、 &em_基本的に役割は一緒 です。

&2 プレイヤーとは
プレイヤーは &em_キャラクターを動かす役目 の人です。
多くの場合、ゲームマスターの人1人以外全員がプレイヤーになります。
&br
キャラクターを作り、キャラクターがやること・できることを考えながら物語をあそんでいきます。

&1 システムとシナリオ
前述の通り、 &em_TRPGはジャンル であり、TRPGの中にはさまざまな &em_システム があります。
システムには例えば「新クトゥルフ神話TRPG」 だったり、「エモクロアTRPG」だったり、「ソード・ワールド2.5」だったりがあります。
&br
これはデジタルゲームに「ポケットモンスタースカーレット」「PUBG」「MineCraft」などがある感覚です。
もしくはTCGに「ポケモンカード」「遊戯王」「デュエル・マスターズ」がある感覚です。
&br
また、デジタルゲームには「ポケットモンスター」シリーズがあって、「ポケットモンスタースカーレット」以外にも「ポケットモンスターソード」や「ポケットモンスターブリリアントダイヤモンド」がありますね。
これも似ていて、RPGにもシリーズ（のようなもの）があります。 
例えば以下のようなものです。
&br
- クトゥルフ神話TRPG
-- 「新クトゥルフ神話TRPG」（7版と呼ばれることが多い）
-- 「クトゥルフ神話TRPG」（6版と呼ばれることが多い）
- ソード・ワールド
-- 「ソード・ワールド2.5」
-- 「ソード・ワールド2.0」
-- 「ソード・ワールド」
&br
前述の通り、 &em_システムごとにルールブック があり、このルールブックを買うことで、デジタルゲームでゲームカセットを買うように、そのゲームを遊ぶことができます。
&br
なお、デジタルゲームに &em_無料のゲームや体験版 があるのと同じように &em_TRPGにも無料で遊べるシステムや、体験版が公開されているシステム があります。

&2 シナリオ
&em_シナリオとは、その時に遊ぶ物語の設定 です。
ルールブックにある舞台設定が「ポケモンという不思議な生き物がいる」ならば、シナリオの設定は「6個目のジムがある何とかシティを目指して旅をしている」とかです。
&br
多くのシステムにおいて、ゲームマスターがシナリオを用意してそれを遊びます。
シナリオはルールブックに載っていたり、ウェブ上に公開されているものを見つけてきたり、 &em_ゲームマスターが自ら作ったり します。

&1 説明を聞いてもよくわからない……
「やっぱりよく分からん」という方、まずは説明が下手で申し訳ございません。
そういう方へおすすめの方法は
&br
- &em_YouTubeでTRPGをやってる動画を見てみる
-- YouTubeをよく見る方は好きなYouTuberさんの名前とTRPGを検索すると、もしかするとその人がやってるかもしれません
-- ちなみに僕の推しの &link_https://www.youtube.com/@sinichaaan,しにがみさん （ &link_https://www.youtube.com/@Nichijo_Gumi,日常組 ）は何度かTRPGを遊んでいます！
- &em_このページを最後まで読んで、とりあえず遊んでみる
-- 僕はかつて友達に「やるぞ！」と言われてよくわからないままに遊び、それを3回くらい繰り返してわかってきました
&br
の2つです。
「見て学ぶ」タイプか、「やって学ぶ」タイプかは人によって違うと思うので、自分に合っていそうな方法を選んでください。
&br
どちらにせよ、 &em_以下に注意することで、より理解を早められる と思うので、おすすめです。
&br
- &link_#ゲームマスターとプレイヤー,ゲームマスターとプレイヤー の役目がどうなっているか
- &link_#システムとシナリオ,システムとシステム は何なのか

&1 TRPGの魅力
ここまでTRPGについての説明で長くなってしまいましたが、ここからは &em_TRPGの魅力 について、個人的な見解を書きたいと思います。
僕の考えるTRPGの魅力は以下の2つです。
&br
- デジタルゲームのRPGより &em_自由なキャラクター で &em_自由な物語 が作れる
- &em_共に遊ぶ仲間と自分たちだけの物語 を作れる

&2 デジタルゲームのRPGより自由
TRPGの魅力の1つはデジタルゲームよりも自由であることです。
キャラクターの能力だけではなく、 &em_見た目・性格・昔あったこと・個性などなど、自由にキャラクターを作る ことができます。
&br
また、 &em_物語も自由 です。
デジタルゲームは（今後のAIの発展によってはどうなるかわかりませんが、）基本的にゲームの開発者が用意した道しか選べません。
それが何千・何万・何億通りあったとしても、やはり用意されたルートしかありません。
しかし、 &em_TRPGでは参加者でトークしながら、物語を作っていく ことができます。キャラクターの発言の選択肢は &em_あなたの頭の中にある言葉全て です。
&br
慣れてきたら &em_自分でシナリオを書く ことができますし、ルールブックにはない &em_オリジナルルールを作って遊ぶこともできます し、さらには自分で &em_システムを作る こともできます。
デジタルゲームでは自分でゲームを作りたいと思っても、プログラミングやグラフィックなど、勉強しないといけないことがたくさんあります。
もちろん、TRPGを作っている人もいろいろなことを勉強して面白いTRPGを作ってくれていますが、 &em_自分だけのTRPGシステムを作るのに必要なのは、まずは想像力だけ です！

&2 共に遊ぶ仲間と自分たちだけの物語
自由にキャラクターと物語を作るだけなら、頭の中で想像するのでも変わりません。
&em_TRPGの最大の魅力 と言えるのは &em_共に遊ぶ仲間 で &em_自分たちだけの物語 を作り、それを &em_共に遊ぶ仲間の中で共有できる ということでしょう。
&br
この興奮はなかなか伝えにくいのですが、個人的には「団体スポーツで一緒に汗水流して練習し、試合に臨む経験」とか「スタジアムでみんなで試合を応援する経験」に近いかなと思ったりします。
自分は参加したことがありませんが、ライブなども似た興奮なのかもしれません。
&br
とにかく、こればかりは &em_体験してみてほしい です！
「TRPGの始め方」は以下で解説するので、ぜひ読んでください！

&2 一旦まとめ
僕の考えるTRPGの魅力は「デジタルゲームのRPGより自由」で、その自由な自分達の物語を「共に遊ぶ仲間と共有できること」です。
&br
抽象的でわかりにくくなってしまいましたが、ある意味では &em_他のもので言い表せない魅力がある ことこそがTRPGの魅力かもしれません。
デジタルゲームが流行する現代になってもなお流行しているTRPG、その面白さをぜひ体験してみてください！

&1 TRPGの始め方
本当にここまで長くなってしまいましたが、ここからは &em_TRPGの始め方について詳しく解説 していきます！
&br
ここまでは概念的で、わかりにくかったかもしれませんが、 &em_「なんとなくわかったかも……？」で大丈夫 です。
TRPGの始め方については &em_具体的に説明 していくので、安心してください。

&2 1.「TRPGとは何か」を知る
TRPGを始めるにあたって、まず最初にやることは「TRPGとは何か」を知ることです。
&em_これはここまで読んでくれた皆さんは既にクリア しています！
&br
詳しく理解する必要はありませんので安心してください。
何となくわかって、何となくやってみたくなっていればOKです。

&2 2.やりたいシステムを探す
何度か繰り返したように、TRPGはジャンルであり、TRPGにはたくさんのシステムがあります。
その中で自分がやってみたいシステムを探しましょう。
……と言っても、たくさんのシステムの中から探すのは大変だと思うので、 &em_ここでTRPG初心者の方におすすめのシステムを紹介 します。

&3 「クトゥルフ神話TRPG」「新クトゥルフ神話TRPG」
どちらも同じシリーズです。元々はアメリカのTRPGで、翻訳されたものです。
現在、YouTubeに多く動画が投稿されており、人気が高いTRPGです。
&br
魅力としては「やっている人が多いこと」「わかりやすいルール」の2点があります。
&br
やっている人が多いことで、 &em_一緒に遊んでくれる人を見つけやすく 、また、 &em_遊び方が合う人が見つかりやすい というメリットがあります。
&br
わかりやすいルールも特徴的です。まず、 &em_舞台設定が基本的に現実世界と同じ です。
能力値が0〜100で表され、 &em_その数値がそのまま成功率 になります。サイコロも10面のものを2つ使って1〜100を表すため、直感的です。
また、そもそもやっている人が多いため、解説記事や解説動画も多いです。
&br
逆に問題があるとすれば、 &em_ルールブックが高い ことでしょう。6,000円以上するため、少し手を出しにくいかもしれません。
ただし、 「新クトゥルフ神話TRPG」には無料で読める体験版の &link_https://product.kadokawa.co.jp/cthulhu/contents/coc_other/entry-183199.html,「クイックスタート・ルール」 があります。
また課金制の &link_https://product.kadokawa.co.jp/cthulhu/app/,アプリ も最近出ました。

&3 「エモクロアTRPG」
こちらは日本のTRPG YouTuberが作ったTRPGです。
最大のメリットは &link_https://emoklore.dicetous.com/,ルールブックなどがウェブサイトで公開 されていて、 &em_完全に無料で遊べる ことです。
&br
また、クトゥルフ神話TRPGと似た設定であるため、無料のエモクロアTRPGで遊んで、TRPGにハマってからクトゥルフ神話TRPGを遊ぶ、なんてこともできます。
似た設定であることから、クトゥルフ神話TRPGをやっている人で、「エモクロアTRPGも遊んでいる」という人も多いです。
&br
ルールの読みやすさ・理解しやすさも良い点です。
&br
また、二次創作関連のルールがしっかりしているため、いろいろな人が独自の拡張ルールを設定していたりもします。

&3 「ソード・ワールド2.5」
こちらは日本でTRPGやボードゲーム・マーダーミステリーなどを作ったり、海外のものを翻訳したりしている企業「グループSNE」によるTRPGです。
かつて日本のTRPGで最も売れたとも言われる「ソード・ワールド」の後継にあたるTRPGで、 &em_ファンタジー世界 を舞台とした作品です。
&br
「ドラゴンクエスト」「ファイナルファンタジー」のようなデジタルゲームのRPGと似た、ファンタジー世界で遊べます。
&br
&em_ルールブックが990円と安い のも特徴です。
&br
たまに戦闘メインでデータが多く、キャラクター作成が大変なゲームだと誤解されていますが、 &em_その魅力は戦闘だけではありません。
個人的には一押しのTRPGです。
&br
ソード・ワールド2.5の魅力については以下のページでより詳しく解説しているので、こちらも読んでください！
&button_/sw25
&br
また、このウェブサイトで初心者向けの解説をしています。
&button_/sw25/forbeginner

&3 「シノビガミ」
こちらも日本でTRPGなどを作っている企業「冒険企画局」によるTRPGです。
忍者……と言ってもいろいろな忍者がいるのですが……になって、それぞれの任務をクリアしていくTRPGです。
&br
あまり遊んだことがないのですが、こちらも &em_ファンが多いTRPG なので、興味があれば調べてみてください。

&3 「ダブルクロス¥sthe¥s3rd¥sEdition」
こちらも日本でTRPGなどを作っている企業「FEAR」によるTRPGです。
舞台は主に現代ですが、特殊なウイルスによって、特殊能力を手にしたキャラクターになって、いろいろな事件（主に特殊能力を悪用する人による事件）を解決するTRPGです。
&br
あまり遊んだことがないのですが、こちらも &em_ファンが多いTRPG なので、興味があれば調べてみてください。

&3 TRPGシステムのまとめ
以上が個人的に初心者におすすめのTRPGシステムです。
色々とありますが、まずはこの中から興味を持ったものをやるのが、良いのかなと思います。

&2 3.ルールブックを準備する
やりたいシステムが決まったら、ルールブックを準備しましょう。
「最初からルールブックを絶対に買わないと」というわけではありませんが、 &em_あったほうが楽しめます し、 &em_あった方がトラブルを避けられる のでおすすめです。
クトゥルフ神話TRPGを遊ぶなら、クイックスタート・ルールだけでもダウンロードしておきましょう。
&br
ルールブックはTRPG初心者にはなかなか読みにくいので、目を通しておくくらいで大丈夫です。

&2 4.どうやって遊ぶか決めて、準備する
TRPGはちょっと前まで集まって遊ぶ遊びでしたが、今ではウェブサイト上で遊ぶ方法も進化し、増えています。
前者の集まって遊ぶ遊び方は &em_「オフラインセッション（オフセ）」 などと呼ばれ、後者は  &em_「オンラインセッション（オンセ）」 などと呼ばれます。
&br
&em_おすすめなのは後者は「オンラインセッション」です。
オフラインセッションだと集まるためにどこかへいく必要があり、また見知らぬ人と会うことには抵抗がある人もいるでしょう。
&br
オフラインセッションに参加したい場合は、自分の住んでいる市町村や都道府県の名前と、遊びたいシステムの名前を入れて検索し、遊んでいる人たちを見つけましょう。
ウェブサイト上で遊ぶ &em_オンラインセッション について、以下ではさらに解説していきます。

&3 ボイスセッションとテキストセッション
オンラインセッションの中でも、その形式から &em_ボイスセッション と &em_テキストセッション があります。
&br
ボイスセッションは、 &em_ボイスチャットを使って、声を出して遊ぶ 方法です。
声によるコミュニケーションなので円滑で、進みが早いですが、家族に声を聞かれるといったデメリットもあります。
声を出すことに抵抗がなければ、ボイスセッション（ボイセ）がおすすめです。
&br
テキストセッションは、 &em_テキストチャットを使って、声を出さずに遊ぶ 方法です。
テキストを打つ時間がかかりますが、声を出さなくていいことがメリットになります。
また、キャラクターになりきって喋る（ロールプレイをする）際に、「恥ずかしくて声が出ない」とならないのもメリットです。
&br
半テキストセッションというのもあります。これはボイスチャットとテキストチャットを組みあわせて遊ぶ方法です。
参加者同士の相談はボイスチャットでやるけど、キャラクターになりきって喋る（ロールプレイをする）際はテキストチャットを使う、ということが多いです。
&br
これらのうち、どれができるのかを考えておきましょう。

&3 オンラインセッションの準備
オンラインセッションをする際には、それ用のウェブサイトを開く必要があります。
ココフォリアやユドナリウムというウェブサイトが使われることが多いです。
これらのウェブサイトはスマホでも動きますが、基本的にPC用に作られています。ので、PCで遊ぶことを想定しておくと良いです。
&br
個人的には &em_初心者にはココフォリアがおすすめ です。
ココフォリアの使い方について、YouTubeなどで調べておくと良いです。
&br
ボイスセッションならさらにボイスチャットのためにDiscordというウェブサイト/アプリを使うことが多いです。
テキストセッションでも、準備の際のコミュニケーションにDiscordを使うことがあります。
これの使い方も調べておくと良いです。

&3 1人で遊ぶ方法もある
「誰かと遊ぶのは怖いから、まずは1人で遊んでみたい」と言う方もいると思います。
ソード・ワールド2.5であれば、1人で遊ぶこともできる拡張ルールブック（サプリメントと呼びます）が発売されています。
&button_/sw25/forbeginner/suppliment/5 詳しくはこちら
&br
他のTRPGシステムでも、システム名と「ソロシナリオ」「GMレスシナリオ」「ソロアドベンチャー」などのキーワードで検索すれば、1人で遊べるシナリオが出てくると思います。
&br
ただし注意として、これらは1人で遊べるようにルールが複雑です。
また、多くのTRPGシステムは複数人で遊ぶことで最も楽しめる遊びです。
1人で遊んでみて、「面白くなかったな……」となっても、よければ誰かと一緒に遊んでみることもしてみてほしいです。

&2 5.一緒に遊んでくれる人を探す
ここまでで、長い準備が終わりました。あとは &em_一緒に遊んでくれる人 を探しましょう。
おすすめの方法は &em_Twitterで探す 方法です。
&br
Twitterをやってない人はアカウントを作りましょう。
また、すでにやっている人も、 &em_TRPG用のアカウントを作ると良い かもしれません。（僕はそうしています。）
&br
あとはTwitterで「#TRPG初心者」「#TRPG」のハッシュタグをつけ、以下の例のようなとツイートしましょう。
載せるべきなのは「遊びたいシステム」と「ボイスセッションか、テキストセッションか」「使いたいウェブサイト」「遊びたい日付」です。
&em_例） 「TRPG初めてですが、ソード・ワールド2.5をココフォリアでのボイスセッションで遊んでみたいです。土曜日の21時以降が良いです。」
&br
そうすれば、上記に挙げたシステムであれば多くの場合、 &em_反応があり、「一緒にやりましょう」と言ってくれる人がいます。
「ルールブックを買ったのですが読めてないです」「ココフォリアの操作は動画を見ただけなのでよくわからないです」などはしっかり伝え、サポートしてもらいましょう。

&3 TRPG自己紹介シート
また、「TRPG自己紹介シート」と呼ばれる画像を作り、「#TRPG自己紹介シート」というハッシュタグをつけてツイートするのもおすすめです。
TRPG自己紹介シートにもさまざまな種類がありますが、 &link_https://create-now.vercel.app/trpg-manual,こちらのウェブサイト で入力できるものが一番手軽に作れておすすめです。
ツイートすればまず間違いなく &em_反応があり、「一緒にやりましょう」と言ってくれる人がいます。

&3 ソード・ワールド2.5の場合は
ソード・ワールド2.5の場合には、Twitterのコミュニティ機能を使って、より募集が見つかりやすくなっているものがあります。
詳しくは以下をご覧ください。
&button_/sw25/tool/community

&3 自分に合う人を見極めよう
もしたくさんの人から「遊びましょう」と言われたら、どうしますか？
個人的なおすすめは &em_自分に合う人を見極める ことです。
&br
具体的な方法としては声をかけてくれた人のツイートを見に行って、普段どんなことをツイートしているか見てみましょう。
もし、そのツイートを見て不快に思ったなら、その人と遊ぶとやはり不快になることを言うかもしれません。
一方で、趣味が似ているなど気が合いそうならその人とはTRPGでも合う可能性が高いです。
&br
ただ、これは可能性の高低に過ぎず、「普段はいい人なのにTRPGの遊び方は合わない」なんてこともあります。
あくまで参考にする程度にしてください。

&2 6.楽しく遊ぼう
一緒に遊んでくれる人を見つけたら、あとはその人にサポートしてもらいながら、 &em_楽しく遊びましょう。
&br
遊んだら、最後に一緒に遊んでくれた人に「楽しかった」などの感想を伝えると良いです。
Twitterで「誰々さんとなになにのシナリオを遊びました〜楽しかったです！」などとツイートするのもおすすめです。
一緒に遊んでくれる人を大切に、素晴らしいTRPGライフを過ごしてください！

&1 最後に
ここまで長い文章をずっと読んでくださった方、ありがとうございます。
このページでは「TRPGって何？」って方がTRPGを始められるよう、いろいろと書かせていただきました。
このページを読んだみなさんが、TRPGを始めて、楽しんでいただけたら幸いです。
&br
TRPGはゲームであり、趣味になると思います。楽しんでナンボです。
一緒に遊ぶ仲間と、全力で楽しんでください！
&br
みなさんが素晴らしい素晴らしいTRPGライフを送ることを心から祈っています。

&2 このウェブサイトについて
このウェブサイトではソード・ワールド2.5などのTRPGで役立つ情報やツールを公開しています。
よければ他のページも見ていってください。
`
</script>