<template>
  <card-array-by-andml :andml="andml" />
</template>

<script setup lang="ts">
const andml = `
しゃちほこ丸の主催する卓でのハウスルールをまとめています。
参加する際は必ずお読みください。
&br
今後も参加する全員にとってより良いセッションができるよう、改善していくつもりです。
ご意見・ご感想等よろしくお願いいたします。
不明点などあればお気軽にご相談ください。
&2 システム別のハウスルールについて
共通ハウスルールのほか、以下に掲載されているシステムは、システム別のハウスルールがあります。
必ずそちらも参照してください。
&button_/me/houserule/sw25 ソード・ワールド2.5

&1 特に守っていただきたいこと
&2 言葉遣い
- PL発言は、周囲の人に誤解を含め不快感を与えないよう、 &em_優しく丁寧な言葉使い を心がけてください
-- 原則として敬体（です・ます調）でお願いします
- PC発言であっても、 &em_差別用語など、見聞きした人が不快になりうる言葉の使用に関しては特に注意 してください
-- PCにこのような発言をさせる場合、「『お前……』と暴言を放ちます」のようにPL発言での説明に止めるようにお願いします
-- これらの言葉を放ちそうなキャラの使用はお控えいただく可能性があります
- セッションは参加者全員が楽しんでこそです &br  &em_ほかのキャラクター・プレイヤーに対する過剰な指示は控えて ください
&2 自己管理
- ご自身の体調等はご自身の責任でお護りください
-- 体調がすぐれない場合、仕事が忙しい場合など、 &em_連絡いただければ遅刻・欠席OK です
-- こちらでは責任を負えません
&2 未成年の場合
- 必ず保護者の方の許可をとるようにしてください
-- こちらでは責任を負えません
&2 無断での遅刻・欠席
- 遅刻・欠席は可能性ができ次第、 &em_なるべく早く連絡 をお願いします
- また仕方ない場合も含め、ひとこと参加者の方に謝罪の言葉をいただけるとありがたいです
&2 脱線
- 雑談が盛り上がるのは良いことですが、 &em_セッション中はセッションから脱線しすぎないよう お願いします
- これはDiscordでのセッション準備でもお願いします
-- セッション中にする必要のない雑談は、セッション以外の時間にTwitterなどでしてください
&2 他作品のキャラクターの使用
- 他作品のキャラクターの使用（いわゆる「なりきり」）を原則禁止しています &br あらかじめご了承ください
-- 例外的に、許可するセッションもありえますが、この際は明言します

&1 ロールプレイについて
&em_いっぱい楽しんでいただきたい です。
ただし、時間に限りもあるので、以下のことをご了承ください。
- GMが「そうこう話していると……」などと言って切り上げた場合、次の場面へ移ってください
-（テキセのみ）送る予定の文章がある場合、なるべく用意しておいてください
-- 例：戦闘が始まるときにこれを言いたい！　攻撃するときにこれを言いたい！
- PC発言であっても、差別用語など、見聞きした人が不快になりうる言葉の使用に関しては特に注意してください
-- PCにこのような発言をさせる場合、「『お前……』と暴言を放ちます」のようにPL発言での説明に留めるようにお願いします
-- これらの言葉を放ちそうなキャラの使用はお控えいただく可能性があります
-  &em_他作品のキャラクターの使用（いわゆる「なりきり」）を原則禁止 しています &br あらかじめご了承ください
- 自分のキャラクターに愛着を持つのは良いことですが、セッションに参加している自覚を持ち、独りよがりなRPは控えてください
- セッションは参加者全員が楽しんでこそです &br ほかのキャラクター・プレイヤーに対する過剰な指示は控えてください
-- 「戦闘で他のPL・PCにも最善手を取らせたい」といった方とは相性が悪いと思われます

&1 ココフォリアのタブの使い方
どこに何があるかわからなくならないよう、以下のようにお願いします。
&em_間違えてしまう分には問題ない ので全力で覚える必要はないです。
&2 メイン
- 行動の宣言
- 判定・成長
- ロールプレイ
-- ボイセの場合も、テキストでのロールプレイを行なっても構いません
&2 情報
- GMが情報を貼る用
&2 雑談
- 点呼（テキセのみ）
-- セッション開始時にココフォリアの雑談タブで点呼を行います &br お返事お願いします
- 質問
-- 例：「ルール分からなかったので解説してください」
- 雑談
-- 例：「このキャラかわいいね〜」などのPL発言
-- セッションに関係ない雑談はお控えください
- 試し振り（例：いわゆる「お祓い」目的のダイスロールも含む）

&1 システム別
共通ハウスルールのほか、以下に掲載されているシステムは、システム別のハウスルールがあります。
必ずそちらも参照してください。
&button_/me/houserule/sw25 ソード・ワールド2.5
`
</script>
