<template>
  <card-array-by-andml :andml="andml" />
</template>

<script setup lang="ts">
const andml = `
&1 ルルブとサプリ
&2 ルールブック未所持の場合
-基本ルールブックIを持っていない場合 &link_https://fujimi-trpg-online.jp/download/sw25.html#sample,サンプルキャラクター での参加となります
-- SW2.0のルールブックを持っている場合でも、SW2.5のものを持っていない場合はサンプルキャラクターでお願いします
&2 使用可能サプリ
原則、以下のサプリが使用可能です。
&br
-
- エピックトレジャリー（ET）
- モンストラスロア（ML）
- メイガスアーツ（MA）
- バトルマスタリー（BM）
- アウトロープロファイルブック（OPB）
-- ヴァグランツ関連はセッションによります &br  &em_特に言及がない場合使用できません
-- 剣の恩寵は不採用です
&br
※ 初心者卓等、サプリを制限するセッションもあります。
&2 SW2.0のルールブック・サプリメント
SW2.0関連はセッションごとに、僕が所持しているものは他のPL次第で参照可能になりえます。
※  &em_原則使えない と思ってください。
僕の所持するものは以下で確認してください。
&button_/me/rulebook 所持ルールブック一覧

&1 戦闘について
- 戦闘ルールは原則として &em_基本戦闘 を採用します
- ボス戦以外では敵データは固定値を使用します
- 自分のPCのバフ・デバフはなるべく、自身での管理をお願いします
- エネミーのデバフに関しては忘れていたら優しくご指摘いただけるとありがたいです
- 弱点はGM側で計算しますが、やはり忘れていたら優しくご指摘いただけるとありがたいです

&1 選択ルール
- 剣の恩寵（→『CBB』『OPB』）は不採用です
- その他の選択ルールについて気になることがあれば、セッションごとに確認してください

&1 シナリオについて
- 舞台は基本的にアルフレイム大陸です &br 希望があればケルディオン大陸への変更が可能です
&2 「地雷」
- いわゆる「地雷」に関しては、網羅できないため、公開しない事がほとんどです
- DMなどで個別に聞いてください
-- なるべく応募前にお願いします
-- セッションのネタバレになりうるものの場合「あるかもしれない」としか答えられない場合があります

&1 キャラクター作成
キャラクターシートは原則として &link_https://yutorize.2-d.jp/ytsheet/sw2.5/?mode=making,ゆとシート を使用してください。
他を使用したい場合、DMなどでご相談ください。
&2 能力値作成
- &link_https://yutorize.2-d.jp/ytsheet/sw2.5/?mode=making,ゆとシートのキャラクター能力値作成 を使用して能力値作成を行ってください
- 能力値は特に指定がない場合、 &em_5回振り （セッションによっては3回まで）とします
- 「名前」はDiscordと一緒にしてください
- &em_「コメント」には「しゃちほこ丸卓」 と入れてください（カギカッコは不要）
- ETを持っている場合、割り振り（→『ET』）の使用もOKです
-- ダイスを振ってからでも可能とします

&2 キャラシ記入の注意点
キャラシ記入する際は以下の注意点をよく読んでください。
- 「プレイヤー名」はDiscordと一緒にしてください
- 「編集保護設定」はアカウントを作成して紐づけるかパスワードを設定してください
- 初期作成の場合、「冒険者技能レベルは最大2まで」を遵守してください（→『I』p. 76）
- 初期作成以外で発生する能力値成長は、最大値がその回数の半分以下になるように自由に割り振りしてOKです
-- 36回以上成長する場合、最低値がその回数の1/36（切り捨て）以上になるようにしてください
- 「所持金」「預金／借金」には auto と書いてください
-- 「作成レギュレーション」「収支履歴」から自動計算が行われるようになります
- 「所持品」には必ず冒険者キットを書いてください
- 「収支履歴」の記入をお願いします
-- 例） &br ソード::-150 &br 冒険者キット::-500 &br 救命草::-50*2
&br
&em_初心者さんの場合 、特に指示がない場合は以下もお願いします。
- 「作成レギュレーション」は編集しないでください
- 「割り振りPt. 」「ポイント割り振りの計算式」は気にする必要ありません（追加ルール用です）
- 「生命抵抗力」「精神抵抗力」「HP」「MP」の後の空欄は空欄のままにしてください
- 「一般技能」は気にする必要ありません（追加ルール用です）
- 「戦闘特技」ではチェックを入れないでください（追加ルール用です）
- 「秘伝」は無視してください（追加ルール用です）
- 「魔物知識」「先制力」「移動力」の後の空欄は空欄のままにしてください
- 「武器」「防具」の「専用」にはチェックを入れないでください

&2 立ち絵について
- 自作でない場合、ガイドライン等に沿って使用してください
- なお、他作品のキャラクターの使用を禁止しています &br あらかじめご了承ください
&2 コマの作成
- ココフォリアにコマを作る際、特にこだわりがなければゆとシートの「出力」を使ってください
- 使い方は以下を読んでください
-- キャラクターシート右上の「出力」をおす
-- 指示通り、コピーまで進む
-- ココフォリア上で「Ctr + V」（Mac OSなら「Command + v」）を押す &br → ココフォリア上にコマが出現します
- コマを自作する場合は、必ずキャラクターメモに「PL名」を記入するようおねがいします。

&1 キャラクター作成の注意点
キャラクター作成に関して、以下をおまもりください。
- PC発言であっても、&em_差別用語など、見聞きした人が不快になりうる言葉の使用に関しては特に注意 してください
-- PCにこのような発言をさせる場合、「『お前……』と暴言を放ちます」のようにPL発言での説明に止めるようにお願いします
-- これらの言葉を放ちそうなキャラの使用はお控えいただく可能性があります
- 他作品のキャラクターの使用を禁止しています &br あらかじめご了承ください
- その他GMの指示に従ってください
&2 &em_継続PCを使用する場合
継続PCについて、以下をおまもりください。
- レギュレーションが「初期作成」の場合、継続PCは使用できません
- 成長回数をレギュレーション以下にしてください
-- 36回以上成長する場合、最低値がその回数の1/36（切り捨て）以上になるようにしてください
- 経験点を「レギュレーション - 1000」以上、「レギュレーション + 500」未満にしてください
- アイテムの「購入額」と所持金の合計がレギュレーション以下になるようにしてください
-- 設定としては「アイテムをギルドマスターや知人に預けている」などといったものになるかと思いますが、GMに相談の上、決定してください
-- アイテムを「購入額」で冒険者ギルドに預けたことにして、レギュレーション以下で購入可能な別のアイテム変更することができます
- 〈冒険者セット〉（→『I』p.320）は必ず購入してください
- その他GMの指示に従ってください
`
</script>
