<template>
    <CardArrayByAndml :andml="andml0" />
</template>

<script setup lang="ts">
const andml0 = `
&1 SW2.5 銭湯ルールについて
このルールはソード・ワールド2.5（SW2.5/ソドワ）で、 &em_銭湯・温泉・サウナ等において 、 &em_他のお客さん（NPC）から情報収集を行う ためのルールです。
&br
ソード・ワールド2.5の舞台であるラクシアには銭湯（公衆浴場）や温泉があることがいくつかのサプリメント等で書かれています。
銭湯や温泉にはいろんな人が集まります。
そんな人たちから情報を集めるためのルールです！
&br
&em_シティシナリオで汎用的に使える ルールとして作成しました。
もしよければ、ご自身のセッション・シナリオに導入してみてください。

&3 注意点など
ルールの改変はもちろんOKで、出典の表記なども一切不要です。
ただ、もしよければこのウェブサイトを紹介いただけると助かります。
&br
なお、混浴・別浴については銭湯によって違うでしょう。
こちらのルールを導入するGMやシナリオ作者にお任せします。
作者は男湯にしか入ったことがないため、男湯を想定しています。

&1 銭湯ルール
銭湯において情報収集するためには、自分と相手が快適であることが重要です。

&2 概要
銭湯には1つから複数の「お風呂」があります。
同じ「お風呂」に入っているNPCからのみ、情報収集ができます。
&br
このルールにおける「お風呂」にはいわゆる風呂のほか、サウナや休憩場所も含みます。
&br
このせんとうルールでは、「お風呂」のデータと、PCの追加ステータスが重要となります。
&br
「お風呂」は「効果」「定員」「入浴人数」の3つのデータ/ステータスを持ちます。
PCは「快適度」と「暑さ」のステータスが追加されます。

&2 PCの追加ステータス
PCは「快適度」と「暑さ」のステータスが追加されます。
&3 快適度
「快適度」は1〜10で表されます。初期値は5です。
10以上になることはありません。
&br
「快適度」が高いほど、情報収集は成功しやすくなります。
&&table_快適度と情報収集のボーナスの変化
|快適度|1|2|3|4|5|6|7|8|9|10|h
|情報収集のボーナス| -5| -2| -1|0|0|0|+1|+1|+2|+3|
&&&
&3 暑さ
「暑さ」も1〜10で表され、初期値は5です。
「暑さ」によっては時間経過するごとに「快適度」が下がります。
&br
ただし、ドワーフなど火属性に耐性を持つPCは「暑さ」の影響を受けません。
&&table_温度と快適度の変化
|温度|1|2|3|4|5|6|7|8|9|10|h
|快適度の変化| -2| -1|0|0|+1|0|0|0| -1| -2|
&&&
PCの追加ステータスはHPやMPのように管理してください。

&2 「お風呂」のデータ
「お風呂」は「名称」「効果」「定員」「入浴人数」の3つのデータを持ちます。
&br
「名称」「効果」「定員」を合わせて「お風呂データ」と呼びます。
&&table_サンプル「お風呂データ」
|名称|効果|定員|h
|普通のお風呂|時間経過で快適度が1、暑さが1上がる|6|
|大きなお風呂|時間経過で快適度が1、暑さが1上がる|12|
|サウナ|時間経過で快適度が1、暑さが2上がる|6|
|水風呂|時間経過で暑さが3下がる|2|
|休憩所|時間経過で快適度が1上がり、暑さが1下がる|4|
&&&

&3 定員と入浴人数（オプションルール）
「入浴人数」は時間経過とともに、PCの選択やNPCの移動によって変化します。
&br
「定員」に対して「入浴人数」が多いと、快適度の上昇量が下がります。
また、情報収集の成功率にも影響します。
&br
以下は「定員」と「入浴人数」による、快適度の上昇量と情報収集の成功率の変化表です。
なお、快適度の上昇量は0以下（マイナス）になることもあります。
&&table_
|入浴人数|快適度の上昇量|情報収集の成功率|h
|定員の半分以下|変化なし|+2|
|定員より少ない|変化なし|+1|
|定員と同じ|変化なし|変化なし|
|定員より多いが、定員の1.5倍以下| -1| -2|
|定員の1.5倍より多い| -3| -10|
&&&
なお、すべて &em_小数点以下切り上げ で計算してください。
&br
定員と入浴人数については処理が面倒になるため、よりシンプルに遊びたい場合には導入しなくても構いません。

&3 お風呂マップ
誰がどのお風呂にいるのか、管理するためには以下のようなお風呂マップを使用します。
&br
以下の2つはサンプルです。
そのまま使用しても構いません。
&img_other/bath/map1.webp,お風呂マップサンプル1
&img_other/bath/map2.webp,お風呂マップサンプル2

&2 情報収集判定
情報収集判定は時間経過のタイミングで、1PCあたり1回、同じ「お風呂」にいるNPCに対して行うことができます。
&br
情報収集判定の目標値は、ボーナスがあることを考え、少し高めに設定しておくと良いでしょう。

&2 時間経過
お風呂に入り、効果を受けて快適度や暑さが変わるのは、 &em_1分（6ラウンド）に一度 です。
「時間経過で〜」と書かれているものは全て1分ごとに処理します。
&br
時間経過のタイミングの流れは以下の通りです。
&br
- 入浴人数を確認する
- 「お風呂」の効果を受けて、PCの「快適度」「暑さ」が変化する
- PCが自身の「暑さ」の効果を受けて、「快適度」が変化する
- 情報収集判定を行える
- NPCが移動するか、GMが決める
- PCが移動する（しなくても良い）
&br
PCは1分ごとに同じお風呂に入ったままでいるか、別のお風呂に入るか、選ぶことができます。
&br
NPCも1分ごとに移動することもあります。
NPCがどのように移動するかはGMが自由に設定してください。
2〜3回の時間経過に1回、移動させるくらいが良いでしょう。

&2 NPC
NPCには情報収集を可能なNPCと、情報収集の対象にならない、有象無象のNPCがいます。
&br
このうち、情報収集の対象にならない、有象無象のNPCをモブNPCと呼びます。
これらのモブNPCはまとめて3〜5人を人組として、お風呂マップ上を動かすと良いでしょう。
&img_other/bath/mobs.webp,お風呂マップサンプル（PC・NPC配置済み）


&1 さらに拡張して遊ぶなら
&2 お風呂データの拡張
より拡張して遊ぶなら、まずは「お風呂データ」に工夫をすると良いでしょう。
快適度の上昇量を「1d6の半分」といった感じでランダム性を持たせると面白いかもしれません。
また、「MPを1点回復する」といった効果があっても面白いでしょう。

&2 トラブルNPC
また、「トラブルNPC」というものも考えています。
モブNPCの拡張として、「お風呂」に対する影響を及ぼすNPCです。
例えば以下のようなデータです。
&&table
|名前|人数|効果|h
|近所の子供たち|3|快適度の上昇量を2下げる|
&&&
`
</script>