<template>
  <card-array-by-andml :andml="andml" />
</template>

<script setup lang="ts">
const andml = `
&1 SW2.5 オリジナルデータ
当ページでは &link_/me,管理人のしゃちほこ丸 が作った &info_sw25 のオリジナルデータを掲載します。
&br
個人的には、 &em_TRPGの醍醐味の1つは自由に拡張できること だと思っています！
「そどわのオリジナル要素が好き！」
「ハウスルール盛り盛りで遊ぶのが好き！」
って方、ぜひご覧ください。
&br
妄想モリモリですが、悪しからず。
&br
「ルールブックにあるルールだけで遊びたい……」
って方は他のページへご移動をお願いします。
&br
主に &link_https://yutorize.2-d.jp/ytsheet/sw2.5/,ゆとシート を使用して公開しています。
ゆとシートの使い方は以下のページをご覧ください。
&button_/sw25/forbeginner/ytsheet

&1 同人サプリメント「シナノシマ」（仮）
いわゆる「和風ファンタジー」をソード・ワールド2.5で遊ぶために管理人が考えた舞台「シナノシマ」の設定と、そのオリジナル技能・オリジナル種族・オリジナル流派を紹介します。
まだ多くが準備中ですが、よろしければ見ていってください。
&br
&ruby_妖,アヤカシ と呼ばれる特殊な魔物が蔓延る島で、オリジナル技能の &ruby_陰陽師,ガーディナー や &ruby_妖術師,アパリシャー が、オリジナル種族クローリーが、活躍します。
&button_/sw25/data/shinano

&1 オリジナル騎獣
騎獣データ、個人的にはもっともっと欲しいので、いろいろと考えて行く予定です。

&2 騎獣/魔物：シロキツネ
騎獣データを増やしたいと作った、シロキツネとその強化形態（？）のデータたちです。
魔物データと騎獣データがあります。
&br
以下のボタンから、一覧を見ることができます。
&button_https://yutorize.2-d.jp/ytsheet/sw2.5/?type=m&tag=%e3%82%b7%e3%83%ad%e3%82%ad%e3%83%84%e3%83%8d こちら

&1 オリジナル流派

&2 流派【ディルガッド鉱山魔動剣術】
マギテック技能と近接戦闘技能を組み合わせるためのオリジナル流派です。
&button_https://yutorize.2-d.jp/ytsheet/sw2.5/?id=Uahf33 こちら

&1 公式派生データ
&2 しゃちほこ丸のユーシズ妄想録
サプリメント「魔導の学府ユーシズ」掲載の魔物の亜種と、ユーシズにありそうな魔法のアイテムたちです。
&br
アイテム「秘伝書」はスカウトに比べて不遇と言われることが多い、セージを強化するアイテムです。
&button_https://yutorize.2-d.jp/ytsheet/sw2.5/?type=m&tag=%e3%81%97%e3%82%83%e3%81%a1%e3%81%bb%e3%81%93%e4%b8%b8%e3%81%ae%e3%83%a6%e3%83%bc%e3%82%b7%e3%82%ba%e5%a6%84%e6%83%b3%e9%8c%b2&sort=lv 魔物一覧
&button_https://yutorize.2-d.jp/ytsheet/sw2.5/?tag=%E3%81%97%E3%82%83%E3%81%A1%E3%81%BB%E3%81%93%E4%B8%B8%E3%81%AE%E3%83%A6%E3%83%BC%E3%82%B7%E3%82%BA%E5%A6%84%E6%83%B3%E9%8C%B2&type=i アイテム一覧

&1 イベント系
&2 ハロウィン
アイデアベースの公開ですが、ハロウィン用の魔物データを公開しています。
&button_/blog/halloween2

&2 クリスマス
クリスマスをテーマにしたシナリオに出てきそうな、クリスマスツリーモチーフの魔物（6レベルと16レベル）です。
&button_https://yutorize.2-d.jp/ytsheet/sw2.5/?tag=%E3%81%97%E3%82%83%E3%81%A1%E3%81%BB%E3%81%93%E4%B8%B8%E3%82%AF%E3%83%AA%E3%82%B9%E3%83%9E%E3%82%B9&type=m こちら

&1 オリジナルルール
&2 銭湯ルール
銭湯で情報収集などをするためのルールです！
&button_/sw25/data/bath

`
</script>
