<template>
    <card-array-by-andml :andml="andml_main" />
</template>

<script setup lang="ts">
const andml_main = `
&1 当サプリメントについて
&ruby_同人,オリジナル サプリメント「シナノシマ」（仮）はしゃちほこ丸が考えたソード・ワールド2.5のオリジナル設定集です。
ラクシアでちょっぴり和風な世界での冒険をするために作りました。
&br
ソード・ワールド2.5なんだけど、ソード・ワールド2.5ではない、そんな冒険を楽しんでいただけたら幸いです。

&2 お願い
このページの内容を使って遊んだり、さらに別のオリジナル設定を使う際は、 &em_以下を記載していただければ幸いです。
「TRPGギルド支部〈しゃちほこの尾びれ亭〉の内容を参考にしています。 https://syachi-hoko-maru.github.io/trpg-system/sw25/data 」
&br
また、このページの内容は執筆中です。
お気をつけください。

&1 シナノシマ
シナノシマはアルフレイム大陸から遥か南南西に位置する小さな島です。
神紀時代、同じ第1の剣陣営でありながらもティダンへ戦いを挑み、敗れたカタミナスが逃げ落ちた土地とされます。
&br
カタミナスは初期に第3の剣カルディアから神格を得たと考えられています。
また、ライフォス・ティダン・キルヒアいずれかの息子とされることもありますが真偽は不明です。
&br
カタミナスが力尽きたことでこの地には第3の剣の力が満ちました。
これはカルディアが砕けてマナが世界中に散らばるよりも前のことでした。
そしてこのシナノシマに満ちた力はカタミナスによってカルディアのものから少し変化していました。
一説によれば、カタミナスは「穢れ」を持っていたとされます。
&br
この特殊なマナから生まれたのがシナノシマ特有の種族「 &ruby_妖,アヤカシ 」です。
その成り立ちを考えればアルフレイム大陸における「妖精」と近い存在ですが、凶悪な性格のものが多いのが特徴です。
&br
シナノシマの人々はこの妖の脅威と闘いながら暮らしています。
アルフレイム大陸同様に蛮族や魔神の脅威もあり、全くもって平和とは言えない日々です。

&2 シナノシマの気候
シナノシマは、年中雲がかかり、日射が弱く、四季があるものの夏でも肌寒いのが特徴です。
これは"太陽神"ティダンに嫌われているから、とされます。
ただ一説によれば以前から日射が弱かったため、カタミナスが逃げる土地として選んだともされます。

&2 シナノシマと大陸
シナノシマは魔動機文明時代中期にアルフレイム大陸の冒険家「マルコ・アース」（人間/男）によって発見されるまで、大陸の人々との交流が途絶えていました。
この原因はティダンらによって禁足地として定められ、少なくとも魔法文明時代中期まではこのことが伝わっていたからだ、と考えられていますが真偽は不明です。
&br
マルコ・アースによる発見以降もシナノシマ近海へ行くと妖の脅威があることから、アルフレイム大陸からの船はあまり来ませんでした。

&2 シナノシマの現在
蛮族や妖との闘いに明け暮れていることや、大陸との交流がなかったことによって、文明はあまり発達しませんでした。
&br
〈大破局〉の際には、それほど責めてくる蛮族は多くなく、魔神も少しばかり増えただけでしたが、妖との闘いでのパワーバランスが崩れ、あと少しで全滅のところまで追い込まれました。
&br
現在は港町であるカミスワが唯一「町」と呼べる規模で、人口は2,000人ほどいます。
他にはカミスワから少し内陸のアズミノ、シノノイなど数箇所に人口50人〜500人ほどの集落があるのみです。
シナノシマ全体でも人口は5,000人いないと考えられています。

&1 シナノシマにおける技能と技
シナノシマでは妖との闘いの中で、独自の技能がいくつか生まれ育ちました。

&2 ガーディナー技能/陰陽師
「ガーディナー」は独自に発達した魔法系統で、陰陽術と呼ばれる魔法を使い、使用者は「陰陽師」とも呼ばれます。
&br
陰陽術には属性攻撃魔法・味方を守る魔法・敵の攻撃を減らす魔法が多いという特徴があります。
また、原理的には真語魔法や操霊魔法に近いとされます。

&3 儀式魔法
陰陽術には儀式魔法と呼ばれる魔法がいくつか存在します。
これらは複数ラウンドに渡って使うことで効果を発揮する魔法で、手間はかかりますが、かなり強力な効果を発揮します。

&3 結界
ガーディナー技能を使うもの、すなわち陰陽師の最も大切な仕事が「結界」を張ることです。
結界には妖を遠ざける効果があります。
きちんと張られた結界の中には妖は入れないので、町の結界を維持することが生活を守ります。
&br
また戦闘中には「簡易結界」と呼ばれる簡易的な結界を作り、味方を守ることに使います。
&br
結界は一部の簡易結界を除き、儀式魔法によって張られます。

&2 アパリシャー技能/妖術師
「アパリシャー」は妖の力を扱う技能です。妖術と呼ばれる魔法を使い、使用者は「妖術師」とも呼ばれます。
&br
やっていることはフェアリーテイマーと近いですが、実際はデーモンルーラーの方がより近いと言えます。

&2 プリースト技能について
このシナノシマに伝わる神はカタミナスだけです。
そのためシナノシマの「プリースト」は全員がカタミナス神官となりますが、このカタミナス神官はかなり特殊です。
&br
特殊神聖魔法が多く、特に自らを含む周りを強化するものが多い半面、カタミナスの性質からか回復がかなり苦手になります。

&2 その他の技能について
&3 使われない技能
一方で大陸との交流が少なかったことでアルフレイム大陸で知られる魔法使い系技能を使うものはほとんどいません。
アルケミスト技能についても使う人はほぼ居ません。

&3 失伝がある技能
エンハンサー技能・ライダー技能・ウォーリーダー技能については一部の技が「失伝」しています。

&3 同様に使われる技能
以上にあげていない戦士系技能、スカウト・レンジャー・セージ技能、バード技能、ジオマンサー技能はアルフレイム大陸と同様に使われます。

&2 シナノシマの技
妖との戦いの中で独特の技が生み出されたのもシナノシマの特徴です。
&br
特徴的なものの1つに「タテシナ仙術」と呼ばれるものがあります。
これはシナノシマの練体士が使う、特殊な練技です。
なお、シナノシマの練体士は【ガゼルフット】【ビートルスキン】などが失伝によって使えません。
&br
また、「ウエダノシノビ術」はシナノシマに伝わる流派で、この使い手は「知を持って回避する」と言われます。
&br
これらの中にはシナノシマの生まれなら誰でも教えてもらえるものもありますし、入門するために一定以上の名声が必要なものもあります。

&1 PCとなる種族
&2 主な人族
シナノシマの人族は、約4割を人間が占め、リカントが2割ほど、タビットとナイトメアが1割ほどを占めます。
残りの2割は主にエルフ・ドワーフ・メリア・グラスランナー、そしてクローリーです。
&br
シナノシマではナイトメアが生まれやすいため、人間やエルフ・ドワーフの数が少なくなっています。
ナイトメアはやはり生まれる際に角によって母体を傷つけてしまうことがありますが、ナイトメアが多いことと、そもそも妖に襲われて死ぬことの多いこの島で死は日常と隣り合わせであることで、ほとんどナイトメアに対する迫害などは起きていません。
&br
アルフレイム大陸の人族のうち、ルーンフォークとソレイユは存在しません。
ルーンフォークは妖精と同様に妖も見ることができないため、シナノシマにきても生きていくのは難しいでしょう。
ソレイユが存在しないのは彼らがティダンの加護を受けているからだとされます。
シャドウもほとんど存在しません。これはやはりシーンの加護によるものだと考えられています。
&br
ウィークリングもほとんど見られません。これは蛮族の住む地域から人里へ逃げる途中で妖に襲われてしまうからだと考えられています。
&br
その他の人族は少数存在します。この中にはアルフレイム大陸やテラスティア大陸から渡ってきた冒険者やその子孫が多く含まれます。

&3 寿命について
シナノシマでは寿命を全うする人族は少なく、多くは妖や蛮族の襲撃によって命を落とします。
50年生き残れば御の字であり、結果として長命種族のエルフや成人年齢が高いリルドラケンの数が少なくなり、短命なタビットやグラスランナーの割合が高くなっています。

&2 クローリー
シナノシマ以外ではほとんど見られない、ほぼ固有の種族がこのクロウリーです。
頭部が鳥の姿をしており、背中には翼が生え、手足も鳥の様です。蛮族であるガルーダに酷似しており、シナノシマの外から来た人からは警戒されますが、歴とした穢れを持たない人族です。
体長は男女ともに1.8mほどで、ガルーダよりも小柄です。
&br
敏捷と知力と精神力が高いため、ガーディナー技能やアパリシャー技能、スカウト技能やレンジャー技能に適性があります。

&1 シナノシマの魔物
&2 &ruby_妖,アヤカシ
妖はカタミナスが力尽きた際に発生した変異したマナが、妖精と同じように自然現象と結びついて生まれた存在です。
かなり凶悪な性格をしており人を襲うため、シナノシマの人々は妖と闘いながら生きていくことを迫られています。
&br
彼らの体は実態を持たず、武器による攻撃でダメージを与えることは困難です。
しかしシナノシマでは武器に特殊な加工をしたり、自らの拳などに波導の力をこめたりすることで、彼らにダメージを与えています。
魔法の武器や銀の武器での攻撃は可能です。
&br
妖はその強さによって知能にかなり差があります。
低レベルの妖は本能的に暴れ回ります。
高レベルの妖には人を超える知能を持つものもおり、危険です。
&br
ただし知能が高い妖でも、ただただ暴れることが目的であるため、結託して人々を襲うということはありません。
これがここまで人々が生きてこられた理由とされます。
&br
また人族だけでなく、蛮族・魔神・アンデッドなども襲いますし、妖同士で戦うこともあります。
&br
なお、ルーンフォークがもしシナノシマに来た場合、妖精同様に妖を見ることもできません。

&2 蛮族
シナノシマの蛮族はアルフレイム大陸と似た種族が存在します。
ただしドレイクやノスフェラトゥの存在は確認されておらず、シナノシマでもっとも脅威となる蛮族はバジリスクです。
&br
妖は蛮族も襲うため、蛮族も陰陽術を使って結界を張ることがあります。
また妖術を使う蛮族もいるようです。

&3 ナガノシ
ナガノシと呼ばれる蛮族の町は強力な結界が張られており、少なくとも数百の蛮族が暮らしているとされます。
また人族の奴隷が飼われているという話もあります。

&2 魔神
魔神はアルフレイム大陸ほどではありませんが、シナノシマにも出現します。
&br
彼らのほとんどはアルフレイム大陸の方向から海を渡ってやってきます。
そのためシナノシマに出現する魔神は空を飛べる種族ばかりです。
&br
"奈落の魔域"の発生が確認されたことはありません。

&2 アンデッド
アンデッドはアルフレイム大陸同様に発生しますが、妖の襲撃を受けるため、それほど脅威になっていません。

&1 シナノシマの特殊なアイテム
&2 ヒヒイロカネ
濃い赤色をした金属で、シナノシマ以外での発見事例はありません。
シナノシマではカタミナスがティダンから奪った魔剣によって生成される金属だと考えられています。
&br
武器をヒヒイロカネによって加工することで、妖に対して有効な武器にすることができます。

&2 騎獣
シナノシマには以下の騎獣のみが存在します。

&3 ホース
ホースはアルフレイム大陸とほぼ同様で、同じデータとして扱います。
少しだけ小柄です。

&3 マンモス
マンモスは巨大な体と巨大な牙を持つ象です。
【チャージ】【トランプル】が強力になる能力「超突撃」、敵を遠くへ投げる「鼻で投げる」などの能力を持ちます。
乗るためには流派【シオジリ騎乗戦闘術】の秘伝《マンモス騎乗》が必要になります。

&1 ガーディナー技能と陰陽術
シナノシマにおいて妖との戦いの中、独自に生まれた魔法「陰陽術」を使う魔法使いがガーディナー、もしくは陰陽師です。
&br
ガーディナーの町や集落での役割は、「結界」を張ることです。結界には妖を遠ざける効果があり、きちんと張られた結界の中には妖は入れません。
逆に結界が維持できなければ町や集落の中にまで妖が襲ってきてしまいます。かつていくつもの集落が結界が維持できなかったことで滅びました。
そのため妖の脅威と隣り合わせのシナノシマにおいて、ガーディナーは必須の存在といえ、集落で最も強力なガーディナーは実質的な最高権力者となります。
&br
権力を行使するか、しないかはかなり個人によります。
また、優秀な指導者として集落を大きくすることもあれば、権力に溺れて失敗し集落後と滅びることもあります。
&br
冒険者となるガーディナーの多くは結界の維持をローテーションで行う、見習いから中堅クラスの者たちです。彼らは結界の維持を一時的に他の者へと任せ、他の冒険者仲間と冒険に出かけます。
冒険の中でもガーディナーは必須の存在です。いつ襲ってくるかわからない妖に対し、すぐに簡易的な結界を展開し、妖の攻撃から味方を守りつつ、隙があれば攻撃も行います。

&3 習得可能な言語
-「古代シナノシマ語」：会話/読本

&3 行える判定
- 魔法行使判定（『ルールブックI』p.116）
- 儀式判定

&3 ガーディナー技能を制限される種族
- なし
-- ただし真語魔法や操霊魔法を使えない種族はこの魔法も使用することはできません

&2 陰陽術
陰陽術はガーディナー技能を習得することで使用できる様になる魔法です。
原理的には真語魔法や操霊魔法に近いとされます。

&3 陰陽術の使用条件
- 魔法の発動体：真語・操霊魔法と同様に〈魔法の発動体〉が必須となります
-- シナノシマでは板に魔力を注入した〈札〉を使うことがほとんどです
- 移動：制限移動
&br
陰陽術を使用する際には舞うように動きながら、古代シナノシマ語によって詠唱を唱えます。
そのため、以下の条件があります。
&br
- 発声：古代シナノシマ語による発声ができない場合、魔法行使判定に-4のペナルティ修正を受けます
-- ［異貌］時のナイトメアはこの制限を受けません
- 自由の確保：自由に動けない場合、行使できません
- 鎧の制限：真語・操霊魔法（『ルールブックI』p.197）と同じです


&3 陰陽術の特徴
陰陽術には属性攻撃魔法・味方を守る魔法・敵の攻撃を減らす魔法が多いという特徴があります。

&2 儀式魔法と儀式判定
陰陽術には儀式魔法と呼ばれる特殊な魔法がいくつか存在します。
&br
儀式魔法には「儀式発動値」「継続発動値」「継続値」という3つの特殊な値があります。

&3 儀式の用意
儀式魔法を使う際、まず「儀式」を用意する必要があります。
「儀式」を用意できるのは儀式魔法である陰陽術を使用可能なキャラクターのみです。
「儀式」を用意することは補助動作で行うことができます。
&br
「儀式」は「儀式達成値」という値を持ちます。初期値は0です。
&br
「儀式」は陣営ごとに1つまでで、新たに「儀式」を用意すると前あった「儀式」はなくなります。
この際、前あった「儀式」の「儀式達成値」は引き継がれません。

&3 儀式判定と儀式達成値
「儀式」が用意されている陣営のキャラクターは、その儀式魔法の定めるMPを消費することで「儀式判定」を行うことができます。
「儀式判定」を行う際、ガーディナー技能は必須ではありません。
&br
「儀式判定」を行った場合、達成値を「儀式」の「儀式達成値」に足します。

&3 儀式達成値の持ち越し
「儀式達成値」は基本的に減ることはなく、ラウンドが変わっても持ち越されます。
ただし、ラウンドの終了時、このラウンドでの「儀式達成値」の上昇分が儀式魔法の「継続値」を下回っている場合、「儀式達成値」は0となってしまいます。

&3 儀式魔法の発動
「儀式達成値」が「儀式発動値」を初めて超えたとき、儀式魔法が発動します。
儀式魔法の対象の決定は発動する際に、儀式を用意したキャラクターが選びます。

&3 儀式魔法の継続発動
また、「儀式発動値」を超えたあとは、そのラウンドで初めて、このラウンドでの「儀式達成値」の上昇分が「継続発動値」を超えた場合、儀式魔法が発動します。
儀式魔法が発動する回数は、たとえキャラクターが何人「儀式判定」を行ったとしても、陣営ごと、ラウンドごとに1回だけです。
&br
「儀式達成値」が「儀式発動値」を超えた後であっても、ラウンドの終了時、このラウンドでの「儀式達成値」の上昇分が儀式魔法の「継続値」を下回っている場合、「儀式達成値」は0となってしまいます。

&3 儀式判定
基準値：ガーディナー技能レベル+知力ボーナス+精神力ボーナス
所要時間：10秒（1ラウンド）
解説：儀式魔法の発動のために使用する判定です。
この際、「陰陽術の使用条件」に記載される魔法行使判定の制限・ペナルティと同様の制限・ペナルティを受けます。
この判定は例外として、ガーディナー技能を持っていないキャラクターも、基準値として「精神力ボーナス」を使用することができます。この際には「陰陽術の使用条件」に記載される魔法行使判定の制限・ペナルティと同様の制限・ペナルティは受けません。
自動成功の場合、達成値は『ルールブックI』p.98の記載通りに処理されます。

&2 陰陽術データ
準備中……

&1 アパリシャー技能と妖術
アパリシャーは &ruby_妖,アヤカシ の力を利用する魔法使いで、妖術師とも呼ばれます。
「妖術」と呼ばれる独自の魔法を操ります。
&br
「妖術」の中でも妖を呼び出して自らに憑依させる「口寄せ」はかなり危険ですが、とても強力な術となります。
&br
アパリシャーは町の中での結界維持が最も重要な役割であるガーディナーと異なり、結界の外での妖退治が最も重要な役割となります。
そのためアパリシャーのほとんどが冒険者となります。
&br
ガーディナーほど社会的地位は高くありませんが、妖に対抗するための重要な戦力であることは確かであり、昔からシナノシマで活躍しているため、偏見や差別はほとんどありません。

&3 習得可能な言語
-「古代シナノシマ語」：会話/読本

&3 行える判定
- 魔法行使判定（『ルールブックI』p.116）

&3 アパリシャー技能を制限される種族
- ルーンフォーク
-- 妖精魔法を使えない種族はこの魔法も使用することはできません

&2 妖術
妖術はアパリシャー技能を習得することで使用できる様になる魔法です。
原理的には妖が妖精と近いことから妖精魔法に近いとされますが、一方で敵対するものの力を強引に支配して使う点でデーモンルーラーの招異と近いともいわれます。

&2 口寄せ
妖術「口寄せ」を使用すると自らに妖を憑依させることができます。
この状態を「口寄せ状態」と呼びます。
口寄せ状態では憑依する妖にごとに特殊な能力を得たり特定の能力値が上昇したりします。これは「妖能力」と呼ばれます。
&br
口寄せによって憑依する妖は基本的にランダムに決まりますが、特定の妖を口寄せすることが可能になる妖術もあります。

&3 口寄せできる妖
口寄せできる妖は「口寄せデータ」を持っています。
&br
口寄せデータには「第一抵抗目標値」「第二抵抗目標値」「妖能力」があります。

&3 抵抗
口寄せ状態の時、自分の手番の開始時に精神抵抗判定を行います。
&br
達成値が妖の第二抵抗目標値以下だった場合、HPに（妖の魔物レベル）点の確定ダメージを受けます。
さらに達成値が妖の第一抵抗目標値以下だったなら、その手番は強制的に終了します。

&3 口寄せの終了
口寄せ状態の時、1ラウンドに1回だけ補助動作で「口寄せの終了」を試みることができます。
精神抵抗判定を行い、達成値が妖の第二抵抗目標値以下だった場合、口寄せを終了することができます。
&br
この際、精神抵抗判定が自動成功の場合を除き、HPに（妖の魔物レベル）点の確定ダメージを受けます。

&2 妖術データ
準備中……

&1 カタミナス神官の神聖魔法について
準備中……

&1 シナノシマの流派
準備中……

&1 新種族解説：クローリー
シナノシマ以外ではほとんど見られない、ほぼ固有の種族がこのクロウリーです。
頭部が鳥の姿をしており、背中には翼が生え、手足も鳥の様です。蛮族であるガルーダに酷似しており、シナノシマの外から来た人からは警戒されますが、歴とした穢れを持たない人族です。
体長は男女ともに1.8mほどで、ガルーダよりも小柄です。
&br
卵生で15歳で成人として扱われます。寿命については、前述の通りシナノシマではほとんどが寿命を全うすることなく命を落とすため詳しくはわかっていませんが、100年程度だと考えられています。
&br
出自については謎が多いですが、シナノシマでは一般的にカタミナスによって力を与えられた人間、もしくは鳥の子孫だと考えられています。
また、リルドラケンと近い種族と考えられることもあり、リルドラケンから派生したのではないかとも言われます。
&br
上述のガルーダやリルドラケンと異なり、筋力が低く、器用度も高くないため、戦士には向きません。
これをクローリーたちは、筋力が自慢であったカタミナスがティダンに負けたことで筋力以外に注目して先祖に加護を与えたからだと考えています。
&br
一方で敏捷度・知力・精神力が高いため、ガーディナー技能やアパリシャー技能、スカウト技能やレンジャー技能に適性があります。

&3 クローリーの生まれ
陰陽師：ガーディナー　技4・体4・心13
妖術師：アパリシャー　技3・体6・心12
神　官：プリースト　　技3・体7・心11
斥　候：スカウト　　　技7・体4・心10
野　伏：レンジャー　　技6・体5・心10
学　者：セージ　　　　技3・体5・心13
趣味人：バード　　　　技4・体3・心14

&3 クローリーの能力値の決定
A：1d
B：2d+5
C：1d
D：2d
E：2d+1
F：2d

&2 種族特徴
クローリーは［鳥の翼］と［鋭い爪］という2つの種族特徴を持ちます。
さらに種族特徴の強化よって［不屈の精神］を得ます。

&3 ［鳥の翼］
1日に8ラウンドまで飛行を行うことができます。この際、命中や回避へのボーナスはありませんが、戦闘特技《鷹の目》と同じ効果を発揮します。
なお、重いものを持つことはできず、他の人を連れての飛行や、金属鎧を着ての飛行はできません。

&3 ［鋭い爪］
〈格闘〉カテゴリBランクの武器〈爪〉（必筋1・威力5・C値9）を得ます。これは「〈パンチ〉を強化する武器」（『ルールブックI』p.309）として扱います。
他の〈格闘〉カテゴリの武器を使うことはできません。

&3 種族特徴の強化
6レベル：新たに種族特徴［不屈の精神］を得ます。
11レベル：［不屈の精神］が強化され、さらに精神力が+2（合計+4）されます。

&3 ［不屈の精神］
精神力が+2されます。


&1 ヒヒイロカネ加工
準備中……



// &1 メモ
// &2 流派アイデア
// ・タテシナ仙術
//     エンハンサー拡張
//   【フォックスアイデア】
// ・ウエダシノビ術
//     スカウト/フェンサー
//   《みきり》
//   《一点集中》
// ・シオジリ騎乗戦闘術
//     ライダー
//   《名乗り攻撃》
//   《一斉突撃》
//   《マンモス騎乗》
// ・チクマ戦場指揮術
//     ウォーリーダー
//   《反撃の？陣》
// ・マツモト道場術
//     グラップラー
//   《波導撃》
`
</script>