export const crawleyAndml = `
&1 クローリー
シナノシマ以外ではほとんど見られない、ほぼ固有の種族がこのクローリーです。
頭部が鳥の姿をしており、背中には翼が生え、手足も鳥の様です。蛮族であるガルーダに酷似しているため、シナノシマの外から来た人からは警戒されますが、歴とした穢れを持たない人族です。
体長は男女ともに1.8mほどで、ガルーダに比べると小柄です。
&br
卵生で15歳で成人として扱われます。寿命については、前述の通りシナノシマではほとんどが寿命を全うすることなく命を落とすため詳しくはわかっていませんが、100年程度だと考えられています。
&br
出自については謎が多いですが、シナノシマでは一般的にカタミナスによって力を与えられた人間、もしくは鳥の子孫だと考えられています。
また、同じく卵生であるリルドラケンと近い種族と考えられることもあり、リルドラケンから派生したのではないかとも言われます。
&br
上述のガルーダやリルドラケンと異なり、筋力が低く、器用度も高くないため、戦士には向きません。
これをクローリーたちは、筋力が自慢であったカタミナスがティダンに負けたことで筋力以外に注目して先祖に加護を与えたからだと考えています。
&br
一方で知力・精神力が高いため、ガーディナー技能やアパリシャー技能、バード技能やウォーリーダー技能に適性があります。
敏捷度が高いことを考えればスカウト技能としても一定の活躍が期待できます。

&4 初期習得言語
「シナノシマ語」の会話と読本

&4 習得不可の技能
なし

&4 クローリーの生まれ
&&table
||生まれ|初期習得技能|初期能力値|初期経験点|h
|2〜4|陰陽師|ガーディナー|技4・体4・心13|2000|
|5|妖術師|アパリシャー|技3・体6・心12|2500|
|6|神官|プリースト|技3・体7・心11|2000|
|7|斥候|スカウト|技7・体4・心10|2500|
|8|野伏|レンジャー|技6・体5・心10|2500|
|9〜10|学者|セージ|技3・体5・心13|2500|
|11・12|趣味人|バード|技4・体3・心14|2500|
&&&

&4 クローリーの能力値の決定
&&table
||クローリー|h
|A|1d|
|B|2d+5|
|C|1d|
|D|2d|
|E|2d+1|
|F|2d|
&&&

&3 種族特徴
クローリーは［鳥の翼］と［鋭い爪］という2つの種族特徴を持ちます。
さらに種族特徴の強化よって［不屈の精神］を得ます。

&4 ［鳥の翼］
1日に8ラウンドまで飛行を行うことができます。この際、命中や回避へのボーナスはありませんが、戦闘特技《鷹の目》と同じ効果を発揮します。
なお、重いものを持つことはできず、他の人を連れての飛行や、金属鎧を着ての飛行はできません。

&4 ［鋭い爪］
〈格闘〉カテゴリBランクの武器〈爪〉を得ます。これは〈パンチ〉を強化する武器として扱います。
他の〈格闘〉カテゴリの武器を使うことはできません。
&weapon_爪（クローリー）

&3 種族特徴の強化
6レベル：新たに種族特徴［不屈の精神］を得ます。
11レベル：［不屈の精神］が強化され、さらに精神力が+2（合計+4）されます。

&4 ［不屈の精神］
精神力が+2されます。
`;
