<template>
    <card-array-by-andml :andml="andml" />
</template>
  
<script setup lang="ts">
const andml = `
&1 「だいすろーる！」ってどんなマンガ？
「だいすろーる！」は高校に入学した主人公「千幸」が「冒険者ギルド部」に入部して、 &em_女の子4人でTRPG を楽しむ、そんなマンガです。
&br
ソード・ワールド2.5（SW2.5/ソドワ）を遊んでいる様子が描写されており、 &em_ラクシアでの冒険者の様子 もマンガで読むことができます！
&br
そんな「だいすろーる！」を紹介します！
ぜひ読んでいってください。
&br
電撃G'sコミックにて連載されていて、ニコニコ静画やコミックウォーカーにて &em_無料 で読めちゃいます！
&button_https://seiga.nicovideo.jp/comic/64359 ニコニコ静画で読む
&button_https://comic-walker.com/contents/detail/KDCW_AM09204189010000_68/ コミックウォーカーで読む
&br
ニコニコ静画のアプリでも読めます！
&em_ニコニコ動画のようなコメント付きで読めて面白い ので、ぜひお試しください！

&2 コミック発売！
2024年1月26日、1巻が発売されます！
&br
見逃していた方、今がチャンスです！
&br
すでに読んだ人もぜひ！　印刷された「だいすろーる！」をゲットしましょう！！
&amazon_だいすろーる

&1 「だいすろーる！」の魅力は？
「だいすろーる！」の魅力を聞かれたら、僕は以下の3点を紹介します！
&br
- &em_キャラクターがとってもかわいい！
- &em_ラクシアでの冒険がマンガで 読める！
- &em_TRPGあるある を楽しめる！

&2 キャラクターがとってもかわいい！
イラストもキャラクターもとってもかわいいです！
&br
まずはイラストを見てみてください！
あらたとしひら先生の描くイラスト、とってもとってもかわいいです。
&br
そしてキャラクターがとってもいいんです！
&br
主人公の千幸は生まれつきの不運体質。TRPGでも肝心なところで出目が悪かったり......。
そんな主人公を支える部長の美歩先輩ことミホ・クローネは「かわいい厨二病」。
りねんちゃんはお父さんがTRPG好きでTRPG経験者。
依理ちゃんはリアルで冒険に行きたくて勘違いして入っちゃった。
&br
こんな感じで4人ともとってもいいキャラクターで、とにかくかわいいんです！
&br
&em_かわいい女の子たちがゆるふわな雰囲気でTRPGを遊ぶマンガ 、最高じゃないですか？

&2 ラクシアでの冒険がマンガで読める！
ソード・ワールド2.5を遊ぶシーンがいくつかあり、そこでは &em_キャラクターが冒険する様子 も描かれています！
&br
4人がGMとPLとして遊ぶ様子も描きつつ、ラクシアでPCが冒険する様子も描かれていて、とっても素敵です！
&br
&em_ラクシアの武器や防具への解像度 も上がります！
&br
しっかりとグループSNEが監修にはいってます！

&2 TRPGあるあるを楽しめる！
ダイスを買いに行ったり、お泊まりで遊んで寝落ちちゃったり......。
&em_TRPGあるある が楽しめます！
&br
TRPGを遊んでいる方、遊んでみたい方、ぜひぜひ読んでください！
めっちゃ共感して、「いいよね〜〜」「あるあるだよね〜〜」ってなります！

&1 「だいすろーる！」はどんな人におすすめ？
僕が「だいすろーる！」をおすすめしたいのは、以下の条件に当てはまる人です！
&br
- TRPGが好き
- ソード・ワールドが好き
- &em_きらら系の女の子がゆるふわしたマンガ が好き
&br
これらに２つ以上当てはまってるなら読まない選択肢はありません！
&br
1つでも当てはまっているならまずは読んでみてほしいです。
&br
そうでなくとも、このページを開いてくださった方なら、まずは読んでみて欲しいです！

&1 まとめ
とにかく、「だいすろーる！」はとっても素敵なマンガです！
無料で読めちゃうので、まずは読んでみてください！
&button_https://seiga.nicovideo.jp/comic/64359 ニコニコ静画で読む
&button_https://comic-walker.com/contents/detail/KDCW_AM09204189010000_68/ コミックウォーカーで読む
&br
&br
このウェブサイトでは以前にもブログで「だいすろーる！」を紹介しています！
よければ合わせてご覧ください〜。
&button_/blog/comic
&button_/blog/comic2
&button_/blog/comic3

&2 コミック発売！
2024年1月26日、1巻が発売されます！
&br
見逃していた方、今がチャンスです！
&br
すでに読んだ人もぜひ！　印刷された「だいすろーる！」をゲットしましょう！！
&amazon_だいすろーる

&2 関連ページ紹介！
このウェブサイトでは他にもTRPGやソード・ワールド2.5に関するお役立ち情報などをまとめています！
ぜひご覧ください！！
&button_/sw25
&button_/sw25/forbeginner
&button_/sw25/tool
&button_/sw25/feature/new
`
</script>
  