<template>
    <CardArrayByAndml :andml="andml_start" />
    <CardArrayByAndml :andml="andml_end" />
</template>

<script setup lang="ts">
const bookList: { type: string, name: string, list: { name: string, month: number, intro: string, with?: string, page?: string }[] }[] = [
    {
        type: "suppliment",
        name: "サプリメント",
        list: [
            {
                name: "ブルライト博物誌",
                month: 2,
                intro: `ソード・ワールド2.0時代にも人気だった「博物誌」シリーズ復活ということで話題になりました。
                &br
                1つの地方にフォーカスし、その地方の特産品や流派（特殊な戦闘スタイル）を紹介するという特徴はそのままに、よりガイドブックらしくなったことでより読みやすく、読んでいて楽しくなっています。
                &br
                2024年1月にはドーデン博物誌が出ます！　内容は以下で紹介中です。`,
                page: "/blog/doden2",
                with: "ドーデン博物誌"
            },
            {
                name: "エンシェントブルー",
                month: 4,
                intro: `ブルライト博物誌に続いてブルライト地方を舞台としたバトルブック系サプリメントが出ました。海を旅して古の宝を見つけるといった内容で、1人のPLが2人のPCを操るシステムも導入されました。
                『モンストラスロア』が必須なのが少し遊びにくいですが、おすすめです。
                &br
                と言いつつ、遊び終わってないので年末年始に進めたいなぁと思っております。`,
                page: "/blog/ancient3",
                with: "モンストラスロア"
            },
            {
                name: "アーケインレリック",
                month: 7,
                intro: `ソード・ワールド2.5の5周年のタイミングで出た今年の大型サプリメントです。種族と秘宝がテーマということで、新種族に「希少種」、アイテムなど追加されました。
                &br
                特に「希少種」は革新的な要素で、個人的には待望の、最高の要素です。
                &br
                要素が多すぎるので詳しくは以下をみてください。`,
                page: "/blog/arcane_relic6",
            },
            {
                name: "ラクシアライフ",
                month: 10,
                intro: `ラクシアの市民の生活に注目したサプリメントということで、ほとんど追加データ等はなく、その代わり一般技能の大幅拡張などが行われています。
                &br
                ラクシアでの生活に根付いた冒険や、村を襲ってきた蛮族を追い払うために村人たちが普段の仕事（きこりとか大工とか）を活かして戦うと言ったシナリオなどを遊ぶことができます！
                &br
                こちらも要素が多いので、詳しくは以下を見てください。
                `,
                page: "/blog/life2",
            }
        ]
    },
    {
        type: "scenario",
        name: "シナリオ集",
        list:
            [
                {
                    name: "猫と星と秘宝",
                    month: 8,
                    intro: `2022年に出たシナリオ集「ストーリーフラグメンツ」に続いて出た、シナリオを元にした小説+シナリオです。
                    ストーリーフラグメンツより多い3シナリオが載っています。
                    &br
                    とっても面白いのでぜひぜひ買って読んで遊んで楽しんでください。
                    詳しくは発売後のブログで書いてます。`,
                    page: "/blog/cat2",
                },
                {
                    name: "ギルドマスター・ウォーロックの依頼録",
                    month: 11,
                    intro: `シナリオが17本も載った超豪華なシナリオ集です。
                    6レベルまでのシナリオを中心に、GMウォーロックに掲載されたシナリオが載っています。
                    &br
                    書き下ろしも2本あり、GMなしで1人で遊べるシナリオ（ソロアドベンチャー）もありでかなり充実しています。
                    シナリオを探している方はもちろん、シナリオ作成の参考にもおすすめです。
                    `,
                },
            ],
    },
    {
        type: "replay",
        name: "リプレイ",
        list: [
            {
                name: "ALLグララン総進撃！",
                month: 1,
                intro: `&link_https://kakuyomu.jp/contests/sword_world,2021年春に開かれた「ソード・ワールド2.5リプレイコンテスト」 で大賞を受賞し、加筆修正の上で本として出版されたリプレイです。
                &br
                全員がグラスランナーのパーティというだけで面白いのに展開も面白く、最高です。
                まだの方、ぜひ読んでください。
                &br
                ただし、美味しそうな二郎系らーめんの描写があり、このせいで二郎系に再び通うようになってしまった僕は5kgほど体重が増えました。読む際はご注意ください。
                &br
                ところで作者の青猫あずき先生はいつのまにかサプリメントの執筆にも関わっているようで、そちらでも才能を発揮されているようです。`,
                page: "/blog/grarun"
            },
            {
                name: "時の魔域と秘宝の守り人",
                month: 6,
                intro: `『アーケインレリック』の先出として、新種族であるスプリガン・アビスボーン、「希少種」であるスノウエルフなど、そして「秘宝」が登場しました。
                作者はリプレイ『ユーシズ魔法学園録』シリーズを手がけた機体の新人、小山輝一郎先生。『ユーシズ魔法学園録』に引き続きとても面白い内容でした。
                `
            },
        ],
    },
    {
        type: "orher",
        name: "その他の関連本",
        list: [
            {
                name: "異世界冒険ガイド　きみならどうする!?　街での冒険",
                month: 5,
                intro: `2022年に発売された『異世界冒険ガイド　きみならどうする!?　初めての冒険』の続編で、ソード・ワールド2.5と同じラクシア（アルフレイム大陸）を舞台に、街での冒険で起きる色々なシチュエーションを選択肢形式で体験し、街での冒険で気をつけることがわかる、と言った感じの本（小説？？）になっています。
                &br
                「シティシナリオでどこを探索するか迷っちゃう」という方や「シティシナリオ作りたいけどどうすればいいんだろう？」と言った方にもおすすめです。
                &br
                前編の『異世界冒険ガイド　きみならどうする!?　初めての冒険』や類似シリーズの『異世界武器ペディア』と一緒に、ラクシアでの冒険や生活を妄想するための一助としてぜひ！
                &br
                単純に読み物としても面白いのでぜひお読みください！
                以下でシリーズまとめて紹介しています。`,
                with: "異世界",
                page: "/sw25/forbeginner/isekai"
            },
        ],
    }
]

const andml_start = `
&1 2023年はソード・ワールドの新刊がいっぱい発売されました！！！
2023年はソード・ワールド2.5（SW2.5/ソドワ）が激アツな1年でした！
&br
1月に発売された『ALLグララン』、2月に発売された『ブルライト博物誌』から始まり、計9冊のサプリメントやシナリオ集・リプレイ・関連本が発売されました。
7月には5周年を迎え、盛り上がりを見せています。
&br
そんな激アツだった2023年のソード・ワールド2.5をまとめて紹介します！

&3 2023年に発売されたソード・ワールド2.5関連本一覧
以下が今年（2023年）に発売されたソード・ワールド2.5に関する本です！
&br
${bookList.map(t => [`-${t.name}`, ...t.list.map(b => `--『${b.name}』（${b.month}月発売）`)].join("\n")).join("\n")}
&br
&br
以下ではそれぞれの本について紹介していきます！

${bookList.map(t => [
    `&1 2023年に発売された${t.name}`,
    `2023年にはソード・ワールド2.5の${t.name}が${t.list.length}冊発売されました。 &br &br`,
    ...t.list.map(b => `- 『${b.name}』`),
    "&br 以下で詳しくみていきます。",
    ...t.list.map(b => `&2 ${b.name}\n『${b.name}』は2023年${b.month}月に発売されました。\n&br ${b.intro}\n${b.page ? `&button_${b.page}` : ""} \n&amazon_${b.name + (b.with ? "・" + b.with : "")}`)
].join("\n")).join("\n")}

`


const hashTagLink = "https://twitter.com/search?q=%232023%E3%81%AB%E4%BD%9C%E3%81%A3%E3%81%9F%E3%82%82%E3%81%AE%E3%82%92%E6%8C%AF%E3%82%8A%E8%BF%94%E3%82%8B%20from%3Asyachi_hoko_trp"

const andml_end = `
&1 2023年のソード・ワールド2.5
ソード・ワールド2.5にあった新刊の発売以外の動きを最後に紹介します！

&3 5周年
まずはなんといっても2023年7月に5周年を迎えたことでしょう。
5周年記念で購入特典ができたり、『アーケインレリック』を中心とした3カ月連続刊行があったり、いろいろありました。
&br
最近は公式イラストを多数手掛けているみかきみかこ先生が同人誌としてイラスト集を出してくださいました！
&br
5周年、半分は終わっちゃいました。
が！　半分は残ってます！　のでこれからも全力で盛り上げましょう。
&button_/blog/celebrate

&3 アルケリンガ
2023年春、大阪の梅田駅すぐの場所にグループSNEとcosaicによるボードゲームカフェ「アルケリンガ」が開店しました！
&br
ソード・ワールド2.5の執筆者がGMをするイベントが毎月のようにあり、とても盛り上がっているようです。
大阪近辺にお住まいの方はぜひ行ってみてください。
&br
アルケリンガへ行った際のブログがあるのでぜひこちらもご覧ください。
&button_/blog/alcheringa
&br
1月には『ドーデン博物誌』の発売に合わせたセッション（GM：ベーテ先生）があるようです！
詳しくは以下をご覧ください。
&button_https://x.com/GroupSNE/status/1739558911622221889 グループSNE公式Twitter
&br

&3 マンガ「だいすろーる！」
ソード・ワールド2.5がでてくるマンガ、「だいすろーる！」の連載（ウェブサイト/アプリ）が始まったのも2023年です！
&br
女子高生たちがTRPGをわちゃわちゃ遊ぶマンガ、とっても素敵なのでぜひ読んでください。
&br
以下で紹介しています。ぜひぜひ読んでください。
&button_/sw25/comic

&1 まとめ
9冊も発売されたの、とってもありがたいですね。
財布へのダメージはありますが、公式からの供給が多いのは喜ばしいことです！！
&br
他のTRPGが1・2冊で発売が終わったり、続いているものも年間1〜3冊程度が多いので、いかにソード・ワールド2.5が盛り上がっているかがわかります。
&br
前作のソード・ワールド2.0は10年続いてから2.5になったので、2.5もあと5年、しっかり盛り上がって欲しいものです。
&br
そしてソード・ワールド3.0なり、ソード・ワールド2.75（！？）なりがいつか出るのも楽しみです。

&2 告知
告知が4つあります！

&3 2024年の新刊情報！
2点目として、2024年の新刊情報がすでに出てきています！
2023年以上に激アツな予感です！
&br
本業も頑張ってしっかり資金を貯めるつもりです！
&br
以下のブログにまとめていますので、ぜひぜひご覧ください。
&button_/blog

&3 シナリオ投稿企画
最後に3点目として、2024年1月発売予定の『ドーデン博物誌』に便乗して、有志によって「ドーデン冒険録」というシナリオ投稿企画が開かれます！
ぜひぜひぜひ参加してください！
&br
シナリオの書き方などDiscordで相談できますので初心者・シナリオ投稿未経験者の方もぜひお気軽に！

&3 2023年の振り返り
1点目として、このサイトの管理人であるしゃちほこ丸が2023年に作ったものを &link_${hashTagLink},Twitterのハッシュタグ「#2023に作ったものを振り返る」 でまとめて紹介しています！
よろしければご覧になってください！
&br
このサイトも1年目ということでいろいろと頑張りました〜。
2024年も頑張っていく所存です。
&button_${hashTagLink} Twitter
&br

&3 SW2.5自己紹介シート
ソード・ワールド2.5を遊んでいる人同士がつながりやすくなるよう、当サイトでは簡単な入力で「SW2.5自己紹介シート」を作れるサービスを展開しています！
&br
2024年1月8日までは年末年始限定のレッドverを展開中です。
&br
この機会にぜひ、作ったことがある方も作り直して、2024年にともにセッションを遊べる仲間を増やしましょう。
&br
皆様に素敵な出会いがあることを祈っております。
&button_/sw25/tool/intro
`
</script>