<template>
  <card-array-by-andml :andml="andml" />
</template>

<script setup lang="ts">

const andml = `
Twitterにはソード・ワールド2.5（SW2.5）に関するコミュニティがあります。
&br
Twitterの機能なので抜けるのも見ないのも簡単です。
お気軽にご参加ください。

&1 ソード・ワールド2.5（SW2.5）卓募集用コミュニティ
オンラインセッションの募集・応募ができるコミュニティです。
「募集しても人が集まらない……」「ソドワの募集が全然ない……」って方のため、 &em_オンラインセッションが見つかりやすくなる よう作りました！
&br
&em_初心者・未経験者も大歓迎 ですので、「SW2.5に興味あるんだけど、一緒にやる人がいない」とか、「ルールブック買ったけど積んだまま……」って人も、 &em_お気軽にご参加 ください。
&br
Twitterのコミュニティ機能なので、 &em_覗くのも入るのも抜けるのも自由 にできます。
Discordより気楽に出入りできるのでまずはお気軽に覗いてみてください。
&br
ボイセもテキセも半テキセもOK、単発セッションの募集も、キャンペーンの募集などもあります。
&button_https://twitter.com/i/communities/1549495894386434048 こちら
&br
なお、「募集しても人が集まらない」原因の1つに、「応募方法などが書いていないため、応募を躊躇ってしまう」「FF内限定かと思って声をかけづらい」というものがあります。
セッションの募集をする際はこちらの募集画像作成ツールを活用し、 &em_必要事項を全て掲載 いただければと思います。
&button_/sw25/tool/bosyu

&1 ソード・ワールド2.5雑談コミュニティ
&link_https://twitter.com/DagonUnder6Feet,文盲のDagonさん が作ってくださった、ソードワールド2.5に関する雑談を目的としたコミュニティです。
&em_こんなセッションしたくない？ 　みたいな雑談からそのまま企画が生まれることも……。
&br
ぜひ参加して、ソドワの話をしましょう！
&button_https://twitter.com/i/communities/1553004504890880000 こちら
`
</script>
