<template>
  <card-array-by-andml :andml="andml1" />
  <pages-intro-form />
  <card-array-by-andml :andml="andml2" />
</template>

<script setup lang="ts">
import { isPast } from '~/src/util/date';

const { $templateText } = useNuxtApp()
const andml1 = `
&1 このページについて
このページでは「SW2.5 自己紹介シート」を &em_ウェブサイト上で内容を入力し、入力済み画像をダウンロード することができます。
動作確認は主にPCで行っていますが、スマートフォンでも問題なく動作するはずです。

&2 SW2.5 自己紹介シートとは
「SW2.5 自己紹介シート」とは「TRPG自己紹介シート」の類で、Twitterなどでソード・ワールド2.5に関する自己紹介をする際、自分について知ってもらうためのシートです。
&br
※「ソード・ワールド2.5って何？」って方は &link_/sw25,こちら をご覧ください。

${!isPast("2024/1/9") ? `
&2 年末年始限定デザイン
&em_2023年12月27日から2024年1月8日まで 、年末年始限定デザインということで、デザインをレッドverに変更しています！
既に作っていただいた方も、 &em_この機会にぜひ作成し直してツイート し、知り合いの幅を広げていただければと思います！
`: ""}
&1 使い方
1.¥s 以下の &link_#データ入力,「データ入力」 からデータを入力してください
&br
2.¥s データの入力が終わったら「画像を作る」ボタンを押してください
- ボタンは &link_#データ入力,「データ入力」 の下部にあります
&br
3.¥s &link_#プレビュー,「プレビュー」 に入力済み画像が現れるので、保存してください
- PCなら右クリック、スマートフォンなら長押し
// - できない場合には下にある「ダウンロード」ボタンも活用してください
&br
4.¥s Twitterに投稿してください
- 「#sw25」「#sw25自己紹介シート」や「#TRPG好きと繋がりたい」「#TRPG自己紹介シート」などのハッシュタグをつけるのがおすすめです
- Twitter以外で使用いただいても構いません
-  &em_プレビューの下にある「ツイート用ボタン」 を押すことで、これらのハッシュタグが入力されたツイート画面が開きますので、ぜひご利用ください
-- &em_画像は添付されないので、ダウンロードの上、ご利用ください

&2 所要時間
所要時間は &em_スムーズに入力すれば1〜2分 で、あとは「好きな種族」「好きな技能」を考える時間って感じです！
&em_だいたい5分 もあれば完成すると思います！

&2 注意点
ソード・ワールド2.5の認める範囲内において、この画像は自由にご利用いただけます。
ただし &em_自作発言はお控えください。
&br
またこちらのページのURLを共有していただければ幸いです。

&1 未入力のシート
自身で編集したい方のため、未入力のシートをPNG形式とSVG形式でダウンロード可能となっています。
&em_これらの画像を未編集で配布することはご遠慮ください。
また、 &em_右下の製作者の表示を消すのもご遠慮ください。

&3 PNG
いわゆる普通の画像形式です。詳しくない方はこちらをご利用ください。
&br
「画像を作る」ボタンを押す前に &link_#プレビュー,「プレビュー」 にある画像を保存してください。
すでに「画像を作る」ボタンを押している場合、 &em_ページを更新 してください。

&3 SVG
データが汚いのは我慢していただくようお願いします。
※文字は全てアウトライン化されております。
&button_${$templateText.baseUrl}/image/sw25intro/intro.svg こちら
${!isPast("2024/1/9") ? `
&button_${$templateText.baseUrl}/image/sw25intro/intro_red.svg 年末年始限定デザインはこちら
`: ""}
`
const andml2 = `
&1 しゃちほこ丸のSW2.5自己紹介シート
これを作った僕しゃちほこ丸（ &itwitter ）の自己紹介シートはTwitterと以下のページで公開しています。
よければ仲良くしてくだされば幸いです。
&button_/me

&1 その他のページ
ソード・ワールド2.5の初心者向け情報はこちら！
&button_/sw25/forbeginner

「サプリメントってどんなのがあったっけ？」って方はこちらをどうぞ〜
&button_/sw25/forbeginner/suppliment
&button_/sw25/forbeginner/suppliment/ranking

他にもソード・ワールド2.5（SW2.5）さまざまなツールを公開しています。
ぜひご活用ください。
&button_/sw25/tool

Twitterで一緒に遊ぶ人を集める場合に便利なTwitterコミュニティがあります。
&button_/sw25/tool/community

さらに &em_ソード・ワールド2.5に関する情報をまとめたり考察をしたり しているページは多々あります。
ぜひご覧ください。
&button_/search?word=sw25 こちら
`

</script>