<template>
    <card-array-by-andml :andml="andml2" />
</template>

<script setup lang="ts">
const andml2 = `
&1 このページについて
このページではこのウェブサイトの管理人しゃちほこ丸（ &itwitter ）が &link_https://shindanmaker.com/,診断メイカー で作った診断を紹介します！
&br
TRPG、特にソード・ワールド2.5（SW2.5/ソドワ）に関する役立つもの、面白いものを作ったので、よければ見ていってください！
&br
※「ソード・ワールド2.5って何？」って方は以下のページをご覧ください！
&button_/sw25

&1 SW2.5関連の役立つ診断
&3 SW2.5ランダムシナリオメイカー
TRPG「ソード・ワールド2.5」のシナリオをランダム生成します。
アイデア出しに、即興シナリオ作りに、活用してください！
&button_https://shindanmaker.com/1123981 こちら

&3 SW2.5レギュレーションメイカー
TRPG「ソード・ワールド2.5」のレギュレーションをランダム生成します。
成長回数・合計経験点・所持金・所持名誉点・所持アビスシャードがランダムに決まるので、出てきたレギュレーションを「大商人が冒険者になってみた」「弱い敵をひたすら倒したら経験点だけ溜まった……」などとこじつけて、遊んでみてください！
いつもとは違ったソード・ワールド2.5を遊べると思います！
&button_https://shindanmaker.com/1101279 こちら

&1 SW2.5関連の役には立たない診断
&3 SW2.5あなたがラクシアに転生したら……？
もしあなたがSW2.5の舞台ラクシアに転生したら、種族と技能が何になるかの診断です。
キャラクター作成の参考に……なるのかは不明です。
&button_https://shindanmaker.com/1092694 こちら

&3 異世界でのあなたの種族をAIに聞いてみよう！
もしあなたがSW2.5の舞台「ラクシア」に転生したら種族が何になるか？
AI（ChatGPT）が理由付きで教えてくれ（ることがあり）ます。
&button_https://shindanmaker.com/1166125 こちら

&3 兎年、タビットを使おう！
2023年1月1日に作成した、タビットの技能を決めてくれる診断です。
&button_https://shindanmaker.com/1151137 こちら

&1 サイコロ系診断
&3 夏も近づく1d100夜
「夏も近づく八十八夜」が出る確率は0.25%です。
&button_https://shindanmaker.com/1122654 こちら

&3 初詣、1d100拝1d100拍手1d100拝
初詣で神社に行ったとき、参拝方法忘れがちじゃありませんか？
&button_https://shindanmaker.com/1151140 こちら

&3 2dを振ろう
2d6を振る、ただそれだけです。
&button_https://shindanmaker.com/1109410 こちら

&1 その他のTRPGに関する診断
&3 AIが考える、あなたのためのTRPG
AI（ChatGPT）があなたのためのTRPGシステムを考えてくれるというものです。
割と面白いゲームアイデアを教えてくれたりします。
&button_https://shindanmaker.com/1168656 こちら
`
</script>