<template>
  <PagesWalker :andml="andml" />
</template>

<script setup lang="ts">
const andml = `
&1 "ラグーンの村" ブラーラ
いきなり紹介するところが俺のイメージにあってないだって？
うるせぇ。余計なお世話だ。
&br
俺はソレイユだからよ、砂浜で寝て太陽を感じるのが大好きなんだよ。
&br
&br
ブラーラはハーヴェスから東に歩いて2日ほどの距離にある浜辺の村だ。
&br
冒険者をしてる奴らには貴族の奴らの別荘があることで有名なんだろうが、それだけじゃねぇ。
てのも、ブラーラは2つのラグーンがあって、別荘があんのは西側の方。んで、東側にはのどかな漁村が広がってんだ。
&br
まぁ、俺も最初は貴族を別荘まで護衛する依頼のために行ったんだけどな。
そこで出会ったガキに教えてもらったんだ。
&camera_blara,ブラーラの村と砂浜,"ラグーンの村"¥sブラーラ

&1 ブラーラで
朝、愛馬に乗って出かけると昼過ぎにブラーラの村に着く。
&br
俺はいつも通り〈ペンション鯨の歌声〉に向かう。
ここがこの村唯一の宿だ。
一応冒険者ギルド支部を兼ねてるらしいが、所属してる冒険者はいない。
何か村で起きたときはハーヴェスの冒険者ギルド支部に依頼するらしい。
&br
着くと今日はガキに迎えられた。
このガキはリュー・カイールって言う。
この宿をやってる夫婦の子供で、俺にこの村を教えてくれたガキだ。
&br
「ライにーちゃんだー！　久しぶりー！」
と言って荷物を部屋に運んでくれる。
女将さんも出てきて「待ってたよー」と声をかけてくれる。
アットホームでいい宿だ。
&br
んで、荷物を置いたら砂浜に行く。
行って昼寝する。

&1 ブラーラの砂浜
砂浜について紹介しておくと、砂州で囲われたのどかな海になってる。
まぁ正確には砂州で囲われてるから海じゃなくて湖らしいんだが、湖っていうから飲んでみたらしょっぱかった。
&br
この海だか湖だかにはラグーン・ラクーンがいる。
この地域の動物で、穏やかな海で揺られて過ごすらしい。
なんだかわからんが、かわええ。
あれをぼーっと見ながら寝るのは最高だ。
&br
俺がうとうとしながらラグーン・ラクーンを見てたら、仰向けで浮いているラグーン・ラクーンのお腹にウミドリが降り立った。
にも関わらず、ラグーン・ラクーンはぽかーんと浮かんでやがる。
&br
何も気にしてねぇのか、鈍臭いのか……。
どっちにしろかわええな。

&1 ブラーラの食事
一眠りして〈ペンション鯨の歌声〉に戻る。
女将さんから「ご飯まではもう少し待ってねー」と言われたんでシャワーを浴びてくる。
&br
夕飯はもちろん魚だ。
〈ペンション鯨の歌声〉では家族3人と一緒に飯を食う。
冒険者ギルド支部の酒場での食事とは違う感じがまた落ち着くもんだ。
&br
この村の魚はうめぇ。女将さんの料理はとにかくうめぇ。
今回の夕飯はシンプルに塩を塗って焼いた魚と、魚の食べにくい部分を入れたスープ（「あら汁」って呼ぶらしい）だ。
とにかくうめぇ。
&br
ちなみに
&br
まぁこれは上手く伝えられねぇから、行って食ってくれ。
&br
&br
ブラーラについてはこんな感じだ。
まぁなんだ？　興味が出たら行ってみてくれ。
&br
道中にはあんま強え魔物は出ねぇから、数回の経験はある冒険者さえ雇えばなんとかなるはずだ。

&1 ブラーラの設定集
&3 "ラグーンの村"¥sブラーラ
ハーヴェスから東に歩いて2日ほどの距離にある浜辺の別荘地と、その横にある浜辺の村。

&3 〈ペンション鯨の歌声〉
ブラーラ唯一の宿で、（最低限）冒険者ギルド支部としての機能ももっている。

&3 その他
&4 ラグーン・ラクーン（動物）
9割以上の時間を穏やかな海に浮いて、揺られて過ごす不思議なタヌキ。
食事は適当に取れた魚か、陸へ上がって木の実などを食べる。
最近、ザムエル賢者学院（『ブルライト博物誌』p.50）の研究によって幻獣のエメラルドラクーンとは何の関係もないことがわかってきている。

&1 ブラーラのNPC
&3 〈ペンション鯨の歌声〉
&4 マーサ・カイール（人間/女/34歳）
〈ペンション鯨の歌声〉の女将。
〈ペンション鯨の歌声〉のもろもろを一手に担っている。

&4 ジーザ・カイール（人間/男/36歳）
マーサ・カイールの夫。普段は漁師をしている。

&4 リュー・カイール（人間/男/8歳）
〈ペンション鯨の歌声〉を運営する夫婦の息子（次男）。
ブラーラで元気な子供達の1人。

&4 ザイル・カイール（人間/男/15歳）
〈ペンション鯨の歌声〉を運営する夫婦の息子（長男）。
今は冒険者をしており、ブラーラにはいない。

&3 その他のNPC
&4 "黄金の右腕"¥sレイザ・ザッカバーイ（人間/男/45歳）
ハーヴェスの宮廷貴族"黄金の道標"ヒンメル（『ブルライト博物誌』p.53）の側近とされる宮廷貴族です。
ブラーラに別荘を持っており、たびたび訪れています。
ヒンメルや他の宮廷貴族を連れてきていることもあるようです。

&4 "動物大好き"タブリール（タビット/男/22歳）
ハーヴェスにあるザムエル賢者学院（『ブルライト博物誌』p.50）の幻獣科の教授です。
ラグーン・ラクーンの生態が面白いと言ってたびたび〈ペンション鯨の歌声〉に泊まりにきて、調査しています。
ただラグーン・ラクーンの可愛さの虜になっているという噂もあります。
`;
</script>
