<template>
    <CardArrayByAndml :andml="andml0" />
</template>

<script setup lang="ts">
const andml0 = `
&1 ルルブとサプリ、紙と電子書籍のどちらが良いのかを解説します！
「TRPGをいざ始めようと思ったけど、ルールブック・サプリメントを紙の本で買えばいいか、電子書籍で買えばいいか分からない……。」
&br
そんな悩みを抱えている皆さんに役立つように、どちらも使ったことがある僕なりに、メリット・デメリットをまとめて解説します！

&1 僕はどうしているのか
最初に参考になるよう、僕が紙を使っているのか電子書籍を使っているのか、紹介します。
&br
僕は基本的に &em_電子書籍メイン です。
&br
とはいえ、（購入時に）電子書籍で出ていないものは &em_紙の本 で持っています。
また、一部のルールブック・サプリメントは &em_紙の本と電子書籍、どちらも 所持しています。
&br
電子書籍はほとんどを「BOOK¥sWALKER」というKADOKAWAが運営する電子書籍サイトで購入しています。
ごく一部をKindleで購入しています。
&br
電子書籍を読む際には5年くらい前のiPadをメインに使用しています。
電車の中でパッと見たい時にはスマホで読むこともあります。

&1 紙の本のメリット/デメリット
紙の本のメリットには以下のようなものがあります！
&br
- 触りやすい
- コレクションできる
- 書き込める
&br
一方、デメリットとしては以下のようなものがあります。
&br
- 持ち運ぶには重い
- かさばる
&br
それぞれの点について解説していきます。
&br
まぁ、紙の本はわかりやすいですね。
&br
&em_ページの捲りやすさはやはり絶対的 ですし、  &em_何よりコレクションとして素敵 です。
ルールブック・サプリメントが並んでいる本棚は眺めているだけで最高です。
&br
また、書き込みができるのも人によってはとても便利でしょう。
&br
一方で対面セッションを遊びに行くときに何冊もサプリメントを持っていくとなると重くて大変です。
ちょっと通勤・通学の時間に読みたいといっても、会社や学校に持っていくのは大変でしょう。
&br
また、本棚の場所を取り過ぎてしまいます。


&1 電子書籍のメリット/デメリット
電子書籍のメリットには以下のようなものがあります！
&br
- いつでも読める
- 紙の本のデメリットがない
-- 持ち運ぶのが容易
-- 保管が用意
- 割引・ポイント還元が多い
- エラッタが適用される
-昔の本でも買える
&br
一方、デメリットとしては以下のようなものがあります。
&br
- 操作性が良くない
- サービス終了で読めなくなる恐れがある
&br
それぞれの点について解説していきます。
&br
まずは &em_持ち運びが容易 で、 &em_いつでも読める というメリットです。
スマホがあれば見ることができるので、通勤・通学中の電車など、  &em_いつでもどこでもルールブック・サプリメントを確認できます。
忙しい人でも嬉しいですね。
&br
また、保管が用意です。
本棚が邪魔ってことは全くありません。
引越しが多い人でも大丈夫です。
&br
そして、 &em_割引やポイント還元でお得に買うことができる ことも大きなメリットです。
僕が使っているBOOK¥sWALKERの場合、年に数回30％ほどのポイント還元が、年に1,2回は50%のポイント還元があったりします！
そして初めての場合は45%のポイント還元があったりもします。
僕はこういうキャンペーンを活かしてソード・ワールド2.0のサプリメントを揃えていってます。
&br
そして、ソード・ワールド2.0のサプリメントやソード・ワールド1stのルールブック・リプレイのように、 &em_本屋ではなかなか出会えない昔の本も簡単に入手できる のもメリットです。
&br
一方でやはり、操作性がなかなか悪い気もします。
慣れてきてかなり上手く使えている気はしますが、それでも紙の本の方が開きたいページをすぐ開けます。
&br
あと、ちょっと前のiPadで読んでいるのですが、 &em_タブレットって1冊の本に比べると重い んですよね。
持ち運びは楽ですが、読む際はちょっと大変です。
これは最新の軽量なタブレットを買えば解決するのかもしれませんが……。
&br
そして &em_万が一にサービスが終了した場合、読めなくなってしまう という問題もあります。
なので、変なサービスを使うのはおすすめしません。
僕は「KADOKAWAなら大丈夫だろう」と思ってBOOK¥sWALKERを使っていますが、保証はできません。
でも家が火事になることだってありえないわけではないので、万一の時はしょうがないって割り切るしかないと思います。

&2 電子書籍はどうやって読むのがいいか
個人的には &em_タブレットとスマホの併用がおすすめ です。
&br
TRPGのルールブックやサプリメントは自動でページレイアウトが調整されるわけではなく、紙と同じページ構造になるので、それなりに大きな画面ではないとかなり読みにくいです。
その面でもタブレット、それも小型ではないものが個人的にはおすすめです。
&br
BOOK¥sWALKERはPCからも見ることもできます。
が、PCではダウンロードして読むことはできないため、ページの表示が少し遅いと感じることがあります。
ので、おすすめはしません。

&1 まとめ
改めて、紙の本と電子書籍のメリット・デメリットをまとめると以下の感じです。
&&table
||紙の本|電子書籍|h
|メリット|触りやすい &br コレクションできる &br 書き込める|いつでもどこでも読める &br 保管が用意 &br 割引・ポイント還元が多い &br エラッタが適用される &br 昔の本でも買える|
|デメリット|持ち運ぶには重い &br 保管が大変|操作性が良くない &br サービス終了で読めなくなる恐れ|
&&&
これらを比較して、自分にあったものを買うのがおすすめです。
&br
また、僕が使っている電子書籍サイトBOOK¥sWALKERでは試し読みができるので、購入前に操作感などを確認しておくと良いでしょう。
&br
以上、TRPGのルールブックやサプリメントは紙の本がいいか、電子書籍がいいかの比較でした。
参考になっていれば幸いです。
&br
もし周りで困っている人がいれば広めてください！
よろしくお願いします。
`
</script>