<template>
  <CardArrayByAndml :andml="andml1" />
  <card>
    <template #title>おすすめシナリオ一覧</template>
    <Andml :andmls="andml2" />
    <template v-for="s of ss" :key="s.author">
      <item-head3>{{ s.scenario }}</item-head3>
      <div>
        作者：{{ s.author }}
        <template v-if="s.twitter">
          （<item-textlink :to="`https://twitter.com/${s.twitter}`">Twitter：@{{ s.twitter }}</item-textlink>）
        </template>
        <div class="my-2">
          <Andml :andmls="s.explain" />
        </div>
        <item-button :url="s.link">こちら</item-button>
      </div>
    </template>
  </card>
  <CardArrayByAndml :andml="andml3" />
</template>

<script setup lang="ts">
const andml1 = `
&1 このページでは
このページではソード・ワールド2.5の初心者GM向けに、シナリオを探す方法と個人的な &em_おすすめシナリオ を掲載しています。
GMをする際、ほとんどの場合、シナリオを準備する必要があります。
&br
シナリオを準備する方法は大きく分けて2つ、自分で作る方法と、他の人が作って公開されているものを見つけてくる方法があります。
しかし、 &em_自分で作るにしても、他の人が作ったシナリオを読むことはめちゃくちゃ参考 になります。
&br
シナリオを探すといっても、いろいろな方法があり、またggっても出てこないことがあります。
このページでは &em_僕の知っているソード・ワールド2.5のシナリオの探し方を網羅 し、それぞれのメリット・デメリットなどを説明しているので、参考にしてください！
&br
なお、ここに書かれている方法はソード・ワールド2.5だけではなく、 &em_クトゥルフ神話TRPGなどの他のTRPGでもシナリオを探す際に参考になるはず です。TRPGのシナリオを探す方法で困っている方はぜひご一読ください。

&1 公式シナリオを使う方法
まず最初に紹介するのは公式シナリオを使う方法です。
&br
公式シナリオはルールブックやサプリメント、またGMウォーロックなどのサポート誌に載っています。

&2 ルールブック掲載のシナリオを使う
&em_最初にGMをする際には、ルールブック掲載のシナリオを使うのがめちゃくちゃおすすめ です。
特にルールブックI掲載のシナリオは &em_公式が初心者GMを想定して作っている のでめちゃくちゃおすすめです。
ルールブック掲載のシナリオのメリットはクセが少なく、「これぞソード・ワールド2.5」というセッションができます。
&br
デメリットとして、「遊んだことがある人やシナリオを読んだことがある人が多い」ことがあります。
そのため、 &em_GM練習として割り切ってシナリオを知っている人に参加してもらう のがおすすめです。
「GM練習に付き合わせたい訳じゃない」って人は別の方法を使うと良いかもしれません。
&amazon_ルールブック

&2 サプリメント掲載のシナリオを使う
サプリメントのうち、ツアーサプリにはシナリオがついていることが多く、バトルブックサプリはサプリ全体が大きなシナリオとなっています。
なお、 &link_/sw25/forbeginner/suppliment/1/#サプリメントの分類,サプリメントの分類についてはこちらを参照 してください。
&br
このうち、初心者GMにおすすめなのはツアーサプリに掲載のシナリオを使うことです。
というのも &em_バトルブックサプリは追加ルールが多く、またプレイ時間が長いため、初心者向けではありません 。
&br
しかし、ツアーサプリは初心者がまず買うのにはそれほどおすすめではない（大型サプリの方がおすすめ）というデメリットがあります。
&br
初心者におすすめのサプリメントについて、詳しくは以下からご覧ください。 &em_どのサプリメントにシナリオが掲載されているか もここで見ることができます！
&button_/sw25/forbeginner/suppliment/1
&amazon_デモンズライン・ヴァイスシティ・エンシェントブルー・エピックトレジャリー

&2 GMウォーロックなどのサポート誌掲載のシナリオを使う
GMウォーロックやRoll&Rollなどのサポート誌には、ソード・ワールド2.5のシナリオが載っていることが多いです。
また、「サポート誌までは買わない」人や「買ってもシナリオは読まない」人が多いです。
それほど癖がないシナリオもあります。
&br
しかし、初心者がまず買うべきものではない（先にサプリメントを買う方が良い）と思っています。
なので、もし慣れてきたら「サポート誌ってものもあったな」と思い出してください。

&1 非公式シナリオを使う方法
公式シナリオ以外（ = 非公式シナリオ）を使う方法を紹介します。
ソード・ワールド2.5のシナリオはファンによってそれなりに公開されており、 &em_無料で遊べるものも多数 あります。

&3 拙作「ウォフト=ルーバの研究所跡」について
宣伝になってしまいますが、拙作の &em_「ウォフト=ルーバの研究所跡」 は僕自身がソード・ワールド2.5の初心者・未経験者向けに布教するために作ったシナリオですが、 &em_初心者GMでも回せるよう、GM向けのアドバイスなども記載 しております。
準備についても、NPC画像を用意するのに便利なサイト、BGMを用意するのに便利なサイトなどを紹介し、 &em_ココフォリアでのオンラインセッション用にルームデータも無料公開 しています。
よければこちらを使ったり、参考にしたり、してください！
&button_/scenario#ウォフト=ルーバの研究所跡 紹介ページ
&button_https://talto.cc/projects/NU47DZgkJ51cMVBsYv504 TALTO
&br

&2 シナリオが公開されているウェブサイト一覧
以下ではシナリオが公開されているウェブサイトを紹介します。
なお、これは僕が知っているものだけなので、「こんなのもあるよ！」というものがあれば &itwitter まで教えていただければ幸いです。

&3 TALTO
TALTOはオンラインセッション用ツールココフォリアを運営するココフォリア株式会社が提供するシナリオ公開サービスです。
&em_シナリオ特化のサイト のため、プレイヤー数やプレイ時間での検索が可能で便利です。
2021年12月のサービス開始からソード・ワールド2.5のシナリオ数は順調に増えており、2023年4月現在、 &em_50を超えるシナリオが無料で公開 されています。
&button_https://talto.cc/c/sword_world_2.5 こちら

&3 Booth
通信販売もダウンロード販売もできるサイトです。こちらにもソード・ワールド2.5のシナリオが多数公開されています。
有料のものもあります。
有料のものを買う際は、その金額を未購入のサプリメントなどに使わなくていいか、しっかり考えましょう。
&br
PDFファイルで公開されているものも多いですが、 &em_テキストファイルが同梱されていない場合コピー＆ペーストが大変 なので、気をつけてください。
&br
なお、Boothには素材なども多数公開されているので、そういうのを探すにも便利です。 &link_/sw25/tool/material,しゃちほこ丸が作った素材はこちら で紹介しています。
&button_https://booth.pm/ja/search/%E3%82%BD%E3%83%BC%E3%83%89%E3%83%BB%E3%83%AF%E3%83%BC%E3%83%AB%E3%83%892.5%20%E3%82%B7%E3%83%8A%E3%83%AA%E3%82%AA こちら
&button_https://booth.pm/ja/search/%E3%82%BD%E3%83%BC%E3%83%89%E3%83%BB%E3%83%AF%E3%83%BC%E3%83%AB%E3%83%892.5%20%E3%82%B7%E3%83%8A%E3%83%AA%E3%82%AA?max_price=0 無料のみを見る場合はこちら

&3 pixiv
イラスト・小説投稿サイトのpixivにも多数のシナリオが無料で公開されています。
なお、pixivには立ち絵や魔物イラストなども公開されているので、そういうのを探すにも便利です。
&button_https://www.pixiv.net/tags/%E3%82%BD%E3%83%BC%E3%83%89%E3%83%AF%E3%83%BC%E3%83%AB%E3%83%892.5%20%E3%82%B7%E3%83%8A%E3%83%AA%E3%82%AA/novels?s_mode=s_tag こちら

&3 scenarch
こちらはTALTO同様にシナリオ特化のサイトです。
やはり無料シナリオが多数公開されています。
&br
検索リンクが作れなかったので、以下のボタンから開いた上で、ワードに「2.5」と入力し、システムカテゴリを「ソード・ワールド」として、「キーワード検索」をしてください。
&button_http://scenarch.com/scenarios_search/search こちら

&2 非公式シナリオを選ぶコツ
&3 シナリオの人気を見る
まずはそのシナリオの人気を見ることです。上記のサイトでも人気順で表示できるものがあるので、そういうサイトでは人気順を見てみましょう。
多くの場合、人気のシナリオは遊ばれている数が多く、メンテナンスがなされていることが多いです。

&3 知り合いが作ったシナリオを使う
TwitterでFF関係の人など、知り合いが作ったシナリオを使うのは便利です。
&em_何より困った時はシナリオ作者に確認を取ることができます。

&3 他の人のおすすめシナリオを使う
Twitterなどでソード・ワールド2.5をやっている人におすすめのシナリオを聞くのも良いです。
&em_ソード・ワールド2.5の雑談用Twitterコミュニティ では気軽にそういう相談ができます。
詳しくは以下からご覧ください。
&button_/sw25/tool/community
&br
また、以下では個人的におすすめのシナリオをいくつか紹介しています。
これらを使うのもおすすめです！
`

const andml2 = `
ソード・ワールド2.5の &em_無料公開されているおすすめシナリオ を紹介します。
これらのシナリオは &em_初心者以外にもおすすめ です。
&br
※ 掲載順はページを更新するたびにランダムで決定しております。
※ &em_今後も随時追加予定 なのでブックマーク等して定期的に確認いただければ幸いです。
`

const andml3 = `
&1 初心者GMにはこちらもおすすめ
&3 ハルーラガイド
2022年12月のコミックマーケットで頒布された同人誌「ハルーラガイド¥s－ゲームマスターズアーカイブ－」は初心者GM向けのサポート誌となっていて、 &em_めちゃくちゃ参考になります。
そして、ハルーラガイドにも &em_初心者におすすめのシナリオが5つ 掲載されています！
&br
電子版が &link_https://booth.pm/ja/items/4489031,こちら（Booth） から購入いただけるほか、小部数ですが書籍版も残っているとのことです。
僕の感想や書籍版については以下のページを参考にしてください。
&button_/blog/harula
`

const shuffle = <T>(array: Array<T>) => {
  for (let i = array.length - 1; i >= 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [array[i], array[j]] = [array[j], array[i]];
  }
  return array;
}

type s = {
  scenario: string,
  author: string,
  twitter?: string,
  explain: string[],
  link: string
}
const scenarioList: s[] = [
  {
    scenario: "「迷宮の街」など多数",
    author: "Bang-Gさん",
    twitter: "Bang_g_no1",
    explain: [
      "Bang-Gさんはソード・ワールド2.5の高クオリティなシナリオを多数無料公開している方です。リンク先のページではBang-Gさんのシナリオがレベル順で公開されており、見やすくなっています。「迷宮の街」はGMもルールブックIのみで遊ぶことができます。",
      "また「キャンペーン第0話向き」とのことで、続きのシナリオを自分で作ることができます。そのためのサポート情報も満載です。"
    ],
    link: "https://lit.link/bangg"
  },
  {
    scenario: "「薬草探し」など",
    author: "DKPさん",
    twitter: "DKP71603706",
    explain: [
      "DKPさんはソード・ワールド2.5の高クオリティなシナリオを無料公開している方で、2023年は毎月公開を目標にしているとのことです。シンプルで見やすいシナリオながら、裏の設定がしっかりあり、遊びやすくてかつ楽しめるシナリオです。",
      "DKPさんには何度かシナリオを見ていただいたことがあり、その度に的確なアドバイスをいただいて助かっています。"
    ],
    link: "https://talto.cc/users/QCFR8jBNzwR4rh2KZRaxnJGxLn42"
  },
  {
    scenario: "「始まりを踏み出そう」",
    author: "らんじょうさん",
    twitter: "ran_jou",
    explain: [
      "らんじょうさんはソード・ワールド2.5のセッションをよく開いてくれる人です。募集しているときに限らず、Twitterで声をかければ初心者向け含めソード・ワールド2.5のセッションを開いてくれると思います。",
      "このシナリオは初心者向けのシナリオを、初心者GMでも回しやすく書いて公開してくださったものです。"
    ],
    link: "https://talto.cc/projects/uRujkoZrTWYvks_nMeM5g"
  },
  {
    scenario: "「21グラムの後日譚」",
    author: "殻付飛鳥さん",
    twitter: "karatuki_egg",
    explain: [
      "殻付飛鳥さんは同人TRPG「イフ・イフ・イフ」を作ったり、「ストリテラ」ルルブ収録シナリオを書いたりしているすごい人です。",
      "「21グラムの後日譚」は「PC全員、冒険者でありながら死者（幽霊、データ的には『ゴースト』）」という特殊なシナリオです。ただ、それで複雑になるということはなく、遊びやすいシナリオです。"
    ],
    link: "https://talto.cc/projects/jAQ1NWeq69ggbihahUTBg"
  },
  {
    scenario: "「ようじょわーるどへようこそ」",
    author: "ジルニィさん",
    // twitter: "",
    explain: [
      "「ようじょわーるどへようこそ」は「わちゃわちゃ遊びたい人向け。」と書いてあるように、戦闘メインではなく、ロールプレイをとにかく楽しむ、そんなソード・ワールド2.5を遊びたい人におすすめです。僕自身、作者さんGMで遊ばせてもらったのですが、めちゃくちゃ楽しかったです。",
      "処理が多めですが、仲良い人とわちゃわちゃ遊びたい人にはおすすめです。"
    ],
    link: "https://talto.cc/projects/jAQ1NWeq69ggbihahUTBg"
  },
  {
    scenario: "「水路の迷子を追いかけて」",
    author: "綾取カラムさん",
    twitter: "ayatori_krm",
    explain: [
      "綾取カラムさんはTwitterでよく初心者向けのセッションを開催しており、「水路の迷子を追いかけて」はその際に使っているシナリオでもあるようです。",
      "このシナリオはGMもルールブックIのみで遊ぶことができます。さらに、キャンペーンを続ける場合のきっかけも載っています。"
    ],
    link: "https://talto.cc/projects/FrAFRLXjNCkf0Yojx5bZR"
  },
  {
    scenario: "「消えた海賊船を追え！」",
    author: "SONEさん",
    twitter: "SONE_99",
    explain: [
      "SONEさんは同人TRPG「終末紀行RPG」を作っている人でもあります。",
      "「消えた海賊船を追え！」はソード・ワールド2.5では珍しい海洋冒険シナリオです。海賊船を追うストーリとその間のイベント、個性豊かなフェローと、ドキドキワクワク要素が盛りだくさんです。PDFになっているので印刷しておくにも最適です。また、ユドナリウム用ルームパックがついているので、準備がすぐできます。"
    ],
    link: "https://sone-trpg.booth.pm/items/2107630"
  },
  {
    scenario: "「掘り返された街道！」",
    author: "文盲のDagonさん",
    twitter: "DagonUnder6Feet",
    explain: [
      "文盲のDagonさんは &link_/sw25/tool/community,「ソード・ワールド2.5雑談コミュニティ」 を作ってくださった方です。",
      "「掘り返された街道！」は文盲のDagonさんが作った独自設定の大陸「クレメリア大陸」を舞台としたシナリオで、最初の冒険におすすめな、シンプルに楽しめるシナリオです。キャンペーンを続ける場合のきっかけも載っています。補足資料として、クレメリア大陸についての解説も載っているので、オリジナル設定が好きな方にもおすすめです。"
    ],
    link: "https://talto.cc/projects/HLQ5sAnyxTa7Dp2LJsyhn"
  },

]

const myScenario: s = {
  scenario: "「ウォフト=ルーバの研究所跡」など",
  author: "しゃちほこ丸（当サイト管理人）",
  twitter: "syachi_hoko_trp",
  explain: [
    "最後に、拙作についても載せさせていただきます。よければこちらも遊んだり、参考にしたりしてください。",
  ],
  link: "/scenario?"
}

const ss = ref(scenarioList)

onMounted(() => {
  const arr = shuffle(scenarioList)
  arr.push(myScenario)
  ss.value = arr
})
</script>