<template>
  <card-array-by-andml :andml="andml1" />
</template>

<script setup lang="ts">
const { nowPageSetting } = usePages()
const andml1 = `
&1 このページについて
このページではソード・ワールド2.5（SW2.5）のキャラクターシートなどを作ることができるWebサービス &link_https://yutorize.2-d.jp/ytsheet/sw2.5/?,ゆとシートII（ゆと工公式） について、使い方を画像付きでわかりやすく解説します！
&br
実際に「じっくり作成」（『ルールブックI』p.20・p.63）をする流れを解説するので、一緒にやってみてください。
&br
&em_ゆとシートはソード・ワールド2.5などのTRPGを遊ぶ際にとても役立つ ので、ぜひこのページを読んで使い方をマスターしてください！
&br
※ &em_このページは公式ではなく、個人ユーザーによる解説 です。ここにある内容よりも &em_公式の記述を最優先 に使用してください。

&1 ゆとシートとは？
ゆとシートはTALEさん（ &link_https://twitter.com/tale_hw/status/1035851396564676608,Twitter ）が作ってくださっているソードワールド2.5用のオンライン管理キャラクターシートです。
&br
現在はかなりの機能があり、ソード・ワールド2.5関連では以下の機能があります。
&br
- キャラクター能力値作成
- キャラクターシート（保存・閲覧）
- 魔物データ（保存・閲覧）
- 騎獣データ（保存・閲覧）
- アイテムデータ（保存・閲覧）
- 魔法データ（保存・閲覧）
- 神格データ（保存・閲覧）
- 流派データ（保存・閲覧）

&2 様々なTRPGに対応
また、ソード・ワールド2.5以外のTRPGにも対応しており、現在は以下のTRPGシステムに対応しています。
&br
- ソード・ワールド2.5
- ソード・ワールド2.0
- ダブルクロス3rd
- アリアンロット2E
- ヴィジョンコネクト
- ブラッドパス
- キズナバレット

&1 大事なお約束
前述の通り、 &em_このページは公式ではなく、個人ユーザーによる解説 です。
ゆとシートを使う際はここにある内容よりも &em_公式の記述を最優先 に使用してください。
&br
特に、 &em_毎回 ゆとシートの &em_「注意書き」などをしっかりと確認 してください。
&br
また、このページの最終更新日は${nowPageSetting.value.lastmod}です。
最新情報は &link_https://yutorize.2-d.jp/ytsheet/sw2.5/,ゆとシート の「注意書き」などをご覧ください。

&1 使い方1 ゆとシートに登録
&img_/ytsheet/1.webp,トップ画面
&link_https://yutorize.2-d.jp/ytsheet/sw2.5/,ゆとシート を開いてください。
上記画像の「必読」部分をまずは読みましょう。
&br
読んだら右上にある「登録」ボタンを押して登録をします。
登録をすることでいろいろ便利なので、登録しましょう。
※登録済みの場合は飛ばしてください
&img_/ytsheet/2.webp,登録画面
「メールアドレス」は入力しなくても大丈夫ですが、他を入力しましょう。
「ID」と「パスワード」はログインに使用します。
&br
「名前」「メールアドレス」「パスワード」は後から変更可能です。
&br
入力したら「登録」ボタンを押しましょう。

&1 使い方2 ログイン
右上にある「ログイン」ボタン（「登録」ボタンの横）を押すとログイン画面に移ります。
登録した「ID」と「パスワード」を使ってログインします。
&br
以下の画面のように右上から「ログイン」「登録」ボタンがなくなり、「マイリスト」「オプション」「ログアウト」ボタンが表示されていれば &em_ログイン成功 です。
&img_/ytsheet/3.webp,ログイン成功後の画面

&1 使い方3 キャラクター能力値作成
ここからは実際に「じっくり作成」（『ルールブックI』p.20・p.63）をやっていきます。
&br
まず『1.博士のキャラクターシートを準備』はゆとシートがその役割を担ってくれるので省略できます。
次に『2.種族と生まれの決定』（『ルールブックI』p.64）ですが、これはルールブックに則って行ってください。
なお種族に困った場合は以下のページも参考にしてください。
&button_/sw25/forbeginner/syuzoku
種族と生まれが決まったら『3.能力値の決定』（『ルールブックI』p.72）です。
これはゆとシートを使ってやっていきましょう！
&br
&img_/ytsheet/4.webp,キャラクター能力値作成画面
上記画像のように「能力値作成」ボタンを押すか、 &link_https://yutorize.2-d.jp/ytsheet/sw2.5/?mode=making,このリンク からキャラクター能力値作成画面を開きます。
&br
ここでは前述のようにじっくり作成における能力値の決定（『ルールブックI』p.72）を、簡単に行うことができます。
&br
やるべきことは「名前」「コメント」「生まれ」「種族」「振る回数」を入力するだけです。

&3 入力内容
「名前」には基本的にキャラクターの名前 &em_ではなく自分の名前 を入力しましょう。
「コメント」にはGMの名前か知っていればシナリオの名前を入力すると良いでしょう。
ここの2つはGM（や主催者）から指定があればそれに従ってください。
&br
「生まれ」「種族」は『2.種族と生まれの決定』（『ルールブックI』p.64）で決めた種族と生まれ（の「心」「技」「体」の値）を入力してください。
&br
「振る回数」はデフォルトで「3」になっているので、基本的に「3」のままで大丈夫です。（『ルールブックI』p.74の『ここがポイント！　複数回の能力値決定』参照）
ただし、しゃちほこ丸が主催するセッション専用にキャラクターを作る場合にはハウスルールで「5」にしてもOKです。

&3 能力値を作成
ここまでできたら「作成」ボタンを押しましょう。
&img_/ytsheet/5.webp,キャラクター能力値作成後画面
※ 「生まれ」はテキトーに入力しています。
&br
「作成」ボタンを押した後にスクロールすると作成された能力値が載っています。
&br
「振る回数」の数だけ載っているので、ここから1つ選び、「この能力値で作成」ボタンを押しましょう。
するとキャラクターシートの入力画面が開きます。

&1 使い方4 キャラクターシートの入力
ではここからはキャラクターシートを入力していきます。
入力内容が多いですが、1つずつ順番に入力していきましょう。

&2 基本設定
&img_/ytsheet/6.webp,キャラクターシート入力画面
&3 1.編集保護設定
「編集保護設定」特に要望がなければ「アカウントに紐付ける」にしておきましょう。
複数人で編集したい場合は「パスワードで保護」を選び、その後の入力ボックスにパスワードを入力するとよいでしょう。

&3 2.閲覧可否設定とタグの設定
「内容を全て開示」にしておかないとGMなどが見れないのでここは変えないようにしましょう。
データを隠すNPCなどのみ、ここは変更しましょう。
&br
「一覧に表示」のままだと他の人から見られてしまいます。
あまり見られたくない場合には「一覧に非表示」にしておきましょう。
ただし、「一覧に非表示」にしても絶対に見られないわけではありません。
&br
グループは変更しないでください。
&br
タグは自由に入力できます。
ただし、タグを入力している場合、「一覧に非表示」にしていてもタグ検索結果に表示されますので完全に見られないようにできないことはご注意ください。

&3 3.キャラクター名・プレイヤー名
「キャラクター名」はキャラクターの名前を入力しましょう。
僕は基本的に最後に決めているのでここでは種族とメインにするつもりの技能を書いています。
例）リルドラケンファイター
&br
「二つ名」も自由に設定しましょう。
「フリガナ」は「二つ名」のふりがなです。キャラクター名のふりがなではないのでご注意を。
&br
「プレイヤー名」は「キャラクター能力値作成」の時に入力された内容が入っています。

&3 4.一度保存する
ここまで設定したら一度「保存」ボタンを押して保存しておきましょう。
以降、定期的に保存するのがおすすめです。
&img_/ytsheet/7.webp,キャラクターシート閲覧画面
初めて保存をすると上図のようなキャラクターシート閲覧画面へ移行します。
&br
図のように右上の「編集」ボタンを押して編集画面へ戻りましょう。

&3 5.作成レギュレーション
初期作成の場合、ここは変更しなくて大丈夫です。
&br
経験点や所持金・名誉点・成長回数などがGMから指定されている場合、それらを入力しましょう。
&br
成長については合計成長回数を各能力値に割り振ります。
GMから指定がない場合には『ルールブックIII』p.74の「成長回数平均表」を使うとよいでしょう。

&2 基本設定の続きと能力値の入力
&img_/ytsheet/8.webp,キャラクターシート入力画面
少しスクロールすると上図のような画面になります。
画面にはいろいろと表示されていますが、入力することはそれほど多くないので頑張って進めていきましょう。

&3 入力
まずは上図において赤文字で「ここを入力する」と書いた部分を書いていきます。
&br
「種族」と「生まれ」は決めたものを入力しましょう。
「年齢」と「性別」は後回しでも大丈夫です。
「穢れ」は基本的に「0」、ナイトメアやアルヴの場合は「1」になるでしょう。
&br
「信仰」は信仰する神様がいればその名前を書きましょう。
ここはキャラクター設定でしかないのでプリースト技能を持っていなくても書いて大丈夫です。

&3 画像
まずは上図において赤文字で「画像はここから設定」と書いた部分をクリックして画像を設定します。
著作権に注意しましょう。
ここにアップロードする行為はいわゆる「再配布」にあたると僕は考えています。

&3 増強
まずは上図において赤文字で「指輪などで能力を増強する際に使用」と書いた部分は、ひとまず無視してください。
『7.アイテムの購入』（『ルールブックI』p.82）で能力値増強の指輪（『ルールブックI』p.339）などのアイテムを購入した場合に使います。

&3 割振りPt.
これはサプリメント『エピックトレジャリー』掲載の選択ルール『ポイント割り振りによるキャラクター作成』（『エピックトレジャリー』p.54）を使用する際のものです。
基本的に無視してください。
&br
※ サプリメント紹介は以下をご覧ください。
&button_/sw25/forbeginner/suppliment

&2 技能の取得
では技能を取得していきます。
ルールブックのじっくり作成では『4.技能の取得』（『ルールブックI』p.76）です。
&img_/ytsheet/9.webp,キャラクターシート入力画面
また少しスクロールすると上図のような画面になります。
ここも画面にはいろいろと表示されていますが、入力することはそれほど多くないです。

&3 技能
取得する技能とそのレベルを選び、入力していきます。
まずは忘れずに「生まれ」の初期技能を記入しましょう。
すると上図において赤文字で「ここは余りの経験点」と書いた部分が生まれの初期経験点と一緒になります。
&br
プリースト技能を取る場合、横の入力欄は「セイクリッド系」を選びましょう。
&br
後は余りの経験点が0になるまで自由に技能を取っていきます。
背景が水色の部分は無視しましょう。
初期作成の場合、レベルは「1」か「2」になるでしょう。（『ルールブックI』p.76参照）
&br
技能の経験点テーブル（『ルールブックI』p.76）などをゆとシートが自動で計算し、余りの経験点を出してくれます。
&br
もちろん経験点を一部残しても構いません（が、何回も遊ぶということが決まっているわけではなければ全部使い切っておくのがオススメです）。
&br
なお技能に困った場合は以下のページも参考にしてください。
&button_/sw25/forbeginner/ginou

&3 HP・MP・生命抵抗力・精神抵抗力
上図において赤文字で「ここはアイテムなどで変わる場合のみ入力」と書いた部分は無視して大丈夫です。
&br
技能を取ることで冒険者レベルが決まり、それによってHP・MP・生命抵抗力・精神抵抗力が自動で計算されています。
『8.各種数値の確認・計算と記入』（『ルールブックI』p.84）が自動で終わっていきます。

&3 一般技能
また、上図において赤文字で「サプリメントの追加ルール用」と書いた「一般技能」も無視して大丈夫です。
これはサプリメント『エピックトレジャリー』掲載の選択ルール『一般技能』（『エピックトレジャリー』p.55）を使用する際のものです。

&2 戦闘特技と練技・呪歌などの入力
以下では説明のため、「フェンサー」「プリースト」「スカウト」「エンハンサー」「バード」をそれぞれ1レベルずつ取ったと仮定します。
&br
つまり以下のような状態です。
&img_/ytsheet/10.webp,キャラクターシート入力画面

ゆとシートの表示順に従って『5.言語の取得』は一旦飛ばして『6.戦闘特技の習得』（『ルールブックI』p.80）へ進みます。
少しスクロールすると以下のようになります。
&img_/ytsheet/11.webp,キャラクターシート入力画面

&3 戦闘特技
選んだ戦闘特技を入力します。
下のオプションや「秘伝」はサプリメントなどでの追加要素用なので無視しましょう。
&br
なお、グラップラー技能を選んだ場合の《追加攻撃》などの自動取得の戦闘特技はここで入力する必要はありません。
ここでは表示されていませんが、閲覧画面に表示されるので大丈夫です。

&3 練技・呪歌など
エンハンサー技能やバード技能など一部のその他系技能では練技・呪歌などの能力を選んで取得することになります。
これらの技能を選ぶと上図のように自動で項目が出てきます。
&br
※この上にある「習得レベルの足りない項目（特技／練技・呪歌など）も表示する」にはチェックを入れないでください。
&br
ここに選んだものを入力しましょう。
なお、バード技能で終律を選んだ場合にも呪歌の欄に入力してください。

&2 言語の入力
では飛ばしていた『5.言語の取得』（『ルールブックI』p.77）です。
&img_/ytsheet/12.webp,キャラクターシート入力画面
上図の赤で囲っている「言語」欄に取得する言語を入力します。
&br
図のように「あと『1』言語取得できます」などと表示されるので安心ですが、一応過信せずにルールブックも確認しながら入力しましょう。
&br
他の部分はやはり自動で計算されるので、これまで同様にアイテムなどで数値変更がある場合のみ入力すればOKです。
※ 取得した技能によって表示内容は変わります。

&2 武器と防具
では『7.アイテムの購入』（『ルールブックI』p.82）に進んでいきます。
まずは武器と防具から。
また少しスクロールすると以下のような画面になります。
&img_/ytsheet/13.webp,キャラクターシート入力画面
武器も防具も、購入するなら入力しましょう。
&br
上図において赤文字で「防護点が上がる他の要素を入力」と書いた部分には〈ブラックベルト〉（『ルールブックI』p.340）など防護点が上がるアイテムを買った場合や、練技【ビートルスキン】（『ルールブックII』p.212）などの防護点が上がる能力がある場合に入力します。
&br
上図において赤文字で「必ず選ぶ」と書いた2ヶ所は、戦士系技能（ファイター・グラップラー・フェンサー・シューター・バトルダンサー）を1つでも取っている場合、 &em_必ず 選んでください。

&2 装飾品とその他アイテム・名誉点
アイテムの購入を続けていきます。
少しスクロールすると以下のような画面になります。
&img_/ytsheet/14.webp,キャラクターシート入力画面
&3 装飾品
まずは装飾品（『ルールブックI』p.327）を入力しましょう。
&br
「専用」の欄は『個人専用装備』（『ルールブックII』p.135）のためのものです。
初期作成の場合は無視してください。
&3 その他アイテム
また武器でも防具でも装飾品でもない、その他アイテムでは「所持品」のところに書きましょう。
全キャラクターの推奨アイテム〈冒険者セット〉（『ルールブックI』p.82参照）は買っておきましょう。
&3 所持金・預金／借金
「所持品」の上にある「所持金」「預金／借金」は「自動」と入力されていればそのままにしておきましょう。
あとで「収支履歴」を入力すると自動計算してくれます。
&3 名誉点
赤文字で「名誉点用」と書いた部分は名誉点（『ルールブックI』p.214および『ルールブックII』p.132）用の場所です。
初期作成の場合は無視して構いません。

&2 収支履歴
ついに最後まで来ました！
お疲れさまです。
最後に「収支履歴」を入力しましょう。
&img_/ytsheet/15.webp,キャラクターシート入力画面
収支履歴は「買ったアイテム::かかった額」の形式で書いていきます。
半角コロン¥s":"¥sが2つです。
日本語キーボードだと多くの場合「L（り）」キーの2つ右にあります。
&br
武器・防具・装飾品も忘れずに記入しましょう。
アイテムの購入と同時並行で行うのがオススメです。
入力欄の下に「所持金」が出てくるので残りの額がわかりやすいです。
&br
※ 上図では買ったアイテムの名前を「なんか」などと書いていますが、実際にはしっかりとアイテム名を書きましょう。
&br
この下は「容姿・経歴・その他メモ」「履歴（自由記入）」は自由に入力して大丈夫です。
「セッション履歴」はこのキャラクターで遊んだら記入しましょう。

&1 使い方5 キャラクターシートの完成
ここまで本当にお疲れさまでした。
ここからはサクサク進めます。
&img_/ytsheet/16.webp,キャラクターシート入力画面上部
画像のような手順です。

&3 1.保存をする
「保存」ボタンを押して保存します。
電波が悪い場合など、うまくいかない場合は &em_焦らず3分くらい待ってから 「保存」ボタンを押しましょう。

&3 2.未保存ではないことを確認
「保存」ボタンの上に「未保存」とでていないことを確認します。
&br
「未保存」と出ていたらもう1回「保存」ボタンを押します。
さっき押したばかりであれば、一旦やはり &em_焦らず3分くらい待ってから 「保存」ボタンを押しましょう。

&3 3.閲覧モードに変更
目のマークのボタンを押して、閲覧モードに変更します。
以下のような画面になれば成功です。
&img_/ytsheet/17.webp,キャラクターシート閲覧画面


&1 使い方6 キャラクターシート閲覧画面の使い方
最後に、キャラクターシート閲覧画面の使い方を説明します。
&br
まず、キャラクターシートを他の人に見せる場合は、閲覧画面のURLをコピーして送りましょう。

&2 各ボタンの説明
以下の図を使って、よく使う4つのボタンについて説明します。
&img_/ytsheet/18.webp,キャラクターシート閲覧画面

&3 1.パレット
オンラインセッションツールの「チャットパレット」用のチャットパレットを表示できるボタンです。
ココフォリアを使用する場合には使用しません。

&3 2.出力
ココフォリア（やユドナリウム）というオンラインセッションツールを使用する場合に使用するボタンです。
ココフォリアへのデータ出力方法は以下で解説します。

&3 3.過去ログ
これまでの編集データに戻すことができます。
長く使うキャラクターであれば「閲覧中のログに名前をつける」で「キャンペーン第n話前」などとつけておくと良いかもしれません。

&3 4.編集
『使い方4』で使った編集画面へ移行します。
&br
修正する場合や成長する場合に使用します。
&br
編集画面使い方は『使い方4』を参照してください。

&2 キャラクターシートの出力
キャラクターシートのデータをココフォリアへ貼り付ける方法を説明します。
&3 1.出力ボタンを押す
まずは上記の説明を参考に「出力」ボタンを押してください。
&br
すると右に出てきたメニューが出てきて下図のようになります。
&img_/ytsheet/19.webp,キャラクターシート閲覧画面

&3 2.ココフォリア用コマデータを押す
右に出てきたメニューにある「ココフォリア用コマデータ」ボタンを押します。
するとクリップボードにデータがコピーされます。

&3 ココフォリアを開いて貼り付ける
キャラクターのコマデータを置きたいココフォリアの部屋を開きます。
なおココフォリアの使い方は別で調べてください。
&img_/ytsheet/20.webp,ココフォリア画面
上図のあたりを右クリックします。
&br
※ルームチャットやアイコンなどがある部分以外ならどこでも大丈夫です。
&br
すると以下のようになります。
&img_/ytsheet/21.webp,ココフォリア画面
一番下の「貼り付け」を押します。
&img_/ytsheet/22.webp,ココフォリア画面
前景の真ん中にコマが現れます。
&br
画像はコピーされないので自分で設定します。
&br
その他のデータも適宜追加・変更しましょう。

&1 使い方7 発展編！ キャラクターシートをリッチにする
編集画面の上部メニューを活用すると、よりキャラクターシートをリッチにできます。
&img_/ytsheet/23.webp,編集画面
&3 フェローデータを作る
「フェローデータ」ボタンを押すとフェローデータ（『ルールブックI』p.216参照）を作ることができます。
&br
キャラクターデータの編集に戻りたい場合は「キャラクターデータ」ボタンを押してください。

&3 色を編集
バケツみたいなアイコンを押すと、色を編集できます。

&3 テキスト整形ルール
「？」ボタンを押すと、テキスト装飾・整形ルールが画面の下に出てきます。
スクロールして読んで、使ってみましょう。
&br
使いこなすとかなりみやすいキャラクターシートができます。
&br
例えば「所持品」をジャンル（薬草とか……）ごとに見出しを作ったり、「収支履歴」をセッションごとに「折り畳み」したり、すると良いでしょう。
また騎獣データなどは別で作ってリンクを貼るとわかりやすくなります。
&br
こればかりは使ってみないとだと思うので、いろいろやってみてください！

&1 終わりに
めちゃくちゃ長くなってしまいましたが、最後までお読みいただきありがとうございました。
&br
ゆとシートはソード・ワールド2.5（SW2.5）をやる上で、めちゃくちゃ役立つツールなので、これを参考に慣れていってください！
&br
なおこのウェブサイトではソード・ワールド2.5を遊ぶ上で役立つ情報・ツールをいろいろ公開しているのでぜひ見てみてください。
&button_/sw25/forbeginner
&button_/sw25/tool

`
</script>