<template>
  <pages-build :about-this-page="about" :main="andml1" />
</template>

<script setup lang="ts">
const about = `
このページでは前衛に立つキャラクターを作る際に考えると良いこと方を &em_初心者向けにわかりやすく解説 していきます。
&br
ソード・ワールド2.5は前衛がいないと戦線崩壊して、かなり負けが濃厚になる戦闘システムとなっていて、前衛の枚数と「ヒーラータイプ」のキャラクターがパーティーの耐久力を決めるといっても過言ではありません。
主に前衛となるのは「近接タイプ」のキャラクターですが、他にも前衛に立つパターンがあります。
&button_/sw25/forbeginner/build/warrior
ここでは前衛に立つキャラクターについて、説明します。
`

const andml1 = `
&1 前衛に立つ必要性
ここで「前衛に立つ」というのは、基本戦闘（『ルールブックI』p.126）であれば前線エリアに行くことを示します。
&br
前線エリアには敵もいるため、「乱戦」（『ルールブックI』p.127）となります。
&br
上級戦闘（『ルールブックII』p.51）の場合、乱戦エリアに入ることを、ここでは「前衛に立つ」ということにします。

&2 前衛に求められること
基本戦闘では、前衛が1人でもいない状態だと、敵が自軍後衛エリアへ移動できるようになってしまいます。（『ルールブックI』p.134参照）
なので、前衛は絶対に1人必要になります。

&3 上級戦闘の場合
上級戦闘では、「乱戦からの離脱」（『ルールブックII』p.62）をすることで、乱戦エリアを超えて後衛へと移動することができます。
これを敵にされたら、回避や防護が苦手な後衛のキャラクターが、敵の近接攻撃を喰らうようになってしまいます。
阻止するため、それなりの人数が必要になります。
&br
「移動妨害」（『ルールブックII』p.65）をすることも、大事な役割となります。

&3 熟練戦闘の場合
熟練戦闘（『エピックトレジャリー』p.68）についてはここでは解説しません。
&br
熟練戦闘をする場合にはサプリメント『エピックトレジャリー』を確認してください。
&amazon_エピックトレジャリー

&1 前衛に立てるキャラクター
&2 近接タイプ
「近接タイプ」のキャラクターは、前衛に立つことは必須と言えます。
前線エリアにいないと敵に対して近接攻撃（剣などによる攻撃）が不可能です。
&br
「近接タイプ」について詳しくは以下のページをご覧ください。
&button_/sw25/forbeginner/build/warrior

&2 金属鎧を着込める技能
近接タイプのキャラクター以外は回避判定を「平目」で振ることになります。（『ルールブックI』p.96参照）
&br
しかし、防護点は有効であるため、 &em_金属鎧を着込めば前衛に立つことも可能 です。
&br
ソーサラー・コンジャラーなど一部の魔法使い系技能は金属鎧を着ることによってペナルティを受けますが、運用によってはそれを無視することもできます。
例えば魔法行使判定にペナルティを受ける場合、「抵抗：任意」「抵抗：なし」の魔法を使う上では問題ありません。

&1 前衛に立つメリット
前述の「前衛に立つ必要性」で書いた「人数が必要である」ということのほかにも、前衛に立つことによるメリットは多々あります。
&br
ここでは「近接タイプ」以外のキャラクターが前衛に立つメリットを紹介します。
&br
大きなメリットが3つあります。
&br
1つ目前線エリアにいる味方に「射程：接触」の効果を使うことができることです。
&br
2つ目は &em_遠隔攻撃を敵軍後方エリアに行ったり することができることです。（『ルールブックI』p.137参照）
自分が自軍後方エリアにいると、「射程：2」でかつ戦闘特技《鷹の目》がないと敵軍後方エリアに攻撃を行えません。
かなりのメリットと言えます。
&br
3つ目は、誤射（『ルールブックI』p.137）が起きないことです。
自分が自軍後方エリアにいると、「形状：射撃」の魔法や弓などによる攻撃は、戦闘特技《ターゲッティング》がないと「誤射」が起きてしまいます。
戦闘特技《ターゲッティング》なしで誤射しないのは前衛に立つメリットです。

&1 自身以外が前衛に立つ
前衛の人数を増やす方法は、必ずしもプレイヤーキャラクター自身が前衛に立つことだけではありません。

&3 ゴーレム
コンジャラー技能レベル3以上で使える操霊魔法【クリエイト・ゴーレム】を使うと、ゴーレムを作成することができます。
ゴーレムについては『ルールブックII』p.101に詳しいルールが載っています。
&br
※初期作成では使えません。

&3 妖精
妖精はフェアリーテイマー技能レベル2以上で使える基本妖精魔法【サモンフェアリー】によって呼び出すことができます。
詳しくは『ルールブックII』p.105を参照してください。

&3 騎獣
ライダー技能を持つキャラクターは騎獣を1体以上レンタルもしくは購入することになります。（『ルールブックIII』p.94参照）
&br
騎芸【遠隔指示】を取ることで、自身が乗らず、騎獣だけを前衛に立たせることができます。（『ルールブックIII』p.195参照）

&3 フェローや魔神はNG
フェロー（『ルールブックI』p.216）は誰かしらのPCと同じ位置になるため、1人だけで前衛に立つことはできません。
&br
デーモンルーラー技能によって呼び出されて使役される魔神も同様です。（『モンストラスロア』p.26参照）

`
</script>