<template>
  <pages-build :about-this-page="about" :main="andml1" />
</template>

<script setup lang="ts">
const about = `
このページでは前衛に立つキャラクターを作る際に考えると良いこと方を &em_初心者向けにわかりやすく解説 していきます。
&br
ソード・ワールド2.5は前衛がいないと戦線崩壊して、かなり負けが濃厚になる戦闘システムとなっていて、前衛の枚数と「ヒーラータイプ」のキャラクターがパーティーの耐久力を決めるといっても過言ではありません。
主に前衛となるのは「近接タイプ」のキャラクターですが、他にも前衛に立つパターンがあります。
&button_/sw25/forbeginner/build/warrior
ここでは前衛に立つキャラクターについて、説明します。
`

const andml1 = `
&1 前衛に立つ
「前衛に立つ」というのは、基本戦闘（『ルールブックI』p.126）であれば前線エリアに行くことを示します。
&br
前線エリアには敵もいるため、「乱戦」（『ルールブックI』p.127）となります。
&br
前線エリアにいると同じエリアにいる敵に対して近接攻撃（剣などによる攻撃）が可能です。
&br
また、大きなメリットとして、前線エリアにいる味方に「射程：接触」の効果を使ったり、 &em_遠隔攻撃を敵軍後方エリアに行ったり することができます。（『ルールブックI』p.137参照）
&br
自分が自軍後方エリアにいると、「射程：2」でかつ戦闘特技《鷹の目》がないと敵軍後方エリアに攻撃を行えません。
また、自分が自軍後方エリアにいると、「形状：射撃」の魔法や弓などによる攻撃は、戦闘特技《ターゲッティング》がないと「誤射」が起きてしまいます。（『ルールブックI』p.137参照）

&2 前衛に求められること
&2 近接タイプ
&2 金属鎧を着込める技能
&3 前衛に立つメリット
&1 自身以外が前衛に立つ
&3 ゴーレム
&3 妖精
&3 騎獣
`
</script>