<template>
  <card>
    <card loading>
      ああ
    </card>
  </card>
  <pages-build :about-this-page="about" :main="andml1" />
</template>

<script setup lang="ts">
const about = `
このページでは回復役である「ヒーラータイプ」のキャラクターを作る際に考えると良いこと方を &em_初心者向けにわかりやすく解説 していきます。
&br
回復を担うキャラクターはパーティーにほぼ必須な存在です。
これを読んでヒーラータイプのキャラクターを作る際の考え方を知ってください！
`
const andml1 = `
&1 回復につかえる技能と特徴
ソード・ワールド2.5において戦闘中に回復ができる技能は以下の5つです。
&br
- プリースト
- コンジャラー
- フェアリーテイマー
- マギテック
- レンジャー
- アルケミスト
- ジオマンサー
&br
基本的におすすめなのは、純粋なヒーラーならプリースト、バフ・デバフもするならコンジャラー、攻撃も考えるならフェアリーテイマーかマギテック……といった感じです。
以下で技能別でおすすめの構成を解説します！

&1 技能別おすすめの構成
&2 プリースト
プリースト（神官）はヒーラータイプのキャラクターを作る際に一番オススメの技能です。
もっとも回復に向いている技能で、レベル2から使える回復魔法【キュア・ウーンズ】でHPが回復できますし、HPだけではなく、さまざまな状態異常を回復することができます。
&br
特にレベル2から使える気絶状態から回復させる魔法【アウェイクン】はかなり利便性が高く、重要な魔法です。

&3 戦闘特技
まずおすすめなのが《魔法拡大/数》です。
パーティーの人数が1人なら不要で、2〜3人でもなくてなんとかなりますが、4人以上なら必須と言えます。
&br
他は割となんでもOKです。
使い勝手が良いのは《MP軽減/プリースト》です。
MPがあるなら《魔法拡大/全て》をとって確実化をするのも良いでしょう。
&br
前衛に出ることも考えられます。その場合については以下をご覧ください。
&button_/sw25/forbeginner/build/front

&3 アイテム
〈聖印〉が必須です。
また、とにかくMPが切れたら大変なので〈魔晶石〉と〈魔香草〉が大事になってきます。
&br
〈魔晶石〉に関しては1点か2点のものを買っておき、ちまちま使うのが効率的です。
が初心者のうちは難しいかもなので、困ったら使いたい魔法の消費MPと同じ点数のものを買ってしまいましょう。

&2 コンジャラー
コンジャラー
&2 フェアリーテイマー
&2 マギテック
&2 レンジャー
&2 アルケミスト
&2 ジオマンサー

`
</script>