<template>
  <card-array-by-andml :andml="andml1" />
  <item-pagesindex :page-setting-list="$pageSettingList.filter(pa => pa.to.indexOf('/sw25/forbeginner/build/') === 0)" />
</template>

<script setup lang="ts">
const andml1 = `
&1 このページについて
このページではソード・ワールド2.5（SW2.5/ソドワ）のキャラビルドこと「キャラクタービルド」、つまり &em_キャラクターのデータ構成 について、 &em_初心者向けにわかりやすく解説 します！
&br
ソード・ワールド2.5は「種族」「生まれ」「能力値」「技能」「戦闘特技」「アイテム」とたくさんの要素が組み合わさってキャラクターデータができます。
初心者の場合、下のような疑問があると思います。
&br
- 「この種族を使いたいけど、どの技能や戦闘特技を取るといいんだろう？」
- 「この技能を使ってみたいけど、どの種族や戦闘特技を取るといいんだろう？」
- 「こういうことしてみたいけど、どういう感じにすればいいんだろう？」
&br
このページではこんな疑問にお答えします！
&br
ぜひ最後まで読んでください。
また、 &em_もしよければ周りの方に共有 してください。

&2 併せて読んで欲しいページ
「種族や技能ってどんなのがあるの？」って人はぜひ以下のページを見てください。
&button_/sw25/forbeginner/syuzoku
&button_/sw25/forbeginner/ginou
また、ソード・ワールド2.5などのTRPGのキャラクターシートを保管・共有できるWebサービス「ゆとシート」の使い方を以下で公開しています。
&button_/sw25/forbeginner/ytsheet
ぜひどれもご覧ください。

&1 やりたいことをやろう
僕はあくまでも「やりたいことをやればいい」と考えています。
ソード・ワールド2.5の楽しみ方は戦闘に強いキャラクターを作ることだけでは無いと考えているからです。
&br
だからこのウェブサイトでは「やりたいことをやる」ための方法をお伝えします。
&br
「かっこいい戦士がやりたい」と考えている人は &em_どの技能や戦闘特技を取るといいのか をお伝えします。
&br
そしてあなたのやりたい「かっこいい戦士」はきっと攻撃を命中させられない戦士ではないでしょう。
なので命中させる方法もお伝えします。

&2 注意
このページでお伝えするのは基本的に初期作成のキャラクターについてです。
&br
初期作成の場合、あなたのキャラクターは「駆け出し冒険者」です。
&br
まだまだ伝説のキャラクターではありません。
できないこと、苦手なこともあるでしょう。
&br
完全に理想のキャラクターを最初から作れなくても、これから成長していこうと割り切ってください。
伝説はこれから作っていくのです。

&1 ビルドの基本
前述の通り、ソード・ワールド2.5のキャラクターデータは「種族」「生まれ」「能力値」「技能」「戦闘特技」「アイテム」とたくさんの要素が組み合わさってできています。
ここではこれらについて解説します。

&2 種族と生まれで決まるもの
ルールブック通りの順番でキャラクターを作る場合、まずは「種族」、次に「生まれ」を決めることになります。
&br
「種族」を選ぶことで、「種族特徴」が決まり、またおおよその能力値の傾向が決まります。
「生まれ」を選ぶことで、能力値と初期技能が1〜2つ決まります。

&3 種族特徴
種族特徴とは、その名の通り種族の特徴を表すものです。
&br
使いやすい種族特徴もあれば、使いにくいものもあります。
&br
初心者の方に意識してほしいのは、 &em_種族特徴を活かさないといけないわけではない ということです。
&br
ナイトメアなら魔法戦士をしないといけないというわけではありません。
純粋な戦士をしても、魔法使いをしても、もちろん他のことをしても、いいんです。
&br
「種族特徴を活かさなきゃ……」とは思いすぎないようにしましょう。

&2 能力値
「生まれ」によって決まる心技体の数値と種族ごとのA〜Fの数値を足すことで能力値が決まります。
&br
種族ごとのA〜Fの数値はダイスを振って決めますが、多くの場合「3パターン作ってどれかを選ぶ」という方法を取ります。
このどれを選ぶかは難しいところです。
&br
この際に意識すると良いことは &em_「必要な能力値を理解する」 ことと &em_「6の倍数にする」 ことです。

&3 必要な能力値を理解する
必要な能力値は使う技能などによって変わってきます。
タイプ別に解説するのでこのページの下から飛んでください。

&3 6の倍数にする
6の倍数にすると良いのは、多くの場合、能力値ボーナス、すなわち能力値を6で割った値（端数切り捨て）が &em_判定やダメージの決定で使われる からです。
ソード・ワールド2.5では &em_能力値をそのまま使うことはほぼありません 。
基本的にボーナスの値を用います。
ボーナスが増える6の倍数（6,12,18,24,30……）にすることを意識すると良いです。
&br
なお、能力値増強の指輪（『ルールブックI』p.339）はボーナスではなく能力値を+1します。
このようなアイテムもあるので、「〇〇を買うから（6の倍数）-1にしよう」って考え方をすることができます。
ただし、初期作成では能力値増強の指輪（『ルールブックI』p.339）などを買うのは金銭的にかなり難しいのでひとまず考えなくて大丈夫です。

&2 技能と戦闘特技
「技能」と「戦闘特技」はやりたいことを表現するのに一番大事になります。
&br
個人的にはやりたい「技能」と「戦闘特技」を先に選んでから、それに合った「種族」や「生まれ」「能力値」を選ぶのがおすすめです。
&br
どの技能を使うと良いかは「パーティーのバランス」と「自分がやりたいこと」によって決まります。
&br
パーティーのバランスに関してはすぐ下で、自分がやりたいことを表現できる技能・戦闘特技についてはページの下にあるタイプ別のリンク先で、それぞれ紹介します！

&3 Aテーブルは1〜2個にしておく
技能にはAテーブルとBテーブルがあり、Aテーブルの方がレベルを上げるために必要な経験点が多くなります。（『ルールブックI』p.76・p.211参照）
&br
「冒険者レベル」は技能レベルの最も高いものに合わされ、「冒険者レベル」が上がることでHP・精神/生命抵抗力の値、そして取得できる戦闘特技の数が増加します。
「冒険者レベル」を上げることはかなり大事で、そのためには技能レベルを上げていく必要があります。
&br
Aテーブル技能を取りすぎず、 &em_Aテーブルの技能は原則0〜1個、多くても2個にしておくのがおすすめ です。
&br
ただし、高レベルの場合はMPを増やしたりその他目的で色々な魔法を少しずつ齧るみたいなこともありまっす。

&3 主動作は1ラウンドに1回しかできない
もう1つ、大事なのは「主動作は1ラウンドに1回しかできない」ことを意識することです。（『ルールブックI』p.133参照）
&br
ソード・ワールド2.5の戦闘では「移動」「主動作」は1回の手番に原則1回しかできません。
なので、「主動作」でできることが複数あっても、全てを使うことはできないのです。
&br
主に主動作として行うことになるのは「武器による攻撃」「（一部を除いた）魔法の行使」「バード技能による呪歌・終律の利用」などです。
これらを1個か、多くても2個にしておくと無難です。
&br
2個以上の場合、「どういう時にどれを使うのか」を考えて、どの技能も必要か考えると良いです。
例えば、プリースト技能とバード技能を両方持つのであれば、「回復が必要な時はプリースト技能の神聖魔法」「回復が不要な時はバード技能で呪歌を使用して味方にバフ」などが考えられます。

&1 パーティー構成
SW2.5ではプレイヤーが基本的に1人ずつのキャラクターを使って遊びます。
そのため、集まったプレイヤーの人数だけ、一緒に冒険するパーティーの人数が増えます。
多くの場合3〜6人くらいのパーティーになるでしょう。
&br
パーティー内でビルドのバランスが悪いと、探索や魔物との戦闘などの場面で困ったり、役立てなかったりするかもしれません。
&br
例えば、スカウトがいなければ罠を解除したり、宝箱の鍵を開けたりできません。
スカウトかウォーリーダーがいなければ、先制判定にボーナスがなく、かなりの確率で敵に先制を譲ることになってしまいます。
&br
他にも、全員が魔法を使えないと、防護点が高い敵にはダメージを与えられません。
&br
とまぁ、バランスが悪いと大変なのです。
&br
ではパーティーバランスが良い状況とはどういう状況でしょうか？
個人的には初期作成の場合、以下の条件が揃っているとパーティーバランスが良い（というか悪くない）と考えています。
&br
- 前衛になれるキャラクターが半分以上いる
- 高いダメージが期待できるキャラクターがいる
- 回復ができるキャラクターがいる
- スカウト技能・セージ技能を持ったキャラクターがいる
&br
できれば、以下の条件も揃っていると良いと思います。
&br
- 高い物理ダメージが期待できるキャラクターがいる
- 高い魔法ダメージが期待できるキャラクターがいる
- レンジャー技能を持ったキャラクターがいる

&1 ビルドの「タイプ」
管理人はキャラクターのデータ構成は基本的に以下の5つのタイプに分けることができると考えています。
このウェブサイトではこれらのタイプごとに解説をしていきます。
&br
- 近接タイプ
- 遠隔アタッカータイプ
- 魔法アタッカータイプ
- ヒーラータイプ
- サポート特化タイプ

&3 近接タイプ
近接タイプは「ファイター」「グラップラー」「フェンサー」「バトルダンサー」のいずれかの技能をとって、敵の攻撃をかわしつつ近接攻撃をする型です。
&br
基本的に前衛になるのはこのタイプになります。「前衛になれるキャラクターが半分以上いる」の条件を満たすため、パーティーの半分は近接タイプにするのが良いでしょう。
&br
近接型にも純粋にダメージを求めるアタッカーだけでなく、手数を増やして戦うタイプ・回避力を高くして攻撃をかわすことを優先するタイプ・防護点を高くして受けるダメージを減らすタイプなどがいます。
戦闘特技《かばう》を使って味方への攻撃を肩代わりするタイプもいるでしょう。
&br
またこのウェブサイトでは魔法使い技能と上記4技能のいずれかを両立する「魔法戦士」も近接型に含めます。

&3 遠隔アタッカータイプ
遠隔アタッカータイプは「シューター」技能を用いてボウ（弓）やボウガン（弩）で攻撃するタイプです。
&br
シューター技能はBテーブルなので、成長が早く、また他の技能と合わせやすいため、味方サポートするための技能を取ることもできます。
&br
戦闘特技《狙撃》を使えばかなりの高威力を叩き込むこともできます。
&br
4人以上のパーティーであれば、後述の魔法アタッカータイプと合わせていずれか1人がいると良いでしょう。

&3 魔法アタッカータイプ
魔法アタッカータイプは「ソーサラー」技能などをとり、敵にダメージを与える魔法（以下「攻撃魔法」）を使うタイプです。
&br
詳しくは以下のページで解説します。
&button_/sw25/forbeginner/build/magic
// - 「ソーサラー」技能の場合、レベル1から【エネルギー・ボルト】が使えます
// - 「コンジャラー」技能の場合、レベル1から【スパーク】が使えますが、威力が低く、どちらかというとレベル2から使える【アース・ヒール】を用いた「ヒーラータイプ」としての運用になります
// - 「プリースト」技能の場合、初期作成では攻撃魔法が使えないため、レベル2から使える【キュア・ウーンズ】【アウェイクン】を用いた「ヒーラータイプ」としての運用になります
// -- レベル3になれば【フォース】が使えます
// - 「マギテック」技能の場合、「シューター」技能を合わせてとってガンを使って戦ういわゆる「マギシュー」としてこのタイプになります
// -- レベル1で【ソリッド・バレット】が、レベル2で【クリティカル・バレット】が使えます
// - 「フェアリーテイマー」技能の場合、炎属性を選ぶことでレベル2で【ファイアボルト】が使えます
// - 「ドルイド」技能の場合、与えるのが物理ダメージであるので、少し特殊な扱いになります。
// -- レベル1から【ウルフバイト】が使えます
// - 「デーモンルーラー」技能の場合、レベル2から【アヴェンジャー】が使えますが、ダメージが大きい分、デメリットも大きく、魔法戦士として戦うか、魔神を召喚して戦うかをメインに据えた方が良いかもしれません

&3 ヒーラータイプ
ヒーラータイプは、その名の通り回復（ヒール）を行う、回復役です。
&br
回復魔法やその他の効果によって味方を回復する役で、1人いるだけでパーティーの継戦能力・生存力がかなり上がります。
// 初期作成の場合、「プリースト」技能か「コンジャラー」技能を使うことになります。

&3 サポート特化タイプ
上記のいずれにも当てはまらない、つまり攻撃や回復を行わない、サポート特化のタイプです。

&1 ビルドについて詳しく知ろう！
以下のページで、詳しく解説していきます。
随時追加・更新予定ですので、定期的に覗いてみてください〜。
`
</script>