<template>
  <pages-build :about-this-page="about" :main="andml1" />
</template>

<script setup lang="ts">
const about = `
このページでは「魔法アタッカータイプ」のキャラクターを作る際に考えると良いこと方を &em_初心者向けにわかりやすく解説 していきます。
&br
やっぱり魔法は使ってみたいですよね！
誰もが憧れるだろう、魔法で敵を倒すキャラクターについて、解説します！`

const andml1 = `
&1 魔法アタッカータイプの「考え方」
&2 魔法アタッカータイプの役割
魔法アタッカータイプは魔法によって攻撃するキャラクターです。
&br
難しい立ち位置で、必ずしもパーティーに必要不可欠ではなく、ヒーラーやバファーの方が好まれる場合もあります。
その上で、魔法アタッカータイプがいるなら、とにかくダメージを出すことが大事になってきます。

&2 魔法アタッカータイプに向いている技能
以下のページで詳しく解説していますが、ソーサラーとフェアリーテイマーの2つが魔法アタッカータイプに向いていると言えます。
デーモンルーラーも魔法アタッカータイプの派生といえます。
&br
一方でコンジャラーとプリーストはヒーラータイプといえます。
&br
※ マギテックシューターとドルイドは別で解説します。
&button_/sw25/forbeginner/build/magic

&3 バード技能
バード技能も【終律：春の強風】【終律：冬の寒風】を使うなら、バフ・デバフがメインの魔法アタッカータイプとして活用できます。
バードについては別で解説予定ですが、このページの「魔力」を「奏力」に、「知力」を「精神力」に、読み替えて読んでいただければと思います。

&2 遠隔アタッカータイプとの大きな違い
遠隔アタッカータイプとの違いは「与えるダメージが魔法ダメージであること」と「回避されないこと」です。
&button_/sw25/forbeginner/build/remote_attacker

与えるダメージが魔法ダメージであるため、防護点を無視して攻撃ができます。
なので少しのダメージだとしても、確実にHPを削ることができます。
&br
また、回避されないため、特に「抵抗：半減」ならば、半分は確実にダメージを与えることができます。

&2 抵抗は抜くべき？
抵抗を抜かないとダメージが半減され、クリティカルもしなくなってしまいます。
&br
もちろん、抵抗を抜けることに越したことはありません。
純粋な魔法アタッカーなら抵抗を絶対に抜くべきでしょう。
&br
抵抗を抜くための手段は、知力の能力値を上げる以外だと、ほとんどありません。
そこが難しいところです。
&br
そして純粋な魔法アタッカータイプは必ずしも必要とされないという問題があります。
近接タイプや遠隔アタッカータイプにおける命中ほど抵抗を抜くことを考える必要はなく、バフなど、他の役割をこなすことも考えながらキャラクターを作るのがおすすめです。

&2 最大火力が出るレベル
魔法アタッカータイプに特有とも言える、考えるべきことが「最大火力が出るレベル」です。
&br
攻撃魔法は一定のレベルにならないと使えないものばかりです。
例えばソーサラーの場合、レベル1から【エネルギー・ボルト】が使えますが、次はレベル3にならないと威力が上がりません。
&br
さらにレベル3で【リープ・スラッシュ】を得たあと、【ライトニング】は「形状：貫通」で強いものの《魔法制御》がないと味方に当たってしまいますし、【ブラスト】は「射程：接触」なので使いにくいため、純粋に威力が上がるのはレベル6で【ファイアボール】を得たときになります。
レベル3からレベル6に上げるには経験点が6,000点必要であり、 &em_かなり時間がかかってしまう と言えます。
&br
これは武器を変えれば威力が上がる近接タイプや遠隔アタッカータイプとの大きな違いです。
&br
ある攻撃魔法が使えるようになったタイミングが、その魔法使い系技能において「最大火力が出るレベル」です。
&br
つまりソーサラーなら、レベル1・レベル3・レベル6……となります。
これは技能によって異なり、フェアリーテイマーならランク5の炎属性魔法を使えるようになると威力が上がりますし、マギテックシューターも同じ考え方ができて、レベル6で【バースト・ショット】が使えるようになると威力が上がります。
&br
バードの場合も、レベル1・レベル5……で使える終律が一気に変わって、威力が上がります。
&br
魔法アタッカータイプをする際「どの魔法を使おう……？」と悩んだ場合は、そのレギュレーションにおいて作れる技能レベルを考え、そのレベルで使えるようになる魔法を見ると、どの魔法使い系技能が強そうかがわかるので、ぜひ1つの基準にしてみてください。
とはいえ、好きな技能を使うのが一番ですが……。

&1 相性の良い戦闘特技
使いたい魔法の「形状」と「対象」が重要になってきます。
&br
なお、バード技能については別で解説します。

&2 ターゲッティング
「形状：射撃」なら《ターゲッティング》が必須と言えます。
&br
前衛に出るなら話は別ですが……。
&button_/sw25/forbeginner/build/front

&2 魔法拡大/数
「対象：1体」なら《魔法拡大/数》がかなり役立ちます。
1回に複数の対象を攻撃できるのは、魔法アタッカータイプの特徴の1つと言えます。
&br
もちろん、近接タイプや遠隔アタッカータイプでもできないことはないですが……。

&2 魔法収束
「対象：エリア」の場合、《魔法収束》がないと味方にも当たってしまいます。
また、次に出てくる《魔法制御》の前提でもあります。

&2 魔法制御
「対象：エリア」や「形状：貫通」の魔法を効率よく使うためには必須と言える戦闘特技ですが、前提が2つあるため、実質 &em_5レベル以上でないと取得できません 。
取れるようになったら取るべきでしょう。

&1 サブの技能
最後に、魔法アタッカータイプにおすすめのサブの技能を解説していきます。
&br
なお、バード技能については別で解説します。

&2 共通の相性が良い技能
同じく知力を必要とするスカウト・レンジャー・セージとの相性は良いです。
基本的にこれらのいずれかとメインとなる魔法使い系技能の2つを伸ばしていけば問題ありません。
&br
また、ウォーリーダーをとって【陣卒:軍師の知略】を使うのもおすすめです。

&2 ソーサラー
ソーサラーの場合、『メイガスアーツ』を導入すればコンジャラーと合わせることで「ウィザード」として「深智魔法」を使えるようになるというメリットがあります。
&br
鎧が着ると制限を受けることや主動作を使うことを踏まえると、他に相性が良いのは補助動作でいろいろできるライダー・アルケミスト・ドルイド・ジオマンサー・ウォーリーダーあたりでしょうか。

&2 フェアリーテイマー
妖精を召喚すると、自分が主動作ですべきことがなくなるため、主動作を使う戦士系技能との相性も悪くなく、どの技能と組み合わせても活躍できます。
金属鎧を着ても召喚した妖精は影響を受けないので、鎧を着ることも可能です。

&2 デーモンルーラー
自身を強化する魔法が多いことから、近接タイプメインで魔法戦士として使うことも考えられます。
&button_/sw25/forbeginner/build/warrior

そうでない場合、やはり補助動作でなんやかんやできるライダー・アルケミスト・ドルイド・ジオマンサー・ウォーリーダーあたりがおすすめです。
ただし、ライダーやジオマンサーは、魔神を使役している場合、やることが増えすぎるのであまりおすすめできません。
`
</script>