<template>
  <pages-build :about-this-page="about" :main="andml1" />
</template>

<script setup lang="ts">
const { $ginou } = useNuxtApp()
const magic = Object.entries($ginou).filter(([key, data]) => data.type.indexOf("魔法使い系") >= 0)

const about = `
このページでは魔法使い系技能（${magic.map(m => m[0]).join("・")}）の使い方を &em_初心者向けにわかりやすく解説 していきます。
&br
ルールブックIだけで4種類、サプリメントも全て入れれば${magic.length}種類もあるソード・ワールド2.5の魔法。
初心者さんはどれがなんだかわからなくなりがちだと思います。
そこで、このページで &em_それぞれの魔法の特徴 や、おすすめのタイプ（攻撃役か・回復役か……）など解説します。
&br
もちろん「マギシュー」や「ウィザード」についても解説します。
`

const magicExplain = (magicname: string) => {
  const findresult = magic.find(([key]) => key === magicname)
  if (!findresult) throw "error! magic error"
  const data = findresult[1]
  return `&3 ${magicname}
${magicname}は『${data.debut}』で登場した、${data.magic}を使う魔法使い系技能です。
&br
`
}
const andml1 = `
&1 魔法の種類と特徴
前述の通り、ソード・ワールド2.5の魔法は${magic.length}種類もあります。
以下でその簡単な特徴を説明します。

${magicExplain("ソーサラー")}
レベル1から攻撃魔法【エネルギー・ボルト】を使うことができるため、魔法アタッカータイプに適性があります。
一方で回復魔法は使えないため、ヒーラータイプには適性がありません。
&br
鎧を着用することによる制限があるため、種族がナイトメアでない限り、魔法戦士としての特性は低いです。
&br
&em_かなり使いやすく、シンプルに強い ため、「とりあえず魔法使いをやってみたい！」という初心者の方には &em_一番おすすめ の技能です。

${magicExplain("コンジャラー")}
レベル1から攻撃魔法【スパーク】が使えますが、威力が低く、魔法アタッカータイプへの適性は低めです。
&br
レベル2から回復魔法【アース・ヒール】を使えるため、ヒーラータイプとしての適性があります。
また、味方の攻撃を上げたり、味方の受けるダメージを減らしたりする、いわゆる「バフ」であったり、敵の回避力などのステータスを下げる、いわゆる「デバフ」が得意です。
味方を回復しつつサポートすることができます。
&br
鎧を着用することによる制限がありますが、敵にダメージを与えたり、デバフをかけたりするわけでなければ、制限を受けても問題がありません。
そのため、魔法戦士として戦いながら味方を回復したり、バフをかけたりすることができます。
&br
また少し特殊なタイプですが、戦士系技能を持たずに金属鎧を着込んで前線に出る「前衛コンジャラー」も存在します。
&br
レベル3からは【クリエイト・ゴーレム】を使ってゴーレムを作り、戦うことができるのも特徴です。

${magicExplain("プリースト")}
レベル3から攻撃魔法【フォース】が使えますが、初期作成では1つ攻撃魔法が使えず、魔法アタッカータイプへの適性はかなり低いです。
&br
レベル2から回復魔法【キュア・ウーンズ】を使うことができ、さらに同じくレベル2から気絶状態から回復させる魔法【アウェイクン】も使えるため、ヒーラータイプとしての適性はかなり高いです。
&br
初期作成だと味方の回復が不要な場合、やることがなくなってしまいます。
戦闘中に主動作を使ってできる他のこと（戦士系やバード技能・アルケミスト技能など）を用意しておくと良いでしょう。
&br
鎧を着用することによる制限がないため、戦士系技能との相性が良く、前線に出て神官戦士（魔法戦士の一種）として戦うこともできます。
いわゆるパラディン的なことをするならプリースト技能とファイター技能を取ることになるでしょう。
&br
信仰する神については、レベル2から使える特殊神聖魔法があるため、そこをチェックしつつ、教義などを見ながら選ぶのがおすすめです。
神々については『ルールブックI』のp.357などに解説があります。

${magicExplain("マギテック")}
マギテック技能は初期作成ではシューター技能と組み合わせない限り、攻撃も回復もできません。
&br
シューター技能と組み合わせることでカテゴリ〈ガン〉の武器を使うことができるようになり、攻撃や回復が可能になります。
このようにマギテック技能とシューター技能を組み合わせたビルドを「マギテックシューター」略して「マギシュー」と呼びます。
&br
レベル1で【ソリッド・バレット】が、レベル2で【クリティカル・バレット】が、シューター技能と合わせれば攻撃魔法のように使えます。
&br
レベル2で【ヒーリング・バレット】が、シューター技能と合わせれば回復魔法のように使えます。
ただし回復量は少なくなりがちなので、回復も可能な「魔法アタッカータイプ」として運用するのがおすすめです。

${magicExplain("フェアリーテイマー")}
フェアリーテイマー技能は属性を選ぶことになり、選んだ属性によって使える魔法が異なります。
&br
炎属性を選んだ場合、レベル2から攻撃魔法【フォース】が使えます。
初期作成の場合は炎属性は選ぶ方が無難と言えます。
&br
光属性を選んだ場合、レベル3から回復魔法【プライマリィヒーリング】が使えます。
初期作成では「ヒーラータイプ」として使うのは難しいですが、レベルが上がれば「魔法アタッカータイプ」と「ヒーラータイプ」を兼ねることができます。
&br
かなり「なんでもできる魔法使い」に近い存在になれますが、初期作成だと特別強いと言ったことはありません。

${magicExplain("ドルイド")}
レベル1から攻撃魔法【ウルフバイト】が使えますが、与えるのが物理ダメージであるので、少し特殊な扱いになります。
「魔法アタッカータイプ」というよりも「遠隔アタッカータイプ」の派生として考える方が良いかもしれません。
&br
コンジャラー同様にバフを撒くのは得意で、特にレベル1から使える【ウィングフライヤー】はかなり強力です。
バフを撒ける「遠隔アタッカータイプ」として考えると良いかもしれません。
&br
鎧を着用することによる制限がありますが、バフをかける上では問題ないため、バファーと割り切った上で魔法戦士になることもできます。
&amazon_モンストラスロア

${magicExplain("デーモンルーラー")}
レベル2から攻撃魔法【アヴェンジャー】が使えますが、ダメージが大きい分、デメリットも大きいため、純粋な「魔法アタッカー」としての運用は難しいです。
初期作成の場合、魔神を召喚しレベル2から使える【デモンズポテンシャル】を使いつつ戦うことをメインに据えた方が良いかもしれません。
&br
また、魔法戦士への適性が高いです。
魔法戦士となる場合、レベル1から使える【デモンズアーム】がかなり強力です。
&amazon_モンストラスロア

&1 魔法使い系技能の基本

&2 魔力と魔法行使判定
魔法使いをする際に最も大事なのが「魔力」と「魔法行使判定」（『ルールブックI』p.116・p.172参照）です。
&br
魔力は「魔法使い系技能のレベル」と「知力ボーナス」、そして魔力を上下するアイテムなどの効果によって決まります。
&br
魔法行使判定は「魔法がどれくらい上手く使えたか」を決める判定です。
基本的にダイスの出目と「魔力」、そして魔法行使判定を上下するアイテムなどの効果によって決まりっます。
&br
これが自動失敗（『ルールブックI』p.97参照）となれば、魔法は失敗してしまいますし、達成値が高ければ高いほど、魔法はうまく使えたことになります。
&br
敵にダメージを与えたり、デバフをかけたりする魔法は、基本的に敵が「抵抗」をしてきます。
「抵抗」については後述しますが、抵抗を成功されないためには、魔法行使判定の達成値が高い方が良いです。

&2 抵抗を見よう
前述のように、敵にダメージを与えたり、デバフをかけたりする魔法は、基本的に敵が「抵抗」をしてきます。
&br
この抵抗には「消滅」「半減」「任意」「なし」などさまざまな設定があり、これに応じて、敵が抵抗できるか否かや、抵抗した場合にどうなるかが決まります。
詳しくは『ルールブックI』p.186を読んでください。

&3 攻撃魔法
攻撃魔法は多くの場合、「抵抗：半減」です。
つまり、もし抵抗されてしまっても、半分はダメージを与えることができます。
&br
とはいえ、なるべく抵抗されないように、魔力や魔法行使判定の値が高くしておくと良いでしょう。
&br
なお、魔法ダメージを与える場合、防護点の効果は発揮されず、そのままHPを減らすことができます。（『ルールブックI』p.143参照）

&3 回復魔法・バフ
回復魔法やバフは多くの場合、「抵抗：任意」「抵抗：なし」です。
抵抗されることはないため、魔法行使判定の値が高い必要はありません。
&br
ただし、回復魔法の場合、回復量が魔力によって増えることがあるため、魔力は高いと良いでしょう。

&3 デバフ
デバフは多くの場合、「抵抗：消滅」です。
抵抗されてしまうと、効果を発揮しません。
&br
デバフを撃つのであれば、魔法行使判定の達成値がなるべく高いと良いでしょう。
&br
初期作成であれば、魔物レベル3のモンスターの精神抵抗力の値よりも、魔法行使判定の基準値（≒魔力）が1以上高くないと、かなりの確率で失敗してしまいます。
失敗率が高い場合、デバフをかけるのは諦め、攻撃魔法・回復魔法・バフなどを使う方が良いです。
&br
『ルールブックI』p.429から先を読み、魔物データを見た上で、どのくらい魔力があると大丈夫かを考えましょう。
初期作成ではボスは多くの場合、魔物レベル3の魔物が選ばれます。
&br
魔法行使判定の基準値と魔物の精神抵抗力がそれぞれどのくらいだと成功率がどのくらいになるかは、以下の判定シミュレーターを使って簡単に調べることができます。
&br
この際、モードは「達成値の比べ合い」にして、「能動」の「基準値」を魔法行使判定の基準値に、「受動」の「基準値」を魔物の精神抵抗力にしてください。
他の数値はいじらなくて大丈夫です。
&button_/sw25/tool/simulate

&2 対象を見よう
魔法には「対象」があり、自分にかける魔法だったり、誰か1人にかける魔法だったり、ある一定の領域にかける魔法だったりします。（『ルールブックI』p.178参照）
間違えてある一定の領域にかける魔法を1人にかける魔法だと思い込んで使ってしまうと、味方と一緒に敵も回復してしまったり、敵と一緒に味方にもダメージを与えてしまったり、するかもしれません。
&br
しっかりと「対象」を確認しましょう。
&br
また「対象」によって戦闘特技《魔法拡大/数》が使えたり、戦闘特技《魔法制御》がないと使い物にならなかったりします。
注意しましょう。
&br
他にも「形状」（『ルールブックI』p.176参照）や「効果時間」（『ルールブックI』p.183参照）にも注意する必要があります。
「形状：射撃」だと戦闘特技《ターゲッティング》がないと誤射してしまうことがあります。

&1 魔法戦士について
魔法戦士とは、魔法を使う戦士のことであり、すなわち魔法使い系技能と前衛の戦士系技能（ファイター・グラップラー・フェンサー・バトルダンサー）を組み合わせて戦う冒険者のことです。

&2 魔法戦士の問題点
フェンサー以外は全てAテーブルであり、Aテーブル2つとなると成長に必要な経験点が多くなり、結果成長が遅れてしまいがちです。
他の技能をサブとして取るのもなかなか難しくなります。
&br
それでもロマンなのが魔法戦士です。

&2 初期作成で魔法戦士は厳しい
初期作成での魔法戦士はかなり難しいです。
魔法使い系技能の多くは上記で解説したように、レベル2から強力な魔法を使えるようになります。しかし、魔法使い系技能をレベル2にすると、戦士系技能はたとえBテーブルのフェンサー技能であってもレベル2にすることはできません。
すると命中力が下がってしまい、かなり微妙になります。
&br
また、魔法戦士として戦う上で便利な戦闘特技に《魔力撃》と《マルチアクション》がありますが、《魔力撃》は初期作成段階では《全力攻撃》に比べて火力が低いことがあり、また《マルチアクション》はレベル5から取得可能なため、初期作成段階では使えません。
&br
初期作成で《魔力撃》を使った魔法戦士をする場合、 &em_知力ボーナスが3以上（知力の能力値が18以上）ないと厳しい です。
&br
逆に、知力ボーナスが3以上あるならば、フェンサー1レベル+魔法使い系技能2レベル+エンハンサー1レベルでかなりの高火力を出すことができます。
ただし命中の基準値がかなり低くなるため、器用度ボーナスが3以上あるキャラクターを使い、武器をメイスにするなどしてなんとか命中力を上げる必要がありそうです。
&br
フェンサー2レベル+魔法使い系技能1レベル+エンハンサー1レベルにすると《魔力撃》のダメージは変わらず、命中が上がります。
一方で使える魔法が減り、また魔法行使判定の達成値が下がるので、攻撃魔法やデバフは難しくなるでしょう。
&br
いずれにせよ、ダメージ以外の多くを他のパーティーメンバーに任せることになってしまいますが……。

&2 途中から魔法戦士になる選択肢もある
「俺はこいつに魔法戦士になって欲しいんだ」って思っても、現実的に初期作成で活躍できる魔法戦士を作るのはかなり難しいです。
&br
だから割り切って、「最初は戦士として冒険者になって、途中で魔法を習って使うようになった」みたいな設定にして、何回か成長してから魔法を使うのもありだと思います。
もちろん逆の、「最初は魔法使いとして冒険者になって、途中で剣を持って戦うようになった」でもいいです。
&br
いろいろと調整すれば魔法戦士を作ることもできますが、上記のような設定にするのも、1つの賢明な手段だと思います。
`
</script>