<template>
  <pages-build :about-this-page="about" :main="andml1" />
</template>

<script setup lang="ts">
const about = `
このページでは「遠隔アタッカータイプ」のキャラクターを作る際に考えると良いこと方を &em_初心者向けにわかりやすく解説 していきます。
&br
個人的な感覚ではなかなか使われないビルドである、弓か弩を使って戦うタイプのアタッカー。
&br
基本はいたってシンプルです。
ここで解説するので、せっかくなので作ってみてください！
`
const andml1 = `
&1 遠隔アタッカータイプの「考え方」
遠隔アタッカータイプはシューター技能を取り、弓か弩を使って攻撃するタイプのキャラクターです。
基本的に後衛から攻撃を行います。
&br
遠隔アタッカータイプが最も注意すべきことは1つだけ、攻撃を当てることです。

&2 命中しなければ意味が無い
近接タイプの場合、もし命中しなかったとしても、前衛に立つという最低限の仕事ができています。
&button_/sw25/forbeginner/build/warrior
&button_/sw25/forbeginner/build/front

しかし、遠隔アタッカータイプは基本的に後衛にいるため、攻撃を命中させないと、何もできません。
&br
&em_とにかく命中を意識しましょう。
命中を上げる方法は上記の「近接タイプの『考え方』」で説明しているので、これを活かしてください。

&2 前衛に立つ遠隔アタッカータイプ
前衛に立つこともなしではありません。
ただし、シューター技能で回避判定を行うためには戦闘特技《射手の体術》が必要ですが、これはシューターレベルが7以上ないと取ることができません。
&br
金属鎧を着込むことになるでしょう。
&br
前衛に立つメリットなどは以下のページも参考にしてください。
&button_/sw25/forbeginner/build/front

&2 弓か弩か
弓（カテゴリ〈ボウ〉）か弩（カテゴリ〈クロスボウ〉）かはあまり迷う必要がありません。
&br
クロスボウは『ルールブックI』p.313にあるように、威力が高く、追加ダメージもボウに比べて高いですが、かわりに「筋力ボーナス」の加算がありません。
キャラクターの筋力の値を見て、どちらを選ぶとダメージが強くなるか考えましょう。
&br
ボウで使う〈矢〉の方が、クロスボウで使う〈太矢〉より安いですが、あまり気にしなくて大丈夫だと思います。
&br
どちらが高ダメージを出せるかは、ぜひ判定シミュレーターを使って調べてみてください。
&button_/sw25/tool/simulate

なお、〈ガン〉はマギテック技能も必要なため、別で説明します。

&1 相性の良い戦闘特技
&em_最初にとるべき戦闘特技は《ターゲッティング》でほぼ確定 です。
これがないと、前衛に立たない限り誤射（『ルールブックI』p.137）が起きてしまいます。
&br
次は敵後衛へ攻撃したいなら《鷹の目》、命中が不安なら《牽制攻撃》といった感じでしょうか。
困ったら《武器習熟》もありです。
&br
なお、《牽制攻撃》は「適用：1回の武器攻撃」なので使用可能ですが、《全力攻撃》などは「適用：1回の近接攻撃」なので使用不可能です。
&br
前衛に立つ場合には《ターゲッティング》と《鷹の目》は不要です。
その代わり《防具習熟》が選択肢になります。

&2 狙撃をするなら
遠隔アタッカー向けの戦闘特技として《狙撃》があります。
&br
かなり珍しい主動作型の戦闘特技で、手番1回分の主動作を失う代わりに、次の手番で攻撃した際のダメージを増やせるという効果です。
&br
狙撃をする際は奇数ラウンドしか効果を発揮しないスキルと組み合わせるのがおすすめです。
エンハンサー技能の練技【キャッツアイ】【マッスルベアー】やアルケミスト技能の賦術【クリティカルレイ】、ドルイド技能の森羅魔法【ウィングフライヤー】などがおすすめです。

&1 サブの技能
シューター技能はBテーブルなので、経験点が少なくすみ、他の技能に経験点を割くことができます。
&br
器用度が高い必要があるため、器用度が大事になるスカウト・レンジャーとは相性が良いと言えます。
&br
また上記の「狙撃をするなら」で述べたエンハンサー・アルケミスト・ドルイドは、どれも補助動作で使って活躍できるので相性が良いです。
他にも騎芸【高所攻撃】は遠隔攻撃にも効きますし、【遠隔指示】で前衛を増やせるのでライダー技能とも相性が良いと言えます。
&br
さらに回復すべき味方がいないとやることがなくなりがちなプリーストや、妖精を召喚するとやることがなくなりがちなフェアリーテイマーと組み合わせるのも面白いです。
特に《ターゲッティング》と相性が良いフェアリーテイマーは相性が良いです。。
&br
なお、マギテック技能を組み合わせるパターンは別で説明します。
`
</script>