<template>
  <pages-build :about-this-page="about" :main="andml1" />
</template>

<script setup lang="ts">
const about = `
このページでは「近接タイプ」のキャラクターを作る際に考えると良いこと方を &em_初心者向けにわかりやすく解説 していきます。
&br
ソード・ワールド2.5を遊ぶ上で、パーティーに絶対不可欠な「近接タイプ」のキャラクターの作り方を知れば、「ひとまずキャラクターを作る上で困らない」状態になります。
考えることは他のタイプよりシンプル。
&br
敵と近い距離で戦う戦士や拳闘士などの作り方をみていきましょう！`

const andml1 = `
&1 近接タイプの「考え方」
「近接タイプ」は前衛として、魔物と近距離で戦うタイプです。
&br
メイン技能はファイター・グラップラー・フェンサー・バトルダンサーのいずれか1つを選択することになります。
&br
これらのうち複数を取ることは、ルール的に禁止されていませんが、かなり渋いです。

&2 各技能の特徴
&3 ファイター
ファイター技能は最もオーソドックスで、一部の「グラップラー専用」の武器・防具を除いて、全ての武器・防具を使うことができます。
&br
鎧を着込んだ重装戦士をするならファイター一択ですし、ソードアートオンライン（SAO）のキリトのようなキャラクターをするとしても、ファイターは最も有力な選択肢と言えます。

&3 グラップラー
グラップラー技能は、一部のパンチ・キックを強化するためのものを除いて武器を用いず、パンチ・キック・〈投げ〉などの技を用いて戦う技能です。
&br
武器はカテゴリ〈格闘〉のものしか使うことができず、防具は「グラップラー装備可能」「グラップラー専用」のものしか使えません。
&br
&em_グラップラー技能を1レベル取得すると戦闘特技《追加攻撃》が自動的に使えるようになる のが大きな特徴です。
これを活かしながら戦うことが基本となります。
&br
戦闘特技《両手利き》を選択すると、命中が下がりますが、1回の手番に3回も攻撃ができるようになり、かなり強力です。
&br
〈投げ〉はグラップラーだけができる特殊な攻撃で、相手を転倒状態にすることができます。（『ルールブックI』p.155参照）
2H扱いなので、《追加攻撃》が使えないことには注意が必要です。
《投げ強化》《踏みつけ》など〈投げ〉専用の戦闘特技があるため、 &em_〈投げ〉を使う場合は〈投げ〉メイン で考えることになります。
&br
なお、グラップラー技能は戦士系技能の中で唯一「投擲攻撃」を行えません。（『ルールブックI』p.140参照）
あまり使う機会はありませんが、覚えていて損はないでしょう。

&3 フェンサー
フェンサー技能はこれらの技能の中で唯一のBテーブル技能です。
他の技能とあわせやすいことがまず大きなメリットと言えます。
&br
装備できる武器・防具の重量が、筋力の値の半分までに制限されますが、クリティカルが少し起きやすくなるというメリットがあります。
&br
戦闘特技《必殺攻撃》を取れば、初期作成でも4割以上の割合でクリティカルするようにできます。

&3 バトルダンサー
バトルダンサー技能はサプリメント『バトルマスタリー』で追加された技能です。
&br
武器は「グラップラー専用」のものを含め、全てが利用可能ですが、一方で防具にはかなりの制限があります。
&br
戦闘特技を多く取得できることが何よりもの特徴ですが、レベル7になると自動取得できる戦闘特技《舞い流し》はかなり面白いです。
&amazon_バトルマスタリー

&2 考えるべきことは4つ
「近接タイプ」を考えるとき、大事になるのは以下の4つです。
&br
- 敵に武器を当てるための「命中」
- 武器が当たった敵に与える「ダメージ」
- 敵の攻撃をかわすための「回避」
- 敵から受けたダメージを減らす「防護点」
&br
これら4つを上手に設定することで、活躍できる「近接タイプ」のキャラクターを作ることができます！
&br
以下でそれぞれについて、詳しくみていきましょう。

&1 命中が命
近接タイプは原則として、 &em_命中しないとダメージを与えられません。
当たり前のことのようですが、かなり大事なことです。
&br
攻撃を当てるためには、自分の命中力判定と相手の回避力判定とで「達成値の比べ合い」（『ルールブックI』p.139）を行い、勝つ必要があります。
&br
ソード・ワールド2.5には「受動側優先の原則」（『ルールブックI』p.106）があるので、命中力判定の達成値が、相手の回避力判定の達成値よりも高くなる必要があります。
&br
これ、簡単に見えて意外と難しいんです。

&2 命中の基準
では命中力がどのくらいだと攻撃が当たるのでしょうか？
&br
『ルールブックI』p.429から先を読み、魔物データを見た上で、どのくらい命中力があると大丈夫かを考えましょう。
初期作成ではボスは多くの場合、魔物レベル3の魔物が選ばれます。
&br
命中力判定の基準値と魔物の回避力がそれぞれどのくらいだと成功率がどのくらいになるかは、以下の判定シミュレーターを使って簡単に調べることができます。
&br
この際、モードは「達成値の比べ合い」にして、「能動」の「基準値」を命中力判定の基準値に、「受動」の「基準値」を魔物の回避力にしてください。
他の数値はいじらなくて大丈夫です。
&button_/sw25/tool/simulate

結果を言ってしまえば、命中力が「5」以上ないと、魔物レベル3の敵には &em_半分以上の攻撃をかわされてしまいます。
「6」あればそれなりに当たり、「7」あればほぼ全て当たると思って大丈夫です。
&br
初期作成の場合、 &em_近接タイプでダメージを与えるなら命中力が「5」以上 と覚えておくと良いです、

&2 命中力を上げる方法
では命中力を上げるにはどうすれば良いのでしょうか？
命中力は「戦士系技能レベル」と「器用度ボーナス」が影響するので、これらを上げるのは大事です。
&br
器用度が高い「種族」・「生まれ」を選び、戦士系技能レベルは2にしておくと安心です。
&br
命中は高いに越したことはないです。
以下では &em_命中力を上げる方法を紹介 します。

&3 戦闘特技
戦闘特技《牽制攻撃》や《斬り返し》を使うことで、攻撃が命中しやすくなります。

&3 武器
武器によっては命中がアップします。
特にカテゴリ〈メイス〉の武器はほぼ全て命中がアップするので、命中が不安ならメイスを使うのがおすすめです。

&3 練技
エンハンサー技能を取得すると、1レベルごとに1つ「練技」が使えるようになります。
練技【キャッツアイ】を取ることで命中を高められます。
&br
エンハンサー技能はBテーブルなので、1レベル取得するのに必要な経験点はわずか500点です。
かなりおすすめの方法です。

&3 魔法
マギテック技能の魔動機術【ターゲットサイト】やドルイド技能の森羅魔法【ウィングフライヤー】はどちらも1レベルから使用可能で、命中を高めることができます。
ただし、どちらの技能もAテーブルなので、経験点を考えるとおすすめ出来る状況は少ないです。

&3 味方によるバフ・デバフ
味方からバフをもらって命中を高めてもらう、もしくは敵の回避を下げてもらうのもありです。
&br
例えば戦闘特技《囮攻撃》・バード技能の呪歌【モラル】・ドルイド技能の森羅魔法【ウィングフライヤー】・ウォーリーダー技能の鼓咆【怒涛の攻陣II：旋風】などがあります。

&1 回避するのか鎧を着込むか
命中の次に考えるべきなのは、ダメージ……ではなく、回避もしくは防御でしょう。
いずれも、敵の近接攻撃に対する手段となります。
&br
この2つを両方とも高くするのは難しいです。
回避を高くする場合、敏捷度が高い必要があり、防護点を高くする場合、金属鎧を着るために筋力が高い必要があります。
また防具には回避力を上げるものと、防護点を上げるものとがあり、どちらを選ぶかによっても、性能が変わってきます。
&br
この辺は以下のページでも詳しく解説します。
&button_/sw25/forbeginner/build/front

&2 回避力を上げるパターン
回避の場合、考え方は命中と同様で、想定される魔物の命中力をみて、どのくらいの回避力が必要か考えると良いでしょう。
&br
戦闘特技《全力攻撃》など回避が下がるものは使いにくくなります。
&br
回避を上げる場合には、戦闘特技《ディフェンススタンス》があります。
レベルが3以上になれば戦闘特技《回避行動》も取れるようになります。
&br
他にもエンハンサー技能の練技【キャッツアイ】・ライダー技能の【攻撃阻害】・ドルイド技能の森羅魔法【ウィングフライヤー】・ウォーリーダー技能の鼓咆【流麗なる俊陣I】などが使えます。
&br
また、敏捷度が高い場合、スカウト技能との相性がかなり良いです。

&2 防護点を上げるパターン
防護点を上げる場合は、とにかく金属鎧を着込むのが良いでしょう。
盾を持つことも考えられます。
&br
この場合、戦闘特技《全力攻撃》など回避が下がるものも使いやすいです。
&br
良い防具を使うために戦闘特技《防具習熟》を取ることも選択肢になります。
防護点を上げる場合には、エンハンサー技能の練技【ビートルスキン】・アルケミスト技能の賦術【バークメイル】・ウォーリーダー技能の鼓咆【鉄壁の防陣I】などが使えます。
また、一部の武器には防護点が上がる効果があります。
&br
金属鎧を着る場合、スカウト技能との相性が悪くなります。
また、一部の魔法技能には制限を受けますが、回避型の魔法戦士も必要な能力値が多くなりすぎて難しいので、個人的には魔法戦士は鎧を着込む方がおすすめです。

&2 どちらも低いパターン
パーティーメンバー次第ではどちらも低くてもなんとかなる場合があります。
&br
例えば味方に戦闘特技《挑発攻撃》や《かばう》を持っているキャラクターがいる場合です。

&2 魔法対策
これらは物理的な攻撃には効果を発揮しますが、魔法の攻撃については効果が薄いです。
なお、ガンによる攻撃は回避できますが、防護点は発揮しません。
&br
これに関しては基本的に精神抵抗力が高い種族・生まれを使うしかありません。
特に魔法耐性が高い種族にはグラスランナーなどがいます。

&1 ダメージを考える
さて、考えるべきといった4つの要素のうち、「命中」「回避」「防護」について説明を終えました。
最後に「ダメージ」を考えましょう。

&2 ダメージの決定方法
ダメージは「武器の威力」「クリティカル値」「技能レベル」と「筋力ボーナス」、そしてダメージを増減する効果によって決まります。

&3 クリティカル値以外
「武器の威力」「技能レベル」「筋力ボーナス」は高ければ高いほど、ダメージが大きくなります。
また武器の威力は基本的にその武器の必要筋力値が大きいほど、大きくなります。
要は筋力があればダメージが出ます。
&br
また、良い武器を使うために戦闘特技《武器習熟》を取ることも選択肢になります。
&br
ダメージを増加する効果はかなり多いです。
戦闘特技には《全力攻撃》がありますし、他にもエンハンサー技能の練技【マッスルベアー】・ライダー技能の騎芸【高所攻撃】【チャージ】・アルケミスト技能の賦術【ヴォーパルウェポン】などがあります。

&3 クリティカル値
難しいのが「クリティカル値」です。
「クリティカル値」は &em_低いほどクリティカルしやすくなり ダメージが増えます。
&br
クリティカルすればダメージが増えますが、威力が低い武器だとクリティカルしても増えるダメージが少ないのが悩みどころです。
しかし威力が高い武器はクリティカル値が高く、クリティカルしにくいです。
&br
どうするとダメージが多くなるかは判定シミュレーターを使って調べてみてください。
&button_/sw25/tool/simulate
クリティカルしやすくなる効果にはフェンサー技能や戦闘特技《必殺攻撃》・アルケミスト技能の賦術【クリティカルレイ】などがあります。
ただし、「7以下にはならない」という注釈が書いてあることが多いので注意しましょう。

&2 一撃か連撃か
もう1つ、大切なのが「一撃か連撃か」です。
&br
基本的には1回の手番に1回までしか攻撃ができませんが、戦闘特技《両手利き》やグラップラー技能だと使える戦闘特技《追加攻撃》を使うなどすれば複数回攻撃することができます。
また戦闘特技《薙ぎ払い》など複数体を攻撃できる効果もあります。
&br
しかし、命中やダメージが減ってしまうこともあるため、注意が必要です。
また、複数回攻撃すると、毎回防護点分だけダメージが減ってしまうという問題点もあります。
&br
二刀流はかっこいいですが、ソードアートオンライン（SAO）のキリトも最初は剣を1本だけ使っていました。
最初は「一撃を大事にする」というのも大アリです。

&1 命中を捨てるパターン
最後に、特殊な例として「命中を捨てる」パターンもあるということをお伝えします。
&br
例えば戦闘特技《囮攻撃》か《かばう》を使うことを意識し、味方を守ることに注力する場合です。
&br
ただし、基本的に初心者向けではないので、あんまり考えなくてもいいかもしれません。
この辺は以下のページでも詳しく解説します。
&button_/sw25/forbeginner/build/front
`
</script>