import { bookList } from "../dict/new";

export const sampleWords = [
  "ソード・ワールド2.5",
  "TRPG 初心者",
  "初心者向け",
  "SW2.5 サプリメント",
  "SW2.5 新刊",
  "SW2.5 種族",
  "SW2.5 技能",
  "SW2.5 同人",
  "SW2.5 オリジナル要素",
  "SW2.5 オリジナル技能",
  "SW2.5 オリジナル種族",
  "SW2.5 オリジナル流派",
  "オンセ 素材",
  "ココフォリア",
  "TRPG 自己紹介シート",
  "SW2.5 自己紹介シート",
  // シナリオ
  "シナリオ",
  "おすすめシナリオ",
  "初心者向けシナリオ",
  "ウォフトルーバの研究所跡",
  // 冒険者の旅路関連
  "冒険者の旅路",
  "ふきのとうを採りに",
  "C102",
  "夏コミ",
  // ラクシアライフ
  "一般技能",
  // アーケインレリック関連
  "SW2.5 5周年",
  "新種族",
  "種族 追加",
  "希少種",
  // 最近のサプリメント
  ...bookList.map((b) => b.title),
  // おすすめサプリメント
  "おすすめサプリメント",
  "エピックトレジャリー",
  "デモンズライン",
  // その他のTRPG
  "マモノスクランブル",
  "幻想ナラトグラフ",
  "東方TRPG",
  // アルケリンガ
  "アルケリンガ",
  "GMウォーロック",
];
