<template>
    <CardArrayByAndml :andml="andml0" />
    <CardArrayByAndml :andml="andml1" />
</template>

<script setup lang="ts">
const andml0 = `
&1 企画概要
「ここが好き！ SW2.5」とはTRPG「ソード・ワールド2.5」の &em_いろいろな楽しみ方・さまざまな魅力 をお伝えするため、いろいろな遊び方をしている方ゲストとしてお呼びし、インタビューをしていくものになっています！
&br
ぜひ &em_自分に合った遊び方・楽しみ方 を見つけて、ソード・ワールド2.5をより楽しんでください！
`
const andml1 = `
&1 ゲスト紹介
今回はゲストとして &em_Dagon さん（ &link_https://twitter.com/DagonUnder6Feet,@DagonUnder6Feet ）に来ていただきました。
&br
Dagonさんは &em_ソード・ワールド2.5のオリジナル大陸「クレメリア大陸」 を作成している人で、クレメリア大陸を舞台としたシナリオをTALTOに公開したり、彼の管理するDiscordサーバーでクレメリア大陸を舞台としたセッションが開催したりしています！！
&br
また、Twitterの「ソード・ワールド2.5雑談コミュニティ」を作成してくださった方でもあります。
&br
そんなDagonさんに、ソード・ワールド2.5の魅力をたっぷり伺っていきます！

&1 Dagonさんってどんな方？
&syachi ソード・ワールド2.5は月に何回くらい遊んでいますか？
月に3〜4回、オンラインで遊んでいます。
週に1回、休みの日に遊ぶことが多いですね。
&br
誘い合いながらって感じで、GMをすることが多いです。
&syachi GMとPLの割合はどのくらいでしょうか？
GMが7割、PLが3割って感じですね。
&syachi テキセとボイセの割合はどんな感じでしょう？
完全テキストセッションが主流で8割くらいでしょうか。
ボイスセッションにも参加することはあります。
&br
テキセの方がロールプレイがしやすいので自分が主催するときはテキセにしますね。

&syachi ソード・ワールド2.5との出会いを教えてください。
TRPGを始めたのは高校生の頃でした。
当時もCoCが流行っていて、友達に誘われて遊んだのがきっかけです。
&br
その後、TRPGに詳しい友達がソード・ワールド2.0を勧めてきて、ソード・ワールドに出会いました。
そして何年か遊んでいるうちにソード・ワールド2.5が発売されて、飛びついた感じです。
&br
もともとファンタジーが好きだったのですぐにハマりました。
&syachi もともとファンタジー好きだったのですね！ &br ファンタジー作品で好きなものとか、ファンタジーにハマったきっかけとか、教えてください。
ダークファンタジーものが好きで、ウォーハンマーが特に好きですね。
&br
ハマったきっかけとしては母がドラクエが好きだったことでしょうか。
ドラゴンクエストやファイナルファンタジーを遊んできました。
&br
ドラゴンクエストのスピンオフ作品である「トルネコの大冒険」でダンジョンに潜ってお宝を探したのが、ソード・ワールド2.5の世界観とマッチしていますね。
&syachi トルネコの大冒険というのは「不思議のダンジョン」なんですね。 &br ランダムに地形が変わるダンジョンを潜ってお宝を手に入れるの、楽しいですよね……！ &br （しゃちほこ丸はポケモン不思議のダンジョンで遊びました。）

&1 オリジナル大陸について
&syachi では本題ということで、オリジナル大陸として作成していらっしゃる「クレメリア大陸」について教えてください。 &br まずはオリジナル大陸を考えてきっかけはなんだったのでしょうか？
ルールブックIIでケルディオン大陸という、自由に設定を作れる大陸が出たことが衝撃的でした。
&br
オープンワールドな世界を作ってみようって気持ちで始めました。

&syachi なるほど。しかし「大陸」とはすごいですね。1つの都市とか、大きくても地方とかならわかるのですが、大陸を作ろうってのは規模が大きいですね……。
自分で何かを作るのが趣味で、もともと世界観を考えるみたいな経験もあったので、自信はありました。
イメージがあったので、これをどう表現していくかって感じでしたね。
&syachi ふむふむ。もともとイメージがあったのですね。
そうですね。
クレメリア大陸の地図があるのでぜひ見てください。
&img_/other/dagon/cremelia.webp,クレメリア大陸の地図
こちらが地図で……
&img_/other/dagon/cremelia_region.webp,クレメリア大陸の地図
こちらが地方ごとの図です。
&syachi おおお〜。以前も見せていただきましたが、やはりすごいですね……。地図があるとイメージが膨らみます！ &br 地方が分かれているのもいいですね〜！！ &br &br ちなみに何ですけど、こちらの地図はどんなツールで作ってるんでしょうか？
Clip¥sStudioってアプリと板タブ（板型ペンタブレット）ですね。
&syachi なるほど。板タブいいですね〜。 &br &br では、クレメリア大陸を作っていくにあたって、拘った点や苦労した点について教えてください。
大陸はばっと作れましたが、大陸を埋めていくのは苦労しました。
そこでまずは大事な街を3つ決めて、そこからお話を作っていこうという流れで作りました。
&br
クレイマリーポートは港町であり、他の大陸との交流がある都市にしました。
こうすることで、「クレメリア大陸で遊ぼう！」って言ったときに、アルフレイム大陸やテラスティア大陸のキャラクターも連れてこれるようになり、オリジナル大陸で遊ぶハードルが下がったと思います。
&syachi なるほど。ハーヴェスみたいな感じですね。
そうですね。
&br
首都エレビスはもともとエルフが支配している土地で、周辺部族が流れ込んできた……みたいな設定になっています。
これはSW2.5における差別意識・民族対立に踏み込むキャンペーンを書きたいなと思って作った街になります。
&syachi なるほど、興味深いですね。 &br ラクシアはいろんな種族がいますし、ナイトメアやアルヴみたいに穢れがある種族は差別を受けるって公式に言われてますし……。
そうなんですよ。
&br
レドリックは30年前まで内戦していた地域です。
こちらは「しがらみや跡地を使って、アウトローチックな冒険をしてみたい！」というキャンペーン用に作った町になります。
&syachi なるほど。どの街も魅力的で面白いですね。 &br 他のゲームジャンルと比較すると、TRPGはどこの街からも物語が始まるという特徴があると思います。 &br その辺で意識したこととかあるんでしょうか？
あくまでも舞台を提供する側で、物語を提供する側ではないので、そこまで難しく考えないでいいかなという感じです。
&syachi なるほど！ &br 確かにそうですね〜。 &br &br 大陸を作るとなるとモチベーション維持なども難しいと思うのですが、その辺はいかがでしょうか？
モチベーション維持では苦労していませんね。
どんな人、どんな国家関係などを想像しながら街を配置していく、想像力を働かせている場面はとにかく楽しいんです。
&br
楽しいことを想像していると筆の進みって早くなるじゃないですか。
楽しいことを想像しているって感じです。
&syachi なるほど。楽しめるのが一番ですね。 &br 大陸を作るということで、街についていろいろ伺いましたが、神格なども作っていらっしゃるんですよね？
そうですね。
&br
クレメリア大陸の信仰には特徴がありまして。
クレメリア大陸では古代神よりも、その地を救ってくれた英雄を信仰することが多いです。
&br
アルフレイム大陸ではキングスフォールでは鉄道神ストラスフォードを信仰する人が多いですが、そんな感じです。
&syachi なるほど！ &br 面白い特徴ですね。 &br &br あとは流派も作っていらっしゃいますよね？ &br 流派は結構バランス調整なども大変じゃないですか？
流派についてはバランス調整などは構築が上手い人に相談するようにしています。
GMをした縁などで、お願いしている感じですね。
&br
公式より強くなりすぎず、使われないこともないようにしていますね。
使う人があってこその流派データなので。
&syachi オリジナル技能やオリジナル種族などの予定はあるのでしょうか？
今考えているのは、以前ツイートしたオリジナル技能ですね。
前衛技能ってまだまだできることがあるんじゃないかって思っていて、ベルセルク・アサシンという2つを考えています。
&br
あとはオリジナル種族もゆくゆくは……って感じですね。
&syachi あ、ベルセルク技能ありましたね！！ &br あれめっちゃ推しなんです。 &br &br では改めて、オリジナル大陸を作る魅力について、教えてください！
やはり自分で舵取りができることですね。
自分で何かを作りたいという欲望はどこかしらにあります。
それを遊んでもらえるのはそれ以上ない喜びなんです。
&br
私が作ったクレメリアという舞台にこんなの入れたらいいんじゃないかなっていう人がいるんです。
自分の作った世界に関わろうとしてくれるのが嬉しくて。
&br
自分が作ったものを認められている感じがして凄くいい気分になります。
&br
自分で好きに物語を組めるのも良いとことです。
&br
めちゃくちゃな大陸で、大破局で蛮族に唯一勝ったという記録があるのがこのクレメリア大陸の重要な設定なんですが、ではなんで文明が大破局を受けたアルフレイム大陸などと同じレベルなのか。
それは大破局で勝って蛮族から大量のお宝をゲットし、それをどうするかって話になったんですね。
そこに魔術師に化けた悪い魔神が「異界の門を開いて管理しよう」と言い出して、帝国が異国に飲み込まれ大混乱に陥っちゃったって設定なんです。
&br
だから魔神への恨みがより強いんですね。
&br
そういうところでオリジナル性が出てくるんです。
&br
どっか違う物語を入れることで、公式とはまた違った楽しみが出てくる、そういうところが魅力です。
&br
オリジナル大陸を作ることで、個人個人が大事にしているものが出てきてSWの世界が広がって面白いんじゃないかって思ってます。
クレメリア大陸が本になれば間違いなく革命になると信じています。


&1 人を集めるコツ
&syachi Dagonさんはクレメリア大陸を作って終わりではなく、TwitterやDiscordでメンバーを集めて、クレメリア大陸でのセッションを一緒に遊んだり、一緒に大陸設定を詰めて行ったりしていて、とてもすごいなって思ってます。 &br 人を集めるコツというか工夫しているところというかを教えてください！
まずは積極的にGMをすることですね。GMをしてセッションの募集を出せばソード・ワールド2.5で遊びたい人が集まってきます。
その上でセッション後などの時間に、「こういうことやってて、よければどうですか？」みたいに誘っています。
&br
世界を作ることに関われるってことで、ノってくれる人が多いですね。
TRPGをやってる人ってクリエイター気質な方が多いんだと思います。
&br
まずはソード・ワールド2.5を楽しんでもらって、その上で誘うってことを大事にしてますね。
&syachi GMをするって結構ハードルが高くて、躊躇ってる人も多い印象なんですよね。 &br GMをする魅力を教えてください！
自分の世界を作ることができるのが1番の魅力ですね。
名も無い村は公式が用意しているわけではないので、自分で用意することができます。
&br
自分で物語を作るのは面白いですよ。
そして、そんな自分の物語に挑んでくれるんです。
&br
罠をどうするか、別れ道をどうするか、見ているだけでワクワクします。
&syachi わかります！ &br 僕もGMをするときの楽しみはそんな感じですね。 &br &br 何度もGMをしていると準備は大変じゃないですか？
CCFOLIAは凝らなくてもいいんじゃないかなって思ってます。
誰でも回せるようにするのが大事なんじゃないかなって。
&br
ただ、モンスターのドット絵などは用意するようにしていますね。
&syachi 絵が描けるのっていいですね……！

&1 絵を描く
&syachi 絵を描けるのってすごく良いなって思うのですが、始めたきっかけはなんかありますか？
絵を描くのはもともと好きでした。
&br
TRPGを初めてやった頃はフリー素材に便利なものがなかったので、とりあえず描いてみようって感じでしたね。
&br
フリー素材を探してもイメージしているものと違うことがあるので、なら描いてしまうかって感じで描き続けてます。
&syachi なるほど、努力の賜物なんですね。
そうですね。野球みたいな感じで、毎日やってると上達します。
&br
上手い方ではないが、好きと言ってくれる人がいて、それが幸せです。
自分の絵に誇りを持てるのが大きなアドバンテージですね。
&br
やらないんじゃなくて、やるのが大事だとここ数年は思っています。
&syachi ほんとそうですね。僕も機会があれば挑戦してみます！

&1 シナリオ公開
&syachi DagonさんはTALTOにいっぱいシナリオを公開しているのもすごいなと思ってまして。 &br おすすめシナリオとして紹介させてもらってもいるのですが、シナリオについて、作るコツなどを教えてください。
TALTOについてはすでに300人も見てくれていて、好評みたいで嬉しいですね。
初心者のシナリオを流したので、ちょっと難しいシナリオも作りたいなって思ってます。
&br
作るコツとしてはまず、モンスターを見て、ボスを決めるってところから始めています。
&br
あとはIF文でYes/Noの選択肢2つを作って、それをいくつか繰り返すことでシナリオを作るんです。
そのくらいで十分シナリオになります。
2つの選択肢を意識して描いてみると簡単で面白いかなって思うのでおすすめですね。
&br
選択肢は、道の左右・アイテムの有無・罠をかわすか解除するかなどなど。
IFの分岐を考えると物語を作りやすいかなって感じです。
&syachi なるほど。 &br 分岐を考えて作っていくの、良いですね！ &br &br 僕は結構「公開用に執筆する」ことが大変だなって感じるんですけど、その辺はいかがでしょうか？
執筆は大変だとは感じないですね。
誤字が多いので確認するのが大変ですが、書き上げていく段階でも苦労することはないです。
&syachi それは良いですね……！
&br
&2 関連ページ
&button_/sw25/forbeginner/scenario

&1 雑談コミュニティ
&syachi 1年以上前ですが、僕がTwitterでセッション募集用のTwitterコミュニティを作成した際、雑談用をDagonさんが作ってくださいました。 &br 雑談コミュニティを作ったきっかけなど教えてください！
力を抜いて話せる場所を作りたいっていう思いで作りましたね。
&br
いろんな企画が出たりして面白いと思ってます。
初心者の人にいろいろ伝えて欲しいなって。
&br
アビスボーンの略し方だけで色々出てきたのは面白かったです。
&syachi アビスボーンの略し方、話題になってましたね……！
&br
&2 関連ページ
&button_/sw25/tool/community


&1 アルヴ
&syachi あと忘れてはいけないのは、Dagonさんはアルヴの大ファンということですよね。 &br アルヴの魅力を教えてください！
まずはOPBでの事前情報で出てきた公式立ち絵がすごい可愛いかったんです。
黒目という珍しさもあって。
&br
設定もなかなか面白いんですよね。
吸血鬼がハルーラ様に導かれてってところが。
&br
ソード・ワールド2.0に出てきた蛮族「ラルバ」と違って人族になったというのが面白いですよね。
&syachi 巷では「弱い」という評価も多いようですが、どうなんでしょうか？
種族特徴が使いづらいから言われていると思うが、凄く面白いですよ。
器用・敏捷・筋力・知力が高いので、魔力撃と凄く相性が良いんです。
&br
生命・精神抵抗が下がるが、そもそもが低いのでデメリットにならないんです。
&br
だからピーキーな超火力アタッカーができます！
やられる前にやる、玄人好みなアタッカーができるのが凄く面白いんです。
&br
あとは弓を持つのも凄く強いですね。
弓は筋力ボーナスが大事になってくるじゃないですか。
そこで威力の確保ができるんです。
&br
知力が高いのでセージと相性が良くて、狩人の目と相性が良いんです。
&br
アタッカーとして使うとこれほど面白い種族はないなと気づかせてくれたのがアルヴですね。
&br
吸精がRPで生きる種族特徴で、誰かに頼らないと生きていけないという種族なので、必然的にPTでの関わりが発生するのも良いところです。
人と関わるRPがTRPGの魅力だと思うので、これほど向いている種族はいないと私は思うんです。
&br
SWは1人でやるわけではないので、誰かと助け合うのが魅力ですから。
&syachi 弓アルヴ、なるほどですね。 &br ロールプレイが自然と発生するのは確かに最高ですね。 &br 最新サプリメント『アーケインレリック』でもちょっと強くなったんですよね？
そうなんです。アーケインレリックでも強化されたんです。
&br
秘宝が強くて、ドレイン攻撃が可能になったので、すごいです。

&1 Dagonさんにとってのソード・ワールド2.5の魅力
&syachi 本日はいろいろとソード・ワールド2.5への愛を語っていただきました。 &br 最後にDagonさんが考えるソード・ワールド2.5の魅力を教えてください！
「ファンタジーの世界で生きることができる」のが魅力だと思っています！
&br
いろんな種族がいて、人間以外の種族になってラクシアっていう世界を生きることができるのが魅力です。
&br
1人の冒険者である以前に、1人の市民であるってことを大切にしています。
ラクシアって世界で生きる1人にすぎないってことが大事なことだと思っているんです。
&br
英雄譚ではなく、1人の人間として生きていけるのが魅力です。
もちろん英雄を目指してもらってもよくて、私も『デモンズライン』を攻略した時はコルガナ地方の英雄になりました。
&br
それぞれのシナリオ・キャンペーンでいろんな人間の在り方ができることが、TRPGの魅力で、ファンタジーではソード・ワールド2.5の魅力なのかなって思います。

&syachi ありがとうございます！ &br 最後に、ここまで読んでくれた人に何かあればお願いします！
読んでくださりありがとうございます。
興味を持ってくださった方は &link_https://twitter.com/DagonUnder6Feet,文盲のDagon までお願いします。
クレメリアの門は広いのでどなたでもお待ちしております。
&syachi ありがとうございました！ &br クレメリア大陸で遊んでみたい方、クレメリア大陸を作ってみたい方、ぜひDagonさんに連絡してみてください！！
&button_https://twitter.com/DagonUnder6Feet 文盲のDagon（Twitter）

`

</script>