<template>
    <PagesFav>
        <CardArrayByAndml :andml="andml1" />
    </PagesFav>
</template>

<script setup lang="ts">
const andml1 = `
&1 ゲスト紹介
今回はゲストとして &em_DKP さん（ &link_https://twitter.com/DKP71603706,@DKP71603706 ）に来ていただきました。
&br
DKPさんは &em_「ナラティブソドワ」など面白い挑戦を多々 しています！
さまざまな取り組みについて、いろいろ聞き出していくのでぜひ最後までお読みください！
&br
&em_シナリオを無料公開 しており、これらはおすすめシナリオとしてこのサイトでも紹介しています。
&button_/sw25/forbeginner/scenario
&br
そして、この夏にソード・ワールド2.5同人シナリオ集「冒険者の旅路」を出します。
こちらのシナリオ集、僕もシナリオを2本寄稿させてもらいました。
&button_/sw25/feature/c102
&br
そんなDKPさんに、ソード・ワールド2.5の魅力をたっぷり伺っていきます！

&1 DKPさんってどんな方？
&syachi ソード・ワールド2.5は月に何回くらい遊んでいますか？
月に6〜7回は遊んでますね。
週に1回はなんだかんだ遊んでます。
&syachi 対面でのセッションとオンラインセッションの割合はどのくらいですか？
オンセ/オフセの割合は8:2です。
ソドワを遊びたいッ！ って人と遊ぶのがオンセの遊び方で、やっぱりこちらの方が多いです。
オフセはコンベンションとかキャンペーンとかで遊んでいます。
&syachi 僕を含め、オンラインだけで遊んでいる人も読者には多いと思います。 &br 対面とオンラインとの魅力をそれぞれ教えてください。
対面でのセッションは、 &em_人の顔が見える ことが何よりも良いです。
小さな表情の変化とか、指の仕草とか、あとはダイスを振る実感ですね。
&br
オンラインは場所を問わないこと、平日夜でも遊べることが魅力的です。
絵やBGMをかけやすいというのも魅力的ですね。
&syachi ありがとうございます。対面も楽しそうですね〜 &br いつか遊んでみたいです。

&1 オンラインコンベンションという遊び方
&syachi ではコンベンションがらみで、先日主催されたオンラインコンベンション「はるコン」について教えてください。 &br オンラインコンベンションは人がいっぱい集まるのが特徴だと思いますが、1人が募集して1卓が立つオンラインセッションと異なり、どのような点が魅力になってくるんでしょうか？
んー、まず一番大きいのは、 &em_見ず知らずの人と遊ぶことが前提にあること かなぁ、と思います。
オンラインセッションにも色々ありまして、野良卓から固定メンバー卓までありますが、オンラインコンベンションというのは、完全に知らない人が集まって、パッと卓分けで（最近は事前卓わけも増えましたが）一期一会を楽しめるという点が良いところだと思います。
（クローズオンラインコンベンションだと、違うかもです。）
&br
もちろん、多くの一般的なイベントと同じく困った方もいらっしゃいますが、 &em_コンベンションだと運営がある程度の対処できる というのが特徴的です。
&br
これに加えてイベントで集まっている熱気、 &em_いわゆるハレというやつ があります。
仰るように、コンベンション（会合）というからには人が集まる必要があります。体感的には2桁ですかね、オンラインだと。
その規模感は「十二星座館殺人事件」とか特殊なシナリオでないと、セッションでは集めないと思います。
&br
オンラインセッションも、一つの形として完成されていますが、 &em_コンベンション特有のワッと人が集まってTwitterやDiscord越しに各々遊んでいる感覚 というのは、特徴的でコンベンションならではのものです。 
&syachi なるほど。確かに大人数が集まり、お祭りのような雰囲気を形成するのはコンベンションならではですね。 &br Twitterでハッシュタグが盛り上がっていたのも楽しかったです。 &br &br オンラインコンベンション「はるコン」ではDiscord上で行われましたが、セッションを超えてRPができるチャンネル「ハルーラ神殿」があったと思います。 &br こちらはどのように思いついたものなのでしょうか。
痛いところを聞いてきますねw
「ハルーラ神殿」ですが、元ネタがございまして、昔に参加したオンラインコンベンションで見たのですよ。
で、その時の雰囲気がゆるふわだったのと、今回のハルーラガイドも比較的ゆるい空気感ですので、親和性があるかなと思い導入してみました。
&br
思った感じで動かなかったのが、大きな課題でしたね。
やはりファンタジーで処理の多いソドワでは厳しかったです。
予定が結構ギリギリなこともあり、僕も直前まで忘れてました（笑）。
&br
次は時間に余裕を持って導入したいですね。
&syachi 個人的にはすっごく好きな取り組みだったので、上手く回るように僕も考えてみます！ &br &br 参考にしたオンラインコンベンションのシステムはなんだったんでしょうか？
ゆうやけこやけでしたね。
&syachi あーなるほど、それは親和性が高そうですね。 &br &br オンラインコンペの運営は大変だと思うのですが、苦労したこととやりがいをそれぞれ教えてください。
苦労したところは......そうですねぇ、GMさんへのサポートでしょうか。
今回の「ハルーラガイドコンベンション」では、コンベンションでGMをされる方、SW25で初めてGMをされる方を集めてGMをしていただきました。
当日に向けてのテストプレイや協議、GM向け資料の作成等が一番苦労しましたね。
（あとGMさん集めるのも大変でした。）
&br
やり甲斐という所では、 &em_新しい卓やコミュニティができるのを見ること でしょうか。
&br
コンベンションで出会ったのをきっかけに、さらにSW25を遊んだり何か買ってもらったり、GMをしてもらったり、新しいコミュニティが出来るのを見届けたり。
そういうのを見て、あぁコンベンション開催してよかった、となりますね。
&syachi やり甲斐を聞くと、やはり布教のためっていう側面が強いんですね。 &br GMができる人が増えることは今後の布教が加速しそうですごく良いと思いました。 &br &br 今度「ソドワオンリーコン」を開催されると思います。この意気込みも教えてください。
来るは来月！ &em_8/27（日）に大阪鳩麦開卓所 でソドワのオンリーコンを開催します！！
&br
今回は &em_清松みゆき先生 をお呼びしまして、GMをしていただきます！ソードワールドを遊ぶぞ！！と盛り上がって開催しますわ〜〜〜！
&br
卓が終わった後は、アーケインレリックについて、軽いトークショーもしていただきます！！
当日の会場にいらっしゃる方は勿論、僕に質問を預けてくださった方は &em_その質問を清松先生にお聞きする予定 です！
&br
現在、14名の方に申し込んでいただいており、枠数も少なくなっております。
もしご興味がありましたら、来ていただけますと幸いです！！
よろしくお願いします〜

&1 ソード・ワールドとの出会いとハマったきっかけ
&syachi ソード・ワールドとの出会いについて教えてください。
ソードワールドの出会いは、いま思うと良いものではなかったですね。
初めてコンベンションに遊びに行った時、座ったのがSW2.0でした。その時はLv7のナイトメア魔法戦士を使ったのですが、そんなものだと思って遊んでました。
&br
後々になって、特にサポートなく専門用語が飛んできてキツかったんだろうなぁ、となんか腑に落ちてなかった理由を把握するようになりましたね（笑）。
&br
ただ、なんとなくそれからもソドワ自体は遊んでいました。
やはり、最初にコンベンションで遊んだTRPGは親みたいなもんなんですわ。
&syachi おお、いきなりLv7の魔法戦士とは……。ルールブックは以前から持っていたんですか？
いえ、そのコンベンションを機に2.0は買った感じですね。完全版は持っていましたが……。
&syachi そうなんですね、、。それは本当にお疲れ様でした。 &br そんな出会いをきった後、ハマったきっかけはなんだったのでしょうか？
ガッとハマったキッカケはオンラインでしたね。
ずいぶん昔、ソドワ感謝祭というコンベンションで気持ちの良い卓に座りまして、その後ちょっとキャンペーンで遊ぼうか、とオンラインで遊び始めたのがキッカケだと思います。
&br
今もなんだかんだ遊んでいて、半年に一回ぐらい、ふと"遊ぼう"と連絡が飛んできたりします。
もう5年ぐらいになるのかな？キャラシ紙で提出だったり、どどんとふの使い方を教えたり、今のオンラインと比べると、アナログでした。
色々と思い出があるものです。

&1 ナラティブソドワ
&syachi 先日、僕も参加させていただいた「ナラティブソドワ」について、思いついたきっかけと魅力について教えていただけますか……？
ナラティブソドワ！！ 良い質問ですね。
&br
元々のきっかけとしては「ダンジョンワールド」を遊びたいなぁというものでした。
海外のシステムなのですが、有志の方が翻訳してらっしゃって、とても楽しいシステムなんですよ。
&br
これが4月頃だったのですが、ある方と話してて &em?ソドワの新しい遊び方の一類型として発展させてみると良いんじゃないか？ 　という天啓が降りてきました。
あと「ダンジョンワールド」だとあんまり人が集まらない問題があったのですが、ソドワというと人が集まるので、それに乗っかる意味もありました。
その時期は &em_ハンドアウトソドワとか、ヘックス戦闘ソドワとか様々な変形を考えていた んですが、ナラティブが結局、一番やりやすかったのでナラティブソドワを試験第一号として採用した感じになります。
&br
魅力としましては、 &em_PLの設定や信仰に合わせて敵を作れたり、世界がそのまま拡がったりする ところですね。
一般的なキャンペーンや、あてがきシナリオでも同じことが言えますが、ナラティブソドワはその場の空気や雰囲気とかが大きいです。
&br
あとGMがシナリオを用意しなくても、良いということが魅力的です。
&syachi なるほどー。他のシステムから着想を得たんですね。 &br ナラティブというのはアドリブとは違うのでしょうか？
アドリブとそう変わらないものではありますが、 &em_あくまで選択権や主軸がPLというのが大きな違いであり、魅力 です。
&syachi シナリオが無い「ナラティブソドワ」ですが、以前遊ばせてもらった時には敵に様々な裏設定があったと思うのですが、その辺はパパッと裏で作り込んでいた感じなんでしょうか？
うーん、そうですね。前回はあまり作っていませんでした。
今のところ、ナラティブソドワでは第1話は完全にその場で作る、というルールでやっております。
その中で出てきた単語やキーワードから &em_敵背景設定や、街の景色、世界を形作っていく という形式です。
&br
ナラティブソドワは「シナリオ」は作らないものの、 &em_世界やキャラクターは細かく作ろう 、となっております。
そこさえ出来ていれば、自然とPCの動きに合わせてセッションが形作られていくんですよ。
&syachi ふむふむ。パッと世界やキャラクターを作るのは少し難しそうです。 &br &br ナラティブソドワを回す時のコツとかって公開する予定あったりするんでしょうか？
&em_予定はあります ね。
今、ナラティブソドワを金曜日隔週ぐらいのペースで遊んでいるのですが、それのリプレイと一緒に公開しようと思ってます。
&br
まぁ、来年の春ゲムマか、秋ゲムマぐらいの頃ですかね。
&br
無料か有料かは悩み中です。
&syachi リプレイと一緒は心強いですね。 &br 僕もナラティブソドワ回してみたいな〜とは思ってます。 &br どこまでプレイヤー主導にできるかは未知数ですが、頑張ってみます。

&1 シナリオ10本無料公開？
&syachi 次にシナリオについて、今年は10本を無料公開予定とのことで、すでに何本も公開していると思います。このシナリオ公開の意気込みについて、理由などを教えてください。
シナリオ公開についてなのですが、わりとノリと勢いですね（笑）。
最初、去年末に発売された &em_「ハルーラガイド」を使ってシナリオを書いてみよう ！！　っていう実験作から始まってます。
&br
まず書いてみて、その後、自力で書いたシナリオと比較してどう変わったのか観察ですね。
&br
ただ、ちょうど今年の夏コミでシナリオ頒布する予定なことを合わせて考えると、名刺として無料公開されてるシナリオは必要だろう、と思い至りました。
で、どうせ無料公開するなら一本二本とちまちまやるんでなく、 &em_10本どーん、とやってしまおう という感じです。
&br
シナリオなんて質より量を書いて、その中から良い質のものを引っ張り出すだと思っておりますので。
&syachi なるほどです。ぼくももっと数を書いていきたいですねー。 &br &br シナリオを自分で回すように作るのと公開用に作るのではいろいろと気をつけるところが変わってくると思います。 &br 公開する際に意識していることを教えてください！
&em_公開する時は、ちゃんとPL向けの描写を書くように しています。
それと、 &em_GMに向けてシナリオの背景設定を細かく伝える ことですね。
&br
やはり、自分以外の人間が回せるように、となると自分内で固まってる設定とか、雰囲気とかを伝えるのが大事です。
&br
なので、魔物の数とか、シーンの繋ぎ目とかより、背景設定、PLに見せたい描写をよりきちんと描くようにしています。
&syachi 背景設定を細かく伝える、たしかに大事ですね！
&br
&2 関連ページ
&button_/blog/harula
&button_/sw25/forbeginner/scenario

&1 AIを使ったシナリオ作成
&syachi この公開したシナリオの中ではChatGPTなどの文章生成ができるAIを使ったシナリオ作成に挑戦した作品がいくつかあると思います。 &br ChatGPTなどのAIによるシナリオ作成はいかがでしたか？
うーん、結論からいうと、良いシナリオは書けませんでした。
&em_AIがシナリオを書くのはまだ早い ですね。
3作品ほど書かせてみたのですが、 &em_描写とかストーリーがどうしても平坦になってしまう んですよね。
&br
それにシナリオとしても「遊べるだけ」であって、 &em_シナリオ作者の色 みたいなものが出ないのも厳しいです。
&br
逆に名前の決定や、トラップのアイデア出しなど、 &em_ストーリー本編に関わらないことに関しては、上手く出力してくれます 。
&br
元々、ある程度chatGPTの仕組みは知っていたので、良い結果にはならないと思っていました。
ただ、やはりやってみないと人に言う時に説得力がないので、やってみないと、という勢いでしたね。
&br
「馬鹿と鋏は使いよう」という諺もあるように、そのツールに適した使い方をするのが一番です。
TRPGのシナリオ作成において、 &em_AIはまだまだ補助的使い方が良い 、という印象ですわ。
&syachi やはりまだ早かったですか……。 &br TRPGシナリオの学習はまだまだ進んでないでしょうし、AIがシナリオを作る時代はもう少しだけ先になりそうですね。
&br
&2 関連ページ
&button_/blog/chatgpt
&button_/blog/chatgpt-syuzoku

&1 加除式図書型シナリオ集！？
&syachi シナリオといえば、同人シナリオ集「冒険者の旅路」をC102で頒布予定ですね。 &br こちらを合同誌として計画した経緯や理由を教えてください。
はーい。
合同誌として計画した経緯ですが、なんか出したい本がございまして。
&em_加除式図書型シナリオ集（仮） と読んでいるのですが、平たく言うと「自分だけのシナリオ集セット！」みたいなものですね。
&br
当初から構想がありまして、これを目指して作っていこう！！　というのが「冒険者の旅路」の企画趣旨だったりします。
&br
で、じゃあ誰をお呼びするのか、というところで &em_全然違うコミュニティの、異なる毛色の筆者さん をお誘いした感じです。
ちなみに、しゃちほこ丸さんはtwitterで鳴いてたのを拾いました（笑）
&syachi ふむふむ。 &br 大きなシナリオ集を出すのが目的としてあるから、最初から合同誌にしたってことですね！
最初は自分1人の同人誌も考えたのですが、加除式図書となると、どうしても作品数が多くないといけません。
それなら今後の伝手のためにも合同誌にしよう！！ という意気込みでしたね。
&syachi 今回出す同人シナリオ集「冒険者の旅路」について、魅力を教えてください！
&em_どんな人が手に取っても、遊びたい！！　と思えるシナリオが入っている ことです。
&br
今回は全く違う方向性の作品が7つ収録されていますので、 &em_何かしら好きになれるシナリオが1本はある 、そんなシナリオ集として特色があります。
&syachi そうですね。 &br 「自分に合うシナリオ」に気付くきっかけになったら嬉しいですね。
&br
&2 関連ページ
&button_/sw25/feature/c102
&button_/scenario/fukinotou

&1 世界観の考察
&syachi もう一つ聞きたい活動がありまして、Twitterのスペース機能を使ってソドワの考察とかされていることも多いかなと思うのですが、スペースを開くことで得る気づきとかメリットとか教えていただきたいです！
そうですねー。一番大きいのは、 &em_色んな人のラクシア解釈 が聞けることですね。
&em_人の数だけソドワがあって、人の数だけラクシアがある。 
皆さんのラクシア観はそれぞれがそれぞれの素晴らしい箇所を有しているので、幅広くそういった”世界観”を覗えるのが利点として大きいです。
&br
次に、 &em_知らなかったり見落としてる記述を聞ける ことですね。
例えば冒険者ギルドってどうなってたっけとか、犯罪の処罰ってどうなってたっけ、とか。
冒険者ギルドでは「冒険の紋章」が発行されるとか、各地方ではこうして犯罪者を裁くとか、色んな知識を教えてもらいました。
&br
集合知というのは、やはり偉大です。
&syachi なるほど〜！ &br いろんな人の意見が聞けるというのは、DiscordなどよりオープンなTwitterのメリットですね！

&1 DKPさんにとってのソード・ワールド2.5の魅力
&syachi DKPさんはオンラインコンベンションや「冒険者の旅路」について聞いていると「コミュニティを広げる」ことに尽力されているように思います。 &br &br また、「ナラティブソドワ」や「スペースでの世界観深掘り」ではソドワの楽しみ方をいろいろ研究されているようにも思います。 &br &br そんなDKPさんにとっての、ソード・ワールド2.5の魅力ってなんなのでしょうか？
①世界観が純国産らしいこと
②技能の組み合わせが無数にあること
③定期的にサプリメントや企画が成立する事。
&br
大きくはこの3つですね。
&br
①が一番大きいです。
&em_ソードワールド2.5の魅力は世界観そのもの だと思っています。
滅んだ魔法王たち、いきなり発生した大破局、今日明日も生きれぬ冒険者たち。
&br
&em_誰でも遊べる 、いわゆるテンプレート的な世界でありながら、 &em_同時にヘビーユーザーも虜にする 引き出しを無数に持っている。
国内ファンタジー作品では、ソードワールド2.5しか持っていない魅力だと思っています。
&br
②についてはその通り、やりたいキャラクターを技能を割り振る事で表現できる事です。
D&Dやアリアン2eなどだと、どうしても役割に特化しがちなんですよ。
聖騎士とか盗賊とか、魔術師とか。
&br
ソドワはその判明、技能テーブルと経験点割り振りシステムを採用しているため、ファイターだけどセージも持ってる、魔法が主だけど拳で殴ることもできる、みたいな &em_可能性が提示 されています。
&br
もっぱら強い弱いという話があり、どうしても皆スカウト・セージを取ってレンジャーは余物という話もあります。
ただ、それはそれ。
強いか弱いかはどうしても、話題の中心になりがちですが、 &em_ソドワで良いのは可能性を残していること だと思ってます。
&br
キャラに合わせて技能を調整できる＝可能性を残している、というのが好きな部分です。
&br
この前、発売された &em_アーケインレリックで［希少種］が追加された のも好ましく思っております。
この種族でこのキャラがやりたい！！　とか多かったでしょうし。
&br
③については、論ずるまでもないですね。
やはりSNEを引っ張る金字塔、ゲヘナアナスタシスとかロードス島戦記とか、昔のシステムと比べると話題性がありますし、今の人が入手しやすく、遊ぶのに誘いやすいです。
&br
これらが僕にとってのソード・ワールド2.5の魅力になります。
&syachi ありがとうございます！ &br 最後に、ここまで読んでくれた人に何かあればお願いします！
この記事を見てソドワに興味を持った貴方！！
&em_連絡くれたらソドワのGMしますよ。
なんならPLも集めちゃいます！
&br
いっしょに遊びましょう！！（ &link_https://twitter.com/DKP71603706,@DKP71603706 ）
&syachi ありがとうございました！ &br 僕自身も改めていろいろなソード・ワールド2.5の魅力を知る機会になりました。

`

</script>