<template>
    <PagesFav>
        <CardArrayByAndml :andml="andml1" />
    </PagesFav>
</template>

<script setup lang="ts">
const andml1 = `
&1 ゲスト紹介
今回はゲストとして &em_ハリィ さん（ &link_https://twitter.com/swrpglove,@swrpglove ）に来ていただきました。
&br
ハリィさんは &em_ソード・ワールド2.5のルールブックの販売 をしており、なんとハリィさんのお店でルールブックを買うと &em_GMをしてもらう ことができます！
「ルールブックを買ったけど遊ぶ人がいない」そんな悩みを解決する素敵な取り組みです。
&br
そんなハリィさんに、ソード・ワールド2.5の魅力をたっぷり伺っていきます！

&1 ハリィさんってどんな方？
&syachi ソード・ワールド2.5は月に何回くらい遊んでいますか？
ソードワールド2.5、発売当時は2～3日に1回はGMやってました。
オンラインです。
&br
最近はほんとにできなくて・・・1か月に1回あるかないかですね。
なるべく1回のセッションで終わるような短い単発のセッションばっかりです。
&syachi そうなんですね。僕も同じような感じです。 &br &br GMをしていた、ということですが、ほとんどPLはしていない感じでしょうか？
はい、当時はGMをされてる方とは、なかなか知り合えなくて。
&br
&em_誰もいないなら、自分でやろう♪ って感じでした。
&br
旧SWの時（30年前！！）はオフラインでGMしてたので、あんまり抵抗はなかったです。
&syachi GMを見つけるの、大変ですよね。

&1 GMの楽しさ
&syachi GMをすることの良さをGMしたことない人に伝えていただけますか？
自分の場合は・・・ですけど、
&br
&em_「遊びたいのに、一人では遊べない！！」って言うのがTRPGの一番の難関 だったりするので、
結果的にその難関をクリアにしてると、
自然に感謝されて、
知り合いも増えて、
&em_自分が遊びやすい環境が整っていく ・・・って言うのが、良かった事だったな～って思います。
&br
あと、この感覚は自分独特なのかも知れませんが・・・
&br
&em_一緒に遊んだPCが成長していくの、見ててすごく楽しい です。
セッションが終わった後に、成長したPCのキャラシート見ながら飲むお酒、すごくおいしい（笑）
&br
あ、お酒は絶対に二十歳になってからですよ！？
&br
話を戻すと、
同じメンツで遊ぶキャンペーンもそうですが、
野良卓でも、以前遊んだことあるPLさんが
「ハリィさんのGMだったら、以前作ったPCでまた参加させよう。お、ちょうどレギュレーションが合うPCがいるぞ？」と、
成長したPCで参加してくれることが何度もあるんですね。
そういうのが本当に嬉しくて。
&syachi あーーーなるほど！ &br それは楽しそうですね。自分のPCの成長とも少し違う親目線というか祖父母目線というか、、。

&1 ハルーラガイドについて
&syachi さて、ではGMつながりで、昨年12月に頒布開始されたゲームマスターズアーカイブ ハルーラガイドについてお聞きしたいと思います！ &br ハルーラガイドは簡単に言うとどんな同人誌で、どんな方に読んで欲しいと言う感じですか？
&em_GMを始めたばかりの方、始めようと思われている方をサポートするために作られた本 になります。
&br
シナリオ集だけでなく、執筆者のGM達が「自分はこう遊んでます」「こうするとスムーズですよ」といった、 &em_コラムも収録されている のが特徴です。
&br
もし興味を持ってくださる方がいたら。
ハルーラガイドの冒頭にある製作総指揮のたかはるさんの挨拶を見て頂けると、より分かるかしら？
&br
リンク、貼っておきますね☆
&link_https://harryharry.base.shop/blog/2022/12/15/170300,https://harryharry.base.shop/blog/2022/12/15/170300
&syachi 僕も持っていますが、ほんと素晴らしい本ですよね。
いやはや、そういって頂けると本当に嬉しいです。
有り難うございます！！
&br
※ハルーラガイドの電子書籍はBOOTHで販売中です。
&link_https://cinderellarats.booth.pm/items/4489031,https://cinderellarats.booth.pm/items/4489031
&br
&2 関連ページ
&button_/blog/harula
&button_/blog/harula2

&1 ルールブックを買うとGMしてもらえるサービス
&syachi さて、ハリィさんといえばECサイトを運営して &em_ソード・ワールド2.5のルールブックの通信販売 をしていますよね。 &br こちら、 &em_購入サービスとしてハリィさんがGMをしてくださる ということで、「ルールブックを買ったけど遊ぶ相手がいない」を解決してくれるすばらしいお店だと思います。 &br &br この取り組みを始めたきっかけや大変だったことについて教えてください！
きっかけとしては、２つあって。
&br
1つは単純に、子供の時からお世話になっているグループSNEさんに対して &em_書籍を買う以外での応援、恩返しをしたいなあ と思ったことがきっかけです。
&br
とにかく、遊ぶ人口が増えない事にはやっぱりそのシーンにはお金が回ってこないし、クリエイターの方たちが新しい作品を作れません。
こういうことをやってる人がいるって、知ってもらえると、もっとセンスのある人が色々とアイデアを出して自分よりも上手にシーンを盛り上げてくれればなぁと。
Twitterでは、（グループSNEの）代表の安田均さんからも褒めて頂けたので、やってよかったな～と思ってます。
&br
２つ目はハルーラガイドの宣伝のためでした。
ハルーラガイドの制作を始めたころに、たかはるさんに製作費の事を伺ったんです。
そうしたら、印刷部数100冊を全部売り切っても赤字という話で。
&br
GMをサポートしようとしてる優しい本なのに、たかはるさんだけが赤字に終わるのはなんかモヤモヤするな～と。
一緒に遊ぶ友達の中で、こんな優しい人がいるのは嬉しかったので。
&br
きちんと予算を回収できるようにするためには増刷や電子書籍。
それまでに、この100冊の売れ方自体をドラマチックにして、ちょっとしたニュースにしようと。
&br
必要な人は絶対にいるでしょうし、後はその人たちまで情報を届けて、購入するまでのハードルを下げないと・・・
&br
&em_手に取ってもらえる確率を1％でも上げたかった んです。
&br
無償で良いので、販促活動は手伝わせてほしい、ある程度自分単独で動くことになるかもだけど・・・と思ってサイトを作ることにしたんです。
&br
まずはコミケ未経験・同人誌制作初参加の自分の知名度を上げて、
自己紹介をしつつ、ハルーラガイドの通販はこの人なのね？
あ、ルールブックも置いてるし、一応ちゃんとお店になってるのね？
って認識してほしかったんです。
&br
ニコニコ動画のラジオで肉声や本名を出しているのも、それですね。
&br
お陰様で、通販の予約は1日で50冊がソールドアウト。
そして、コミケ当日にご用意していた本50冊＋予備の分もソールドアウトでした。
&br
更に50冊増刷された書籍版も、ご予約分だったり、イエローサブマリンさんにも委託販売して頂いて完売。
電子書籍は、8月3日時点で90部ご購入いただいているみたいです。
&br
これはしゃちほこ丸さんを始め、多くの方がSNSで拡散して下さったり、感想を沢山発信してくださったおかげでもあるので、本当に感謝しています。
この場を借りて、お礼をさせてください。
有り難うございました。
&syachi ふむふむ。ハルーラガイドがかなりのきっかけだったんですね！ &br たかはるさんもハリィさんも全力で取り組んでてすごいです。 &br ソード・ワールド2.5を好きな想いがめちゃくちゃ伝わってきました。
そうなんです。割と何かを始めたり作ったりするときに、やりたかった事、好きな事、色んなことを巻き込んで組み立てるのが好きみたいですね。
欲張りなんですｗｗｗ
&syachi ルールブックを購入するとGMをしていただけるとのことですが、これは日程調整などさまざまな負担があると思います。 &br 大丈夫なんでしょうか？
そうですね・・・時間の面で言うと。
自分の日中の会社の仕事が比較的規則正しく予定が組まれていて平日夜は空いてます。
もう一つの自分がやってるお洋服屋さんは完全にアポイント制で、これも毎日お店を開けているわけではないので、自由があるんですよね。
&br
複数人でやるセッションではなく、キャラメイクと何度もやっているソロセッションなら何とかなる感じです。
&br
あとは、ルールブック1冊売れたと時の利益と自分の稼働時間とか考えても、「売れた」って事実が宣伝効果のほうが大きいので気持ち的にも負担みたいのは無いですね。
&br
ここまでは、お仕事の話で。
&br
&em_単純に1人「TRPG遊びたい人が、TRPG遊べた」って事実が嬉しいじゃないですか？
自分は中学生の頃は、周りに誰もTRPG知ってる人がいなくて、自分がGMで友達を集めてやってもなかなか時間が合わなくてフェードアウトの繰り返しでした。
小さい時に、こういうお店があったら親に相談してお小遣い貰ってお店にいって遊んでたな～って。
その時の遊びたい！！って気持ちを補完もしてるんです。
なのでやっぱりずっと、楽しいですねｗｗｗ
&syachi いろいろと調整しつつ、しっかり時間を取ってくださってるんですね！ &br ほんと素晴らしい取り組みですね。

&1 ラジオ
&syachi 先ほども話がありましたが、ニコニコ動画にラジオを投稿しているのも面白い試みだなぁと思っています。 &br ツイートするのではなくラジオで喋るというのはどのような意図があるのでしょうか？
有り難うございます☆
匿名性の高いSNSでのやりとりだけだと、ルールブックやハルーラガイドの通販に抵抗がある人がいるのではないかな？と思いまして。
自分の声、喋り方、雰囲気を知ってもらった方が良いと思ったんです。
&br
X（Twitter）での文章もラジオを聞いてくださった方は、あの雰囲気や声で脳内で変換されればニュアンスとかが割と正確に伝わるような気がして。
あとは単純に文章に自信がない・・・というのもあります（笑）
&br
洋服屋の仕事の方でもインスタで配信とかをしていて、抵抗はなかったですね。
&syachi なるほどです。もともとお店をやってた経験をいろいろ活かしてソドワを広めてくださってるのですね、、！
はい、そうですね☆
&br
今年はDKPさんからsw2.5の同人誌「冒険者の旅路」の通販もお願いされて。
セッションする以外にも、sw2.5に色々関われて楽しいです。
&syachi 冒険者の旅路については本当にありがとうございます！ &br めちゃくちゃありがたいです。
&button_https://harryharry.base.shop/items/76512992 通販はこちら
&br
&2 関連ページ
&button_/sw25/c102

&1 ハリィさんにとってのソード・ワールド2.5の魅力
&syachi ルールブックの販売といい、ハルーラガイドといい、ソード・ワールド2.5を全力で広めてくださっているんですね。 &br 最後にそんなハリィさんの思うソード・ワールド2.5の魅力について、教えてください！
&em_世界観・設定が好き ですね。
思春期の頃はロードス島戦記、ソードワールド短編集を読んでてずっと話を考えてました。
&br
大人になってからしばらく離れていたのですが・・・、sw2.0〜2.5のラクシアの世界観を読んでみたらやっぱり楽しくて。
&br
&em_色々な種族、特徴的な都市国家たち、そしてヒト族と蛮族達の戦い・歴史。
その中の誰かの冒険を作れるって、楽しいし、嬉しいです。
&br
そんなところでしょうか☆ 
&syachi ありがとうございます！ &br 最後に、ここまで読んでくれた人に何かあればお願いします！
最後までお読みいただき、有り難うございました。
楽しんで頂けたら最高です！！！
&syachi ありがとうございました！ &br ソード・ワールド2.5を始めたい方はぜひハリィさんの店「HarryHarry」でルールブックを購入してみてください！
&button_https://harryharry.base.shop HarryHarry

`

</script>