<template>
    <PagesFav>
        <CardArrayByAndml :andml="andml1" />
    </PagesFav>
</template>

<script setup lang="ts">
const andml1 = `
&1 ゲスト紹介
今回はゲストとして &em_たかはる さん（ &link_https://twitter.com/numachipachi,@numachipachi ）に来ていただきました。
&br
たかはるさんは &em_同人誌「ハルーラガイド¥s-ゲームマスターアーカイブ-」 の主催者です！
「ハルーラガイド」は &em_シナリオ5本とGMをサポートするコラム が載った同人誌で、2022年12月の冬コミ（C101）で頒布され、大きく話題を呼びました。
&br
また、 &em_ソード・ワールド2.5初心者向けの説明資料「Welcome¥sto¥sらくしあ！」を無料公開 していらっしゃいます。
&br
そんなたかはるさんに、ソード・ワールド2.5の魅力をたっぷり伺っていきます！

&1 たかはるさんってどんな方？
&syachi ソード・ワールド2.5は月に何回くらい遊んでいますか？
現在はリアルがバタバタしていることもありほとんど遊べていないんですが、ハルーラガイドを制作していた頃は２週に一回、多いときは週1くらいで遊んでいました。
&syachi ボイスセッションとテキストセッションの割合はどんな感じでしょうか？
テキスト¥s+¥s相談や雑談をボイスまたはテキストオンリーが半々くらいです。
喋るの苦手なので、テキストオンリーが1番好きです。
&syachi テキセや半テキセが多いのですね！ &br 対面でのセッションもしたりするのでしょうか？
そうですね、対面のセッションも好きです！
対面は主にリア友とやることが多いですが、過去コンベンションに出させていただいたこともありましたね。
&em_場の盛り上がりに影響されて良い意味で想定外のことが起きるのは、対面の醍醐味 ですよね。 
&syachi GMとPLの割合はどのくらいでしょうか？
半々くらいですかね。
身内とやるときはGMが多めで、身内の外の方とはPLで遊ばせていただくことも多いです。

&1 ソード・ワールドとの出会いとハマったきっかけ
&syachi ソード・ワールドとの出会いについて教えてください。
ソドワとの出会いは2.0でした。
大学時代CoCにどハマりしていた頃に、「TRPGが他にもあるけどやってみる？」とGMさんに教えてもらって、「ファンタジーやりたい！」と言ってソドワのセッションを立ててもらいました。
&syachi 初めはCoCからだったんですね。 &br 最初のセッションはどんな感じだったんでしょうか？
今にして思えば &em_かなりナラティブな卓 でした。
バディ（PL2人）で、相方は蛮族に滅ぼされた小国の姫。身一つで逃げ延び、身分を隠して冒険者になった神官戦士。
姫のわりには現実的でしたたかで臆病です。
&br
自分のPCは、ナイトメアである自分を許せず、穢れを取り除く魔剣を求めて冒険者になった自称人間の女剣士。
表面的にはのんきだけど、正義感と罪悪感、怒りの感情を秘めています。
&br
GMさんは、 &em_設定を拾ったオープニングをすごく丁寧に（一人1時間くらいかけて！）演出してくれて、すっかり没入 しました。
このセッションが出会いであり、ハマったきっかけです。
&br
そのあと興奮が覚めやらず、相方のPLさんがセッションを元に小説を書いてきたんです、1週間後に！
相方さんの姫PCの視点で書かれた文章だったので、じゃあ自分は自分の剣士PC視点で交互に描写したら面白いかなと思って、 &em_交互に書き合っているうちにリプレイ小説が完成 したので、ちゃんと形にして &em_コミケで出してみることに しました。
&br
この時期は楽しすぎて鮮明に覚えています。
&syachi 最初のセッションが良くて、そのままハマったって感じだったんですね！ &br 良いGMさんだったんでしょうし、PLの2人も上手く参加してたからこその最高のセッションだったのかなって思いました。 &br &br そして、改めて &link_https://takahaltrpg.hatenablog.jp/,たかはるさんのブログ を読ませていただいたのですが、その時のキャラクターがアイコン、その時のギルド名が同人誌などのサークル名になってるんですね！ &br なんかほんとに素敵ですね……！
あ、ブログ見てくださってありがとうございます！
恥ずかしながらはるか昔で止まっているんですが……。でも、ときどき見返して当時の気持ちを思い出してます。
&button_https://takahaltrpg.hatenablog.jp/ たかはるさんのブログ
&br
アイコンとサークル名はその通りです！
私のアイコンがその時の自PC、「灰かぶりのねずみ亭」はPCが所属しているギルド支部です。
&syachi 最初のセッションが現在の活動にも大きく影響してるの、とっても素敵ですね……！ &br &br そっからはずっと2.0をやって、2.5に移って……って感じなのでしょうか？
ソドワに出会ったのが2.5が出る直前だったので、ルールの面でいえばほぼ2.5からです。
世界観はずっと2.0でやっていました。
GMにも挑戦して、自卓でやったシナリオを外向けに書き直して公開したりしていましたね。

&1 ハルーラガイドについて
&syachi 昨年の冬コミ（C101）で頒布されたSW2.5の同人誌『ハルーラガイド ゲームマスターズ・アーカイブ』は大きく話題を呼び、多くのソドワファンの手に渡ったと思います。 &br こちらの同人誌について、いろいろ聞かせてください！

&2 ハルーラガイドってどんな同人誌？
&syachi 「ハルーラガイド」を知らない方もこのページを見てくださっていると思います。 &br まずは、「ハルーラガイド」についてどんな同人誌なのか、紹介をお願いします。
はい。「ハルーラガイド-ゲームマスターズアーカイブ-」は、
&br
- &em_初心者GM に向けた、
- &em_シナリオ¥s+¥sマスタリングに役立つコラム集 です。
- シナリオはすべて、 &em_コラムの内容を実感し、練習してもらうために書き下ろした ものです。
&br
シナリオは5本で、それぞれ
&br
-①¥s &em_時短とスムーズな進行 をテーマにしたランダムシナリオ
-②¥s &em_描写文と処理 をそのままなぞってセッションができる &em_「GM慣れ」 のためのダンジョンシナリオ
-③¥s &em_NPCの性格や事件の背景を練り込んでおく ことで、 &em_PLの発想 を拾えるシティシナリオ
-④¥s &em_PLが納得感を得られる選択肢の作り方と提示の仕方 をテーマにしたウィルダネス（自然環境が舞台の）シナリオ
-⑤¥s &em_キャンペーンシナリオ1話の作例 として、 &em_伏線を散りばめたその後の展開がしやすい シナリオ
&br
となっております。
&br
シナリオに関連するコラムのほか、 &em_戦闘バランス調整のガチな解説 や &em_PLのRPを引き出すコツ 等の &em_お役立ち記事を全15本掲載 しています。
&br
&em_「Game¥smaster’s¥sArchive（先人たちの知見）」 として本書に纏め置く事で、 &em_皆様のマスタリングの幅を拡げるお手伝い ができれば幸いです。 
&syachi ありがとうございます！

&3 ハルーラガイドの入手方法
ハルーラガイドは現在、PDF版がBoothで頒布されています。
&button_https://booth.pm/ja/items/4489031 Booth

&2 ハルーラガイドを作ろうと思ったきっかけ
&syachi 続きまして、ハルーラガイドを作ろうと思ったきっかけを教えてください。
ハルーラガイドを作ろうと思ったきっかけですが、最初は &em_C99の冬コミで同じくサークル参加していた神砂わらびさん （サークル:オーク的好奇心。代表作はSW2.5シナリオ集「アルフレイムは爆発した！」） &em_から
&em_「合同誌でなんか面白いことやりましょうよ！」
&em_とお誘いされたのが始まり です。
&br
わらびさんとは以前からコミケで会う同志であったり、卓仲間を通じて誘い誘われの間柄でした。
&syachi 「なんか面白いことやりましょうよ！」って、良いですね……！ &br そして、かなり時間がかかっていると推測していたので、立案から頒布まで1年というのも驚きました……。 &br ここから、どうやって今の形になったのでしょうか？
「コラム+シナリオ集」という形に落ち着くまでにはそこそこ長い道のりがありました。
&br
&em_「せっかくなら役にたつものを作りたいよね」という意識からスタート して、はじめは「舞台を限定しない汎用的なシナリオ集」にして、単発でやってもいいし、皆さんが各自プレイグループでやっているキャンペーンに挟み込みやすいシナリオにしようかと画策したんです。
初期作成〜7や9くらいまでの各レベル帯に合わせたもので。
&br
でも結局、 &em_各プレイグループにはそれぞれの雰囲気があるじゃないですか 。データガチ勢が揃っていて無駄なく効率的に成長していく卓もあれば、ビルディングをキャラクター表現の一要素と捉えていて、非効率的に見える成長の仕方も実は「そのキャラらしさ」として大切にしている卓もあったり。
&br
そうすると、 &em_シナリオ側でエネミーを用意しても、卓によって強くも弱くもなる。
そのとき、GMの意図に反して「思ったより難し過ぎた／易し過ぎた」となると、「せっかくお金出して買ったのに….」と思わせることにもなってしまう。それは避けたかったんです（まぁTRPGは予想外を楽しむものでもありますし、そもそも同人誌なのでクオリティへのスタンスは人それぞれです）。
で、「シナリオ難易度の予想外」を避けるための策として、 &em_「GMさんが自卓に合わせてアレンジできるように指針を作りましょう」という結論 に私達は行き着きました。 
&br
ハルーラガイドのコラムでいうと、 &em_のっちさん・卵生瞬さんの戦闘についての章 ですね。
戦闘難易度の調整については私もわらびさんも「どうにか言語化したいけどできない！！」と悶えていた部分なので、お二人がいてくださって本当によかったです。
&syachi 確かに。人によってどのくらいの難易度のシナリオで遊びたいかって全然変わってきますよね……。 &br そこを解決してるの、改めてすごいですね……！
その辺りをあーでもないこーでもない……と二人で話し合っているうちに、 &em_「シナリオよりこっち（マスタリングのノウハウ）をメインにしたほうが皆の役に立つぞ？」 と気付きました。
だからハルーラガイドに載せたシナリオも、コラムと合わせて読み込んで欲しいものになっています。
「シナリオがないと買い手の目を引けないから」というのも勿論ありますけどね。 
&br
話を戻します。
&br
ノウハウメインにすると決めてから、色々と気付きが広がっていきました。
「戦闘難易度以外にも色々とわからない部分があるよね」
「雰囲気づくりが上手なGMさん、気持ちいい戦闘をさせてくれるGMさん、進行がスムーズなGMさん達がいて、皆何かしらの工夫は絶対してる！」
といった具合で。
&br
最終的に、執筆陣のお力を借りる事になりました。 
経緯をまとめると、最初は私とわらびさんだけで「汎用的なシナリオ集」を作ろうとしたんですが、 &em_色んな方の力を借りた方が良いものになると思った んですね。
&br
きっかけはこんな感じです！
&syachi なるほど！！　ありがとうございます。 &br 汎用シナリオ集として考えていたところから考えを巡らせた結果、とっても便利な「ハルーラガイド」が生まれたのですね！！ 

&2 関連ページ
&button_/blog/harula
&button_/blog/harula2

&2 ハルーラガイドの工夫
&syachi 「ハルーラガイド」を作る上で、工夫したところを教えてください！ 
工夫した点のひとつ目は &em_「読みやすさ」 です。
&br
- 行間をしっかり取る、
- 文字を大きくする、
- 小見出し・判定・描写文などによって文字の大きさやフォントを変えて強調する、
- ページの上下に黒っぽい帯（表紙イラストの白黒画像）を配置して視線を本文に誘導する、
&br
などです。
&br
帯上にコラムやシナリオタイトルを配置することで &em_参照性を高めた のもありますね。
&br
読者の方からも「読みやすい」という感想を頂けてよかったです。
これらの殆どは、きっかけの話でも挙がった神砂わらびさんが、ご自身の同人誌で使用されていたテクニックです。
&br
このあたりのことは、「冒険者の旅路」の制作時にDKPさんへ継承させて頂きました。 
&syachi やはり印刷レイアウトにはこだわりがあったのですね！ &br とっても読みやすくて、かっこよくて、素敵でした！
ふたつ目は &em_「盛り上げと頒布の仕組みづくり」 です。
こちらはほぼハリィさんのおかげです。
&br
編集が終わった段階で、コミケ開催まで1ヶ月半ありました。
&em_その間絶えずハルーラガイド関連で面白い話題を投入 し、 &em_SNS上で存在感と期待感を高め続けてくれた おかげで、事前予約と当日合わせて &em_120部完売 という嬉しい結果に繋がったのだと思います。
&br
ハリィさんはご自身のラジオ（不定期でニコニコ動画上で公開されています）やオンセンSNSで話題にしてくださったり、Twitter上で制作中のワクワクした気持ちをツイートしてくださったり。
「事前予約を取って郵送で対応することで、当日来れない人にも届くようにしよう」
「予約数から発行部数を調整して、赤字がないようにしよう」
「限定ポストカードを作っておまけとして入れておこう」
などなど、
&em_「みんなが楽しくて損をしない仕組み」を作り上げてくださった ことには、本当に感謝でいっぱいです。
&br
「アイデアがあります☆」といって次々に作戦を話してくれるのは非常に心強かったです笑 
&br
ハリィさんは「冒険者の旅路」でも同様に楽しく盛り上げておられましたね。
私もSNSで見ていてワクワクしました。
&syachi ありがとうございます！　ハリィさんとの盛り上げ、すごかったですね。「ハルーラガイドっていうすごい同人誌が出るらしい」って界隈が盛り上がってるのを感じていました。 &br &br これらの工夫、どちらもSW2.5やTRPGに限らず、同人誌を出したい人には役立つことですね！

&2 関連ページ
&button_/sw25/fav/dkp
&button_/sw25/fav/harry

&2 ハルーラガイドのまとめ
&syachi さて、最後に「ハルーラガイドについてこういうことを知ってもらえたら嬉しい」みたいなことがあれば、ぜひ教えてください！！
&em_マスタリングは十人十色 ですので、  &em_よいと思うところをつまみ食いして頂き つつ、  &em_自分流の卓を作っていただければ本望 でございます！
&3 ハルーラガイドの入手方法
ハルーラガイドは現在、PDF版がBoothで頒布されています。
&button_https://booth.pm/ja/items/4489031 Booth


&1 SW2.5ビギナーズインストラクション「Welcome to らくしあ！」について
&syachi たかはるさんがブログにて公開しているSW2.5ビギナーズインストラクション「Welcome¥sto¥sらくしあ！」（ &link_https://takahaltrpg.hatenablog.jp/entry/2019/07/19/SW2.5%E3%83%93%E3%82%AE%E3%83%8A%E3%83%BC%E3%82%BA%E3%82%A4%E3%83%B3%E3%82%B9%E3%83%88%E3%83%A9%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%80%8CWelcome_to_%E3%82%89%E3%81%8F%E3%81%97%E3%81%82%EF%BC%81,公開場所 ）について、制作に至った経緯や工夫した点についてお聞きしたいなと思ってます！
Welcome¥sto¥sらくしあ！ですね。
&em_作っているときとても楽しかった ことを覚えてます。
&br 
あの資料は、 &em_ソドワをまったく知らない知り合いに布教する機会 があって、説明に使うアイテムがあったら便利だな〜と思って作ったものです。
&syachi 本当にソード・ワールド2.5の初心者にぜひ読んでいただきたい内容になっているなって思います！ &br 工夫したところを教えてください。
&em_工夫した点としては、「楽しそうに見せる」こと です。
&br
&em_ソドワの魅力である重厚な世界観と個性的な種族群、そしてプレイヤー達のソドワ愛 を伝えようと思いました。 
&syachi 楽しそうなの、すごく伝わってきてます！ &br いろんな方のイラストがあって、素敵ですよね。
当時 &em_Twitterで各種族のうちの子イラストを募集した んですが、イメージがありました。
&br
ちょっと話が飛びますが、カラオケでボカロ曲を入れるとピアプロに投稿されたイラストが映像として表示されるじゃないですか。
プロアマ問わずいろんな方が投稿されているんですが、 &em_どれも共通してボカロへの愛を強く感じて、あったかい気持ちになる んですよね。
&syachi 僕もカラオケのボカロ曲の背景、めっちゃ好きです！
そういうかんじをソドワでもやりたいと思ったんです。 
&br
&em_皆さんの愛のこもったイラストで彩る ことができ、とてもありがたかったです。
使わせてくださった方々とは &em_今も交流があります ね。
&syachi おおお、交流が残っているの、すごく素敵ですね……！

&1 企画に巻き込む力
&syachi たかはるさんの活動って「ハルーラガイド」にしても「Welcome¥sto¥sらくしあ！」にしても「巻き込む」のがとっても上手だなって思いました！ &br コツとか、気をつけてることってあるのでしょうか？
コツというか、 &em_イヤな印象を与えないため常に気を付けていたこと なんですが、
&br
「 &em_理想を共有する こと」
「 &em_教えを乞う姿勢 」
「 &em_リスペクトを伝える 」
&br
あたりになります。
&br
面白いものを見たいとか、面白い事に参加したい気持ちは誰もが常に持たれてると思います。
&em_声を上げる人が明確なビジョンを持って伝えれば、参加の声が上げやすくなる んだと思っています。
&br
また、「こういうものが作りたい！でも自分一人だけじゃ分からないことだらけです！助けてください！」と転げ回っていると、 &em_皆さん優しく手を差し伸べてくださいますね笑
&em_変なプライドだったり、一人でなんとかしなきゃという思いは早めに捨てます。
&br
素晴らしい強みを持っている面々の力を借りるにあたっては、 &em_「あなたのここが素晴らしいと感じたので制作に加わってください！」 とか、と &em_なるべく言葉にしてリスペクトを伝えることが大事 だと思って動いていました。
&br
細かいことも挙げるなら、 &em_相手のペースを大事にして一緒に盛り上がれそうなところに力を入れてもらう とか、
&em_意見が違ったときに否定せず、自分のビジョンに合致するかで考える （あくまでプロジェクトリーダーは自分なので）とか、そういったことも気を付けてたかなぁと思います。 
&syachi しっかりとリスペクトを持ちつつ、あくまでもしっかりと自分のビジョンを持つ、難しそうですがとっても大切そうですね……！

&1 シナリオを特別に無料公開！
&syachi 他にもシナリオやリプレイの頒布などいろいろなさっていると思うのですが、その辺のお話を教えていただいてもよろしいでしょうか？
そうですね、シナリオは過去何本か公開しています。
&br
実は、 &em_ハルーラガイド電子版のDL数が100本を突破したお礼として、過去有料で頒布していたシナリオを一本無料公開 しようとしています。
&br
ハルーラガイドを皆さんが手に取ってくれたおかげで資金的に余裕ができたので、シナリオ集を有料にする必要がなくなった、と思っていただければ幸いです。
公開後私自身が何度も回した中で改善した点を反映しているので、 &em_過去に買ってくださった方にとってもちょっとお得……かもしれません。
&br
ハリィさんと協力して、 &em_またプチ盛り上がりが起こせたらいいなぁ などと企んでいます笑 
&syachi ハルーラガイドの100本ダウンロード、おめでとうございます！！　すごい本数ですね……。 &br そしてそんな情報を教えていただいていいんですね……！ &br ありがとうございます！

&&dnc_シナリオ無料公開！
ということで！
&br
&em_SW2.5シナリオ『あなたに贈る花』が無料頒布 となりました！！！
&br
たかはるさんがC97で頒布したシナリオ集「SW2.5シナリオ集　あなたに贈る花」に掲載されたシナリオを、リライトしたものとのことです！
&br
なななんと、 &em_コピペ用テキストとNPCイラスト集もついてくる とのこと！
ぜひ皆さんもダウンロードして、遊んでみてください！
&button_https://cinderellarats.booth.pm/items/5170549 Booth
&&&

&1 たかはるさんにとってのソード・ワールド2.5の魅力
&syachi たかはるさんは「ハルーラガイド」といい「Welcome¥sto¥sらくしあ！」と言い、人を巻き込みながらソード・ワールド2.5ユーザーをいっぱいサポートしてくださっていて、本当に感謝しかありません。 &br &br そんなたかはるさんにとっての、ソード・ワールド2.5の魅力ってなんなのでしょうか？
やはり &em_世界観設定の深み だと思います。
&em_シナリオフックが大量にあって、物語が作りやすい ですよね。
&em_長い歴史があるソドワならではの魅力 だと思います。
&syachi ありがとうございます！ &br 最後に、ここまで読んでくれた人に何かあればお願いします！
なっがーい話を読んでいただきありがとうございました！
よきソドワライフを！
&syachi ありがとうございました！ &br 「ハルーラガイド」と「Welcome¥sto¥sらくしあ！」、みなさんぜひチェックしてください！
&3 「ハルーラガイド」の入手方法
ハルーラガイドは現在、PDF版がBoothで頒布されています。
&button_https://booth.pm/ja/items/4489031 Booth
&br
&3 「Welcome¥sto¥sらくしあ！」の公開場所
たかはるさんのブログにて無料公開されています。
&button_https://takahaltrpg.hatenablog.jp/entry/2019/07/19/SW2.5%E3%83%93%E3%82%AE%E3%83%8A%E3%83%BC%E3%82%BA%E3%82%A4%E3%83%B3%E3%82%B9%E3%83%88%E3%83%A9%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%80%8CWelcome_to_%E3%82%89%E3%81%8F%E3%81%97%E3%81%82%EF%BC%81 公開場所
`

</script>