<template>
    <card-array-by-andml :andml="andml" />
</template>
  
<script setup lang="ts">
import { isPast } from '~/src/util/date';

const andml = `
&1 ハルーラガイドとは？
${!isPast("2023/12/10") ? "ソード・ワールド2.5（SW2.5/ソドワ）の同人誌『ハルーラガイド』が2023年 &em_11月21日から再販受付 されます！ &br &br" : ""}

『ハルーラガイド』は &em_GM（ゲームマスター）として遊ぶためのガイド としてたかはるさん（ &link_https://twitter.com/numachipachi,Twitter ）が中心となって作った同人誌です。
&br
ボリュームたっぷりの &em_シナリオ5本 と &em_コラム15本 が掲載されていて、GMをする際の「コツ」などがわかります！
&br
&em_GMをよくする人 はもちろん、 &em_これからGMに挑戦してみたいGM初心者の方 や、 &em_PLとしてGMをサポートしたい方 にも、超おすすめの同人誌です。
シナリオ作者さんにもおすすめです。
&br
2022年の冬コミ（C101）にて頒布されて話題になり、既に &em_紙版が170部、電子版が100部 という記録を打ち立てています！
&br
表紙は公式サプリメント &em_『ラクシアライフ』でも表紙を手がけた今野隼史先生 による、とっても可愛いイラストです！
&br
&br
ハルーラガイドの魅力についてはこのページの下部でも詳しく解説していますので、よろしければ読んでいってください！


&1 ハルーラガイド再販！
通販分やイエローサブマリンでの委託分も含め、 &em_全て在庫切れとなっていた 紙版の『ハルーラガイド』が再販されました。
2023/12/10まで再販予約を受け付けていましたが、予約数より少し多めに刷ったとのことです！
&br
- 販売方法
-- 通信販売
- 販売サイト
-- &link_https://harryharry.base.shop/blog/2023/11/10/072951,HarryHarry
&br
売り切れになっていた場合にはご容赦ください。
&br
&br
また、イエローサブマリンでの委託販売も予定しているようです。
様々な事情で通販での購入が難しいという方はこちらも検討ください。
&br
&br
『ハルーラガイド』は内容ももちろんですが、 &em_作者のたかはるさんがこだわった読みやすいレイアウト や、 &em_今野隼史先生の表紙イラスト もとっても魅力的です！
&br
電子版でも楽しめないことはないですが、ぜひ紙版も手にしていただきたいと思っています！

&1 ハルーラガイドの電子版をダウンロードしよう
ハルーラガイドの電子版はたかはるさんのBoothにて頒布されています！
&br
電子版はいつでも読めるのが圧倒的なメリット！
&br
たかはるさんのレイアウトは電子版でもとっても読みやすいです！
&button_https://booth.pm/ja/items/4489031 Booth


&1 ハルーラガイドの魅力！
さて、ではここからは、管理人しゃちほこ丸の思う『ハルーラガイド』の魅力を紹介します！
&br
と、その前に。
なんとこのウェブサイトでは『ハルーラガイド』の作者の2人にインタビューをしています！
こちらもぜひ読んでください。
&button_/sw25/fav/takaharu
&button_/sw25/fav/harry
&br
また、以前に各コラムの感想を書いているのでこちらも良ければ読んでください。
&button_/blog/harula
&button_/blog/harula2
&br
それでは改めて、紹介して行きます！

&2 表紙イラストがとっても素敵！
僕が今野隼史先生の大ファンだからというのもあるのですが、とってもとっても素敵な表紙イラストです！
&br
今野隼史先生が &link_https://twitter.com/frontierpub/status/1598951621698158593,こういうツイート をしています。
ほんとに &em_「公式書籍とは違けど、SW2.5っぽさもある」 とっても絶妙なデザインで、とっても素敵なんです！
&br
文字なしのイラストは &link_https://twitter.com/frontierpub/status/1608847529436942339,こちらの今野隼史先生のツイート や、 &link_https://www.pixiv.net/artworks/104059834,こちらの今野隼史先生のPixiv から確認できますので、こちらもぜひぜひ見てください！

&2 シナリオがとっても面白い
掲載シナリオは以下の5本です。
&br
- ランダムアビスを踏破せよ！
-- ランダムイベント
-- 作：ハリィさん
- シガル村の幽霊屋敷
-- ダンジョン
-- 作：ヴォーパルのっちさん
- ユニコーン密猟者を追え！
-- シティ
-- 作：たかはるさん
- 高嶺の花
-- ウィルダネス
-- 作：ざしきわらしさん
- 赤子泣く頃
-- キャンペーン作例一話目
-- 作：卵生瞬さん
&br
上4つは「ランダムイベント」「ダンジョン」「シティ」「ウィルダネス」と &em_異なるジャンルのシナリオ になっています。
いろんなシナリオを遊んでみたい方におすすめです。
&br
『赤子泣く頃』はキャンペーンの1話目の作例ということで、これを元にキャンペーンを作ってみることができます。
&br
話に繋がりがあるわけではないものの、 &em_レベル帯が連続になっているので、キャンペーンで5つ遊んでみるのもおすすめ です。

&3 僕も遊んでみました
ちなみに僕はDKPさん主催の「はるコン」で『ランダムアビスを踏破せよ！』を2周遊びました。
すっごく楽しかったです。
ランダムイベントは同じシナリオを2回連続で遊ぶなんてことができるのも魅力ですね。
&br
ちなみに、「はるコン」については以下で紹介していますのでよければ見ていってください。
&button_/sw25/fav/dkp

&2 コラムがとっても役に立つ
メインの内容のコラムと対談、これがとっても役に立ちます！
&br
テンポよく楽しいセッションをマスタリングするコツであったり、シナリオの書き方であったり、PLが少ないときの対応であったり……、 &em_素晴らしいコラムがいっぱい です。
&br
詳しい内容は全ての感想と「自分ならこうするな」をブログに書いているのでそちらを参考にしてください。
&button_/blog/harula
&button_/blog/harula2
&br
こういうのって「わかっていても言語化が難しい」ものなので、言語化してある本を読むと、「これ無意識でしてたな」ってのが出てきて、そういうのでもGMとしてのスキルが上がる気がします！
&br
もちろん初心者GMさんなら「こうすればいいのか！」「こういうことを気にするといいんだ！」「こういう準備をするといいんだ！」って情報がいっぱいです。
&br
&3 他のTRPGでも！
ソード・ワールド2.5についてのコラムですが、 &em_他のTRPGでも絶対に役立つ内容 ばかりです。
僕が遊んだことがある「クトゥルフ神話TRPG」「インセイン」「バケノカワ」「マモノスクランブル」等々なら絶対に役立ちます。

&2 レイアウトがとってもみやすい！
電子版の販売サイトであるBoothで中身がちょっと公開されているので見ていただきたいのですが、とってもとっても読みやすいデザインです！
&button_https://booth.pm/ja/items/4489031 Booth
&br
こちらも表紙と同様に、 &em_「公式書籍とは違けど、SW2.5っぽさもある」 とっても絶妙なデザインです！
&br
読みやすいって正義です。
&br
「同人誌はちょっと……」って方にもぜひ読んでいただきたいなって思ってます。


&1 まとめ
改めて、 &em_GMをよくする人 はもちろん、 &em_これからGMに挑戦してみたいGM初心者の方 や、 &em_PLとしてGMをサポートしたい方 にも、超おすすめの同人誌です。
シナリオ作者さんにもおすすめです。
&br
ぜひこの機会にチェックして見てください！

&3 通販について
2023/12/10まで再販予約を受け付けていましたが、予約数より少し多めに刷ったとのことです！
&br
- 販売方法
-- 通信販売
- 販売サイト
-- &link_https://harryharry.base.shop/blog/2023/11/10/072951,HarryHarry
&br
売り切れになっていた場合にはご容赦ください。

&3 電子版について
電子版はたかはるさんのBoothにて頒布されています！
&button_https://booth.pm/ja/items/4489031 Booth
&br
&3 『ハルーラガイド』関連ページ紹介！
途中でも紹介しましたが、『ハルーラガイド』に関するページがいっぱいありますのでぜひ確認してください！
&button_/sw25/fav/takaharu
&button_/sw25/fav/harry
&button_/blog/harula
&button_/blog/harula2

&3 SW2.5 関連ページ紹介！
このウェブサイトでは他にもTRPGやソード・ワールド2.5に関するお役立ち情報などをまとめています！
ぜひご覧ください！！
&button_/sw25
&button_/sw25/forbeginner
&button_/sw25/tool
&button_/sw25/new
`
</script>
  