<template>
  <card-array-by-andml :andml="andml" />
</template>

<script setup lang="ts">
const andml = `
&1 このページについて
このページでは &em_ソード・ワールド2.5（SW2.5）というTRPGの概要と魅力 について簡単に説明します！
下には初心者向けの情報や、遊ぶ際に役立つツールへのリンクもあるので、ぜひ最後まで読んでください！

&1 ソード・ワールド2.5の概要
ソード・ワールド2.5（SW2.5）は &em_ファンタジー世界 「ラクシア」で冒険を繰り広げる、 &link_http://www.groupsne.co.jp/index.html,グループSNE による &info_trpg です。

&&faq_ファンタジーとは
幻想的なフィクション（創作）です。
&br
ゲームでは「ドラゴンクエスト」「ファイナルファンタジー」などのRPGが有名です。
また、「モンスターハンター」の世界もファンタジー世界です。
&br
最近のアニメやラノベ・マンガだと「異世界転生」「異世界ファンタジー」などがありますが、 &em_ラクシアはああいう「異世界」 だと思ってください。
&br
「ハリーポッター」シリーズも有名なファンタジー作品ですが、あれはあくまで現実世界が舞台になっています。
ただ、 &em_魔法が使える ことや、 &em_不思議な生物 がいること などは一緒です。
&&&

&&faq_ファンタジーTRPGは難しい？
「TRPGの中でもファンタジーTRPGは難しい」という話を聞くことがあります。
ですが、少なくともソード・ワールド2.5は &em_そんなことはありません！
&br
確かに、 &em_データが多く、最初は混乱するかも しれません。
その辺はこのウェブサイトでもキャラクターの作り方の解説を準備中なので、それを読んでもらえれば！　と思います。
&br
それに、 &em_強いキャラを作って戦闘を楽しむ ことだけがソード・ワールド2.5の楽しみ方 &em_ではありません 。
気楽にキャラを作って、 &em_ファンタジー世界での冒険を楽しみましょう 。
&&&

&1 ソード・ワールド2.5の魅力
僕の考える &em_ソード・ワールド2.5（SW2.5）の魅力は以下の通り です。
&br
-人間の他にもドワーフやエルフ、二足歩行のウサギ「タビット」など &em_10を超える種族 
-ファイター（戦士）やグラップラー（拳闘士）、プリースト（神官）など &em_10を超える技能 
-神話や歴史から現在の街並みや生活に至るまでの &em_世界観の充実 
-サプリメント（拡張ルールブック）の発売が多い（ &em_サポートが手厚い ）
- &em_ルールブックI（990円）だけでも遊べるという手軽さ
&br
詳しくは以下で見ていきます！

&1 ソード・ワールド2.5の舞台「ラクシア」とは？
ラクシアは3本の剣によって創られたとされる世界で、 &em_魔法 もあります。
現在は魔物によって &em_文明が崩壊させられてから300年 ほどがたち、復興に向けて遺跡探索が盛んな時期です。
&br
ラクシアにはさまざまな種族が暮らしており、人間の他にもドワーフ やエルフ 、二足歩行のウサギ「タビット」 などがいます。
&br
また、ソード・ワールド2.5の推しポイントとして「 &em_世界観の充実 」があります。
&em_神話や歴史から現在の街並みや生活 に至るまで、様々な情報がルールブックに載っており、 &em_ファンタジー世界での冒険を楽しむ ことができます。

&2 ただのファンタジー世界ではない
ここまではラクシアを「ファンタジー世界」として紹介していましたが、実はただのファンタジー世界ではありません。
&br
前述のように、文明が崩壊させられた300年後が舞台なのですが、この崩壊させられた魔動機文明は &em_現実世界と同じかそれより高度 な文明でした。
そのため、 &em_SF（サイエンス・フィクション） 的な要素を含んでいるのです。
&br
また、敵である蛮族が支配している地域では &em_ダークファンタジー のような冒険ができたりもします。
&br
ただのファンタジーではないこともソード・ワールド2.5の魅力の1つだと思っています。

&1 さまざまな種族と技能
&2 種族
前述の通り、ラクシアにはさまざまな種族が暮らしています。
&em_プレイヤーがキャラクターとして選べる種族は10を超えています 。
&br
ソード・ワールド2.5の種族一覧は以下をご覧ください。
&button_/sw25/forbeginner/syuzoku

&2 技能
「技能」というのは他のゲームにおける「クラス」や「ジョブ」のようなものです。
ソード・ワールド2.5では1人のキャラクターが複数の技能を持つことができます。
&br
剣や斧を振って戦うファイター（戦士）や、パンチとキックを数多く叩き込むグラップラー（拳闘士）、回復魔法を得意とするプリースト（神官） など、 &em_10を超える技能を組み合わせてキャラクターを作る ことができます。
&br
ソード・ワールド2.5の技能一覧は以下をご覧ください。
&button_/sw25/forbeginner/ginou

&1 ソード・ワールド2.5はサポートが手厚い！
さらには、 &em_サプリメント（拡張ルールブック）の発売が多いことも魅力の1つ です。
サプリメントによってさらに新たな種族や技能が追加され、いろいろなキャラクターが作れるようになります。世界観もどんどん充実します。

&1 ソード・ワールド2.5は手軽に遊べる！
もちろん、サプリメントを買わなくても充分に楽しむことができます。
&em_ルールブックI（990円）だけでも遊べるという手軽さ も最高です。
&br
ルールブックの購入は以下からどうぞ
&amazon_ルールブック 

&1 このウェブサイトでは……
&2 初心者向けの情報はこちら
ソード・ワールド2.5の &em_初心者向け情報 をまとめています。
よければご覧ください。
&button_/sw25/forbeginner 

&2 役立つツールを公開中！
ソード・ワールド2.5で役立つ &em_様々なツール を公開しています。
関連ページは以下からご覧下さい！
&button_/sw25/tool

&2 新刊情報や刊行予想はこちら
ソード・ワールド2.5の &em_新刊情報 や管理人による刊行予想をまとめています。
&button_/sw25/new 

&2 その他のソード・ワールド2.5関連ページ
他にも役立つ情報などをまとめたページがあります。
&button_/search?tag=sw25 こちら

&1 公式リンク
&button_https://fujimi-trpg-online.jp/game/sw25.html 富士見書房公式 TRPG ONLINE
&button_http://www.groupsne.co.jp/products/sw/index.html 株式会社グループＳＮＥ
`
</script>
