<template>
  <card-array-by-andml :andml="andml" />
</template>

<script setup lang="ts">
const andml = `
&1 ソード・ワールド2.5とは
ソード・ワールド2.5（SW2.5）は &em_ファンタジー世界 「ラクシア」で冒険を繰り広げる、グループSNEによる &info_trpg です。
&br
ラクシアは3本の剣によって創られたとされる世界で、 &em_魔法 もあります。
現在は魔物によって &em_文明が崩壊させられてから300年 ほどがたち、復興に向けて遺跡探索が盛んな時期です。
&br
ラクシアには様々な種族が暮らしており、人間の他にもドワーフ やエルフ 、二足歩行のウサギ「タビット」 などがいて、 &em_プレイヤーがキャラクターとして選べる種族は10を超えています 。
ソード・ワールド2.5の魅力は選べる種族の多さだけではありません。剣や斧を振って戦うファイター（戦士）や、パンチとキックを数多く叩き込むグラップラー（拳闘士）、回復魔法を得意とするプリースト（神官） など、 &em_10を超える技能を組み合わせ 、キャラクターを作ることができます。
&br
また、ソード・ワールド2.5の推しポイントとして「 &em_世界観の充実 」があります。
&em_神話や歴史から現在の街並みや生活 に至るまで、様々な情報がルールブックに載っており、 &em_ファンタジー世界での冒険を楽しむ ことができます。
&br
さらには、 &em_サプリメント（拡張ルールブック）の発売が多いことも魅力の1つ です。
サプリメントによってさらに新たな種族や技能が追加され、いろいろなキャラクターが作れるようになります。世界観もどんどん充実します。
&br
もちろん、サプリメントを買わなくても充分に楽しむことができます。
&em_ルールブックI（990円）だけでも遊べるという手軽さ も最高です。

&2 まとめ
僕の考えるソード・ワールド2.5の魅力は以下の通りです。
&br
-人間の他にもドワーフやエルフ、二足歩行のウサギ「タビット」など &em_10を超える種族 
-ファイター（戦士）やグラップラー（拳闘士）、プリースト（神官）など &em_10を超える技能 
-神話や歴史から現在の街並みや生活に至るまでの &em_世界観の充実 
-サプリメント（拡張ルールブック）の発売が多い
-ルールブックI（990円）だけでも遊べるという手軽さ
&br
ルールブックの購入は以下からどうぞ
&amazon_ルールブック 

&1 内部リンク
当ウェブサイトではソード・ワールド2.5の &em_初心者向け情報 をまとめています。
よければご覧ください。
&button_/sw25/forbeginner 

他にもソード・ワールド2.5で役立つ &em_様々なツールや情報 を公開しています。
関連ページは以下からご覧下さい。
&button_/search?tag=sw25 こちら

&1 公式リンク
&button_https://fujimi-trpg-online.jp/game/sw25.html 富士見書房公式 TRPG ONLINE
&button_http://www.groupsne.co.jp/products/sw/index.html 株式会社グループＳＮＥ
`
</script>
