<template>
  <card-array-by-andml :andml="andml" />
</template>

<script setup lang="ts">
import { bookList } from "~/src/dict/new";
import { isPast, sortByDate } from "~/src/util/date";

const newBooks = bookList
  .filter((b) => !isPast(b.date))
  .sort((a, b) => sortByDate(false)(a.date, b.date));
const newBook = newBooks[0];

const andml = `
&1 このページについて
このページでは &em_ソード・ワールド2.5（SW2.5/ソドワ）というTRPGの概要と魅力 について簡単に説明します！
下には初心者向けの情報や、遊ぶ際に役立つツールへのリンクもあるので、ぜひ最後まで読んでください！

&1 ソード・ワールド2.5の概要
ソード・ワールド2.5（SW2.5/ソドワ）は &em_ファンタジー世界 「ラクシア」で冒険を繰り広げる、 &link_http://www.groupsne.co.jp/index.html,グループSNE による &info_trpg です。
「TRPGって何？」って方はまず以下のページをご覧ください。
&button_/trpg

&&faq_ファンタジーとは
幻想的なフィクション（創作）です。
&br
ゲームでは「ドラゴンクエスト」「ファイナルファンタジー」などのRPGが有名です。
また、「モンスターハンター」の世界もファンタジー世界です。
&br
最近のアニメやラノベ・マンガだと「異世界転生」「異世界ファンタジー」などがありますが、 &em_ラクシアはああいう「異世界」 だと思ってください。
&br
「ハリーポッター」シリーズも有名なファンタジー作品ですが、あれはあくまで現実世界が舞台になっています。
ただ、 &em_魔法が使える ことや、 &em_不思議な生物 がいること などは一緒です。
&&&

&&faq_ファンタジーTRPGは難しい？
「TRPGの中でもファンタジーTRPGは難しい」という話を聞くことがあります。
ですが、少なくともソード・ワールド2.5は &em_そんなことはありません！
&br
確かに、 &em_データが多く、最初は混乱するかも しれません。
その辺はこのウェブサイトでもキャラクターの作り方の解説を準備中なので、それを読んでもらえれば！　と思います。
&br
それに、 &em_強いキャラを作って戦闘を楽しむ ことだけがソード・ワールド2.5の楽しみ方 &em_ではありません 。
気楽にキャラを作って、 &em_ファンタジー世界での冒険を楽しみましょう 。
&&&

&1 ソード・ワールド2.5の魅力
僕の考える &em_ソード・ワールド2.5（SW2.5/ソドワ）の魅力を5つ 紹介します！
&br
- 人間の他にもドワーフやエルフ、二足歩行のウサギ「タビット」など &em_10を超える種族
- ファイター（戦士）やグラップラー（拳闘士）、プリースト（神官）など &em_10を超える技能
- 神話や歴史から現在の街並みや生活に至るまでの &em_世界観の充実
- サプリメント（拡張ルールブック）の発売が多い（ &em_公式サポートが手厚い ）
- &em_ルールブックI（990円）だけでも遊べるという手軽さ
&br
詳しくは以下で見ていきます！

&1 ソード・ワールド2.5の舞台「ラクシア」とは？
ラクシアは3本の剣によって創られたとされる世界です。
&em_魔法 もある、いわゆる「剣と魔法のファンタジー世界」です。
&br
ゲームで遊ぶことになる「現在」は、魔物によって &em_「魔動機文明」が崩壊させられてから300年 ほどが経った時代です。
復興に向けて、遺跡探索が盛んな時期です。
&br
ラクシアにはさまざまな種族が暮らしており、人間の他にもドワーフやエルフ、二足歩行のウサギ「タビット」などがいます。
&br
また、ソード・ワールド2.5の推しポイントとして「 &em_世界観の充実 」があります。
&em_神話や歴史 から &em_現在の街並みや一般人の生活 に至るまで、様々な情報がルールブックに載っています！
&em_ファンタジー世界での冒険 を &em_臨場感を持って体感し楽しむ ことができます。

&3 「ただのファンタジー世界」ではない
ここまではラクシアを「ファンタジー世界」として紹介していました。
が、ラクシアは「ただのファンタジー世界」ではありません。
&br
前述のように、文明が崩壊させられた300年後が舞台です。
この崩壊させられた「魔動機文明」は &em_現実世界と同じかそれより高度 な文明でした。
&br
そのため、 &em_SF（サイエンス・フィクション） 的な要素を含んでいるのです。
SF的な &em_自律ロボットなどが遺跡を徘徊 していることも多々あります。
&br
また、敵である「蛮族」が支配している地域では &em_ダークファンタジー のような冒険ができたりもします。
&br
「ただのファンタジー」ではないこともソード・ワールド2.5の魅力の1つだと思っています。

&1 さまざまな種族と技能
&3 種族
前述の通り、ラクシアにはさまざまな「種族」が暮らしています。
&em_プレイヤーがキャラクターとして選べる種族は10を超えています。
&br
どの種族を使うか悩んでいる時間も、ソード・ワールド2.5の楽しい時間の1つです。
&br
ソード・ワールド2.5の種族一覧は以下をご覧ください。
&button_/sw25/forbeginner/syuzoku

&3 技能
「技能」というのは、他のゲームにおける「クラス」や「ジョブ」のようなものです。
ソード・ワールド2.5では1人のキャラクターが複数の技能を持つことができます。
&br
- 剣や斧を振って戦うファイター（戦士）
- パンチとキックを数多く叩き込むグラップラー（拳闘士）
- 回復魔法を得意とするプリースト（神官）
&br
などなど、 &em_10を超える技能を組み合わせてキャラクターを作る ことができます。
&br
ソード・ワールド2.5の技能一覧は以下をご覧ください。
&button_/sw25/forbeginner/ginou

&1 ソード・ワールド2.5はサポートが手厚い！
さらには、 &em_サプリメント（拡張ルールブック）の発売が多い ことも魅力の1つです。
&br
サプリメントによって、より多くの種族や技能が使うことができるようになり、いろいろなキャラクターが作れるようになります。
&br
&em_魔法学校を中心にしたサプリメント などもあり、世界観もどんどん充実します。
&amazon_ユーシズ

&1 ソード・ワールド2.5は手軽に遊べる！
もちろん、サプリメントを買わなくても充分に楽しむことができます。
&em_ルールブックI（990円）だけでも遊べるという手軽さ も最高です。
&br
ルールブックを購入する際はHarryHarryという通販サイトで購入すると、店主のハリィさんがGMをしてくださるのでおすすめです！
&harry

&1 おすすめのサイト
当サイトではありませんが、以下の &em_「Welcome¥sto¥sらくしあ！」 ではソード・ワールド2.5についていろいろ解説されています。
&br
「未経験者さんを沼に落とすために作った、初心者向け資料」とのことで、 &em_世界観や種族、技能 についてわかりやすくまとまっています。
&em_SW2.5を初めてみようという方はまず読んでみる ことをおすすめします！
&button_https://takahaltrpg.hatenablog.jp/entry/2019/07/19/SW2.5%E3%83%93%E3%82%AE%E3%83%8A%E3%83%BC%E3%82%BA%E3%82%A4%E3%83%B3%E3%82%B9%E3%83%88%E3%83%A9%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%80%8CWelcome_to_%E3%82%89%E3%81%8F%E3%81%97%E3%81%82%EF%BC%81 「Welcome¥sto¥sらくしあ！」

&3 公式サイト
出版社や開発元の公式サイトでも、以下のページにて、ソード・ワールド2.5についていろいろ解説されています。
&button_https://fujimi-trpg-online.jp/game/sw25.html 富士見書房公式 TRPG ONLINE
&button_http://www.groupsne.co.jp/products/sw/index.html 株式会社グループＳＮＥ


&1 共有のお願い
このページは &em_ソード・ワールド2.5の紹介用にバンバン使ってください！
&br
このページの内容が「分かりやすかった」「役に立った」という方は、ぜひ &em_知り合いに伝えたり、Twitterでシェアしたり してください！
&button-share

&1 このウェブサイトでは……
このウェブサイトではソード・ワールド2.5に関する様々な情報をまとめています！

&3 初心者向けの情報はこちら
ソード・ワールド2.5の &em_初心者向け情報 をまとめています。
よければご覧ください。
&button_/sw25/forbeginner

「ソドワを一緒に遊ぶ人を探したい！」
「ソドワを遊んでいる人と繋がりたい！」
という方はこちらもご覧ください。
&button_/sw25/tool/intro
&button_/sw25/tool/community

&3 役立つツールを公開中！
ソード・ワールド2.5で役立つ &em_様々なツール を公開しています。
関連ページは以下からご覧下さい！
&button_/sw25/tool

&3 新刊情報や刊行予想はこちら
ソード・ワールド2.5の &em_新刊情報 や管理人による刊行予想をまとめています。
&button_/sw25/feature/new
${
  newBook
    ? `
&4 最新刊『${newBook.title}』（${
        newBook.dispDate ? newBook.dispDate : newBook.date
      }発売予定）特集中！
当サイトでは &em_ソード・ワールド2.5（SW2.5/ソドワ） の最新刊となる &em_『${
        newBook.long ? newBook.long : newBook.title
      }』 （${
        newBook.dispDate ? newBook.dispDate : newBook.date
      }発売予定）についても全力で特集中です！
&br
ぜひ見ていってください！
&button_/search?word=${newBook.title} 『${newBook.title}』関連ページはこちら`
    : ""
}

&3 その他のソード・ワールド2.5関連ページ
他にも役立つ情報などをまとめたページがあります。
いろいろと見ていってください。
&button_/search?tag=sw25 こちら
`;
</script>
