<template>
  <card :id="group.id" v-if="group && group.id">
    <template #title>
      {{ group.type }}
    </template>
    <andml v-model:andmls="explain" v-if="explain" />
    <template #pafter>
      <card v-for="item of group.items" :key="item.name" :id="item.name">
        <template #title>
          {{ item.name }}
        </template>
        <template #before>
          <div class="d-flex flex-column align-center">
            <v-rating v-model="item.ossusume" readonly size="x-small" class="px-5" half-increments />
          </div>
        </template>
        <andml :andmls="item.explain.split('\n')" />
        <item-amazon mini :item="[item.name]" />
      </card>
    </template>
  </card>
</template>

<script setup lang="ts">
const big: SupplimentGroup = {
  id: "big",
  type: "大型サプリ",
  explain: `
前述の通り大規模なデータ・ルールの追加があるサプリです。
2023年2月現在4冊出てます。
&br
-エピックトレジャリー
-モンストラスロア
-メイガスアーツ
-バトルマスタリー
&br
それぞれの解説をしていきます。
&br
ちなみにこれらはだいたい夏の終わり頃に出ることが多いです。
なので「夏の大型サプリ」とか「秋の大型サプリ」とか言われることがあります。
  `,
  items: [
    {
      name: "エピックトレジャリー",
      ossusume: 5,
      explain: `
最初にして &em_おすすめ度は最大の5 、初心者は &em_困ったらこれを買っておけば無難 って感じです。
&br
メインとしてはルルブI〜IIIの &em_アイテム がまとまっており、アイテムの追加もあります。
まずアイテムがまとまっているのが &em_遊ぶ上でとても便利 です。
&br
&em_追加アイテム には便利なものから、鉄球を振り回して戦う武器〈テムスガルドのチェイン＊＊〉や魔法ダメージを発生させる〈水風船〉など &em_一風変わったもの まであります。
また、空飛ぶスケボーなどの &em_新規の騎獣 も載っており、ライダーをするなら一気に充実します。
&br
さらに追加ルールとして以下の3つがあります。
&br
- 「ポイント割り振りによるキャラクター作成」
-- キャラクター作成に自由度を与えます
- 「一般技能」
-- 戦闘などには使えないフレーバー要素な技能が追加
-- &em_冒険中の料理などでロールプレイを大いに盛り上げ てくれます
-「熟練戦闘」
-- 二次元のマップで &em_より複雑な戦闘 を行えます
&br
そして &em_各種族の身長対比図 や冒険者技能（ファイター、グラップラー……など）の解説が載っています。
この冒険者技能の解説、 &em_発祥や社会での存在など についても書かれています。かなり読み応えがあり、今後の冒険が楽しくなること間違いなしです。
&br
最初に言った通りですが、困ったらこれを買っておけば無難って感じはあります。
以下を読んで「これが欲しい！」ってならない限り、このエピックトレジャリーを買うといいでしょう。
      `,
    },
    {
      name: "モンストラスロア",
      ossusume: 4,
      explain: `
こちらはメインとしてルルブI〜IIIの &em_魔物 がまとまっており、魔物の追加もあります。
&em_GMをやるなら必須 と言っていいほど便利ですし、PLをするときも持っているだけでGMの負担が減ります。
&br
そして魔物の解説も充実してます。
&em_動物と幻獣の違い って何？　みたいな話が載ってます。
&br
そしてそして魔法使い &em_技能が2つ追加 されています！
-&em_ドルイド 技能
--森羅魔法という、精霊とともに戦う魔法を扱える技能
--補助動作で使える魔法も多く、味方のサポートをしたり、足りない数ダメージを補ったりと &em_数多の場面で活躍 できます
-&em_デーモンルーラー 技能
--招異魔法という魔法を扱える技能で、魔神を使役できる &em_禁忌的な技能 です
--自身の強化にも優れており、 &em_優秀な魔法戦士も できます
&br
&em_新技能 に惹かれたなら最初に買うのもありです。
      `,
    },
    {
      name: "メイガスアーツ",
      ossusume: 4,
      explain: `
こちらはメインとしてルルブI〜IIIの &em_魔法 と &em_練技・呪歌・終律・騎芸・賦術 がまとまっています。
&br;
プリーストが信仰できる &em_神柱 やマギテックが使う &em_魔動機術に追加が あります。
どちらにも面白いものばかりです。
&em_お金の神様 がいたり、 &em_杭を打ち出す魔動機術 があったり……。
&br
さらに、 &em_ソーサラー と &em_コンジャラー を両方取った際に自動的に使えるようになる &em_「深智魔法/ウィザード技能」もあります。
&em_魔法を極める なら使っていきたいところです。
&br
さらにさらに &em_フェアリーテイマー の妖精との契約方法が2つ追加されています。
&em_3属性と契約 することでよりランクの高い魔法を扱うこともできますし、 &em_6属性と契約 していろんな妖精を召喚したり、【カオス〜】という強力な攻撃魔法を使ったりできます。
&br
「魔法と人々の関わり」「蛮族と魔法」といった解説があり、 &em_魔法についてより詳しく 知れるでしょう。
&br
そして &em_技能が2つ追加 されます！
-&em_ジオマンサー 技能
--相域と呼ばれるものを操ります
--ランダムな対象に効果を与えるという &em_博打性が強い ものですが、他の技能と組み合わせやすく、面白いです
-&em_ウォーリーダー技能
--鼓咆や陣卒と呼ばれるものを使って、味方をサポートしたり、自身を強化したりします
--&em_スカウト以外で唯一先制判定を行える というのも特徴で、陣卒【軍師の知略】をとれば &em_知力を使って先制判定 も行えます
&br
&em_新技能 に惹かれたなら、もしくは &em_魔法使いをもっと楽しみたい なら最初に買うのもありです。
そうでない人もエピックトレジャリーを買った後の2番目に買うのにオススメです。
      `,
    },
    {
      name: "バトルマスタリー",
      ossusume: 2.5,
      explain: `
こちらはメインとしてルルブI〜IIIの &em_戦闘特技 がまとまっています。
基本的に低レベル帯のレギュレーションで使う戦闘特技はルールブックIに掲載されているので、初心者に &em_必須かといえばそんなことはない ですが、エピックトレジャリーやメイガスアーツの次に……といった感じです。
&br
&em_技能が1つ追加 されており、これは &em_長いソード・ワールドの歴史でも初 となる近接技能の追加です。
「 &em_バトルダンサー 技能」と呼ばれる、 &em_技を使いこなして戦う戦士 が追加されます。
戦闘特技がメインのこのサプリとの相性は最高です。
が、初心者の方にはまずはファイターやグラップラーがおすすめです。
&br
また、「 &em_流派 」というものが追加されています。
これはさらに &em_特色のあるキャラクター を作るためのルールで、「この地方でプロレス経験があるからこういう技が使えるんだ！」みたいなやつです。（伝わらなそう……）
雪山で修行した人たちの編み出した、 &em_雪を操る魔法 なんてのもあります。
すごく面白いのですが、 &em_初心者向けではない 、という感じです。
&br
バトルマスタリーは &em_全体的に初心者向けではない と思います。
少し慣れてきて、普通のキャラ作りに飽きてきたり、「バトルダンサー」や「流派」に興味があれば、ぜひ！
      `,
    },
  ],
};
const cb: SupplimentGroup = {
  id: "cb",
  type: "キャラビルドサプリ",
  explain: `
キャラクターを作る補助的なサプリで、小規模なデータ・ルールの追加があります。
現在2冊出てます。
&br
-キャラクタービルディングブック
-アウトロープロファイルブック
`,
  items: [
    {
      name: "キャラクタービルディングブック",
      ossusume: 0,
      explain: `
持ってないし、今のところ買う予定もないです。
慣れた人が初心者に布教する用のサプリなのかなぁ？
&br
簡単にキャラを作れるサプリなんですけど、使ってるのほぼみたことない……。
&br
1年後に発売された、後述のアウトロープロファイルブックがほぼ上位互換になってしまっています。
      `,
    },
    {
      name: "アウトロープロファイルブック",
      ossusume: 2.5,
      explain: `
&em_簡単にキャラを作れるサプリ で、キャラクタービルディングブックに載らなかったマイナー目なビルドとかが作れるサプリです。
&br
そんなことより &em_シャドウ ・ &em_ソレイユ ・ &em_アルヴ ・ &em_ウィークリング という &em_4種族が追加 されています！！
SW2.5の中では2023年3月現在で &em_唯一の種族追加 です。
&br
-シャドウ
--傭兵をやることが多い種族
--&em_魔法の影響を受けにくく て、前衛に強い
--高身長スレンダーイケメン
-ソレイユ
--太陽の加護を受けた人族で脳筋
--&em_とにかく脳筋
--会話がボディランゲージ
-アルヴ
--&em_吸血鬼が転生 した姿……らしい
--ひ弱で他の人族に依存しないと生きれない、エモい種族
&br
そしてウィークリングは弱く生まれ、蛮族社会を追われて人族と共に生きることを選んだ蛮族。そう &em_蛮族！
&em_蛮族ができる んです！
ウィークリングの中でも、さらに4種類（バジリスク・ガルーダ・タンノズ・ミノタウロス）から選べます。
それぞれ特徴があって面白いです。
&br
SW2.5の種族については以下でまとめているので参考にしてください！
&button_/sw25/forbeginner/syuzoku
&br
また、キャラクタービルディングブックにも載っている &em_ランダム名前表 は便利です。
こっちにはソレイユの名前表も載ってるし、名前表目的ならこっちを買いましょう。
&br
種族ごとの生まれや育ちについての解説も読んでいて楽しいです。
&em_種族ごとの集落とかの絵が何枚かある のも嬉しい……！
&br
そして、 &em_放浪者《ヴァグランツ》 という、 &em_冒険者と違ったスタイル での冒険ができるルールもあり、 &em_専用の特殊な戦闘特技 も載っています。
ヴァグランツ戦闘特技は &em_尖った性能のものが多く 、初心者向けではないですが、面白いのは間違い無いです。
個人的な目的のために個人的に活動するの、エモくないですか？
&br
シャドウ・ソレイユ・アルヴ・ウィークリングが使いたい方にはオススメです。
どうしても使いたければ &em_最初に買うのもなしではない ！　かな。
&br
ちなみによく「アウトロープロファイ『リング』ブック」とか呼ばれますが、前作とは違って「〜ing」ではなく、『アウトロープロファイルブック』です。
      `,
    },
  ],
};
const tour: SupplimentGroup = {
  id: "tour",
  type: "ツアーサプリ",
  explain: `
1つの地方もしくは都市に絞って &em_世界観や設定を詳細に解説 するサプリで、 &em_シナリオも掲載 されています。
その地方特有の &em_アイテムや騎獣、流派 が載っているものがあります
2023年3月現在、サプリが5冊とリプレイ＆サプリが3冊の計8冊出てます。
&br
-サプリ
--冒険の国グランゼール
--鉄道の都キングスフォール
--星座の街サイレックオード
--魔導の学府ユーシズ
--ブルライト博物誌
-リプレイ＆サプリ
--剣と荒野と放浪者
--剣と荒野と放浪者2
--冒険者たちの幻獣戦線
&br
これらは基本的には世界観重視です。 &em_1つの街で育っていく物語をしたいなら買うのもあり だし、 &em_惹かれたものを買えばいい と思います。
が、Twitterなどで対応したセッションの募集もそれほどないですし、 &em_他のものを優先したほうがいい かもしれません。
ということで全体的におすすめ度が低めです。
`,
  items: [
    {
      name: "冒険の国グランゼール",
      ossusume: 1.5,
      explain: `
「スタートガイド」と銘打たれており、初心者向けの内容が多い、と思いきや、 &em_SW2.0経験者向けの「移行ガイド」的な側面が大きい印象 。
シナリオの作り方などは後のユーシズにも掲載されているのもおすすめ度が上がらない理由です。
&br
舞台となるグランゼールは &em_巨大な魔剣の迷宮の上にできた 、迷宮へ挑む冒険者の街。
キャンペーンを作るにはおすすめの土地なので、キャンペーンを作りたくなったら買うのをおすすめします。
      `,
    },
    {
      name: "鉄道の都キングスフォール",
      ossusume: 2,
      explain: `
ルールブックIIに載っている、 &em_鉄道の都 であるキングスフォールについて詳しく書かれたサプリメントです。
列車内にあって移動式という珍しい冒険者ギルド支部もあります！
&br
SW2.5で &em_鉄道に関する冒険をしたい人 にはオススメです。
個人的には &em_お祭り について色々と書かれているのもおすすめポイントです。
シナリオ2本付きです。
&br
なお、キングスフォールを舞台にしたシナリオを公開しているのでよければご覧ください。
&button_/scenario#kitomaho こちら
      `,
    },
    {
      name: "星座の街サイレックオード",
      ossusume: 2,
      explain: `
&em_空に浮かぶ島にある街 を舞台に冒険ができます。
&em_グライダーやスカイワイバーンといった騎獣 も追加され、 &em_空での冒険 が楽しめます！
&br
空に浮かぶ島で冒険したい人にはオススメです。
シナリオ2本付きです。
      `,
    },
    {
      name: "魔導の学府ユーシズ",
      ossusume: 2.5,
      explain: `
魔法学園「七色のマナ」がある &em_魔法使いばかりの国 ユーシズで冒険できます。
&em_学生冒険者 ができます！
&em_ソドワでスクールライフ ができます！
&br
さらに &em_シナリオの簡単な作り方 などが書いてあり、人によってはそこだけでも価値ありかもです。
ので、少しおすすめ度を高くしています。
&br
さらにさらに、 &em_〈ボトルドール〉という幼いホムンクルスと冒険できるルール も掲載されてます。
これも個人的にはすごくおすすめです。
初心者の人でも楽しめるルールです。
&br
学生するぜって人や魔法大好きだぜって人にはオススメです。
魔法大好きな人は前述の「メイガスアーツ」の方が優先な気がしますが。
シナリオ2本付きです。
      `,
    },
    {
      name: "ブルライト博物誌",
      ossusume: 2,
      explain: `
1つの街をメインに据えた上記4つに比べ、こちらは地方全体を扱う「博物誌」というシリーズです（2023年3月現在これ1冊ですが）。
特徴としては &em_「流派」が掲載されている ことですが、初心者向けかと言われれば違うかなぁという印象です。
これを買うなら &em_先にバトルマスタリーを買うのがおすすめ です。
      `,
    },
    {
      name: "剣と荒野と放浪者",
      ossusume: 1,
      explain: `
リプレイ＆サプリです。
今回はサプリ紹介なので、リプレイ部分についてのコメントは書きませんが、個人的にはとても楽しみました。
&br
&em_荒野の広がるオーレルム地方 のガイドと &em_珍しい武器 が載っています。
あまりデータ量がないのでオススメ度は低めです。
      `,
    },
    {
      name: "剣と荒野と放浪者2",
      ossusume: 1,
      explain: `
リプレイ＆サプリです。
今回はサプリ紹介なので、リプレイ部分についてのコメントは書きませんが、個人的にはとても楽しみました。
&br
データとしては英雄を導く神とかいう &em_シナリオ作るには神すぎる神様 、テケルロコ様が登場します。
テケルロコ様の便利さは &em_クトゥルフ神話TRPGにおけるニャル様 と同様といっても過言ではないかもしれません。
&br
また、 &em_黄金呪刻術なる、黄金の力で武器や防具を強化するルール も追加されています。
正直 &em_おすすめ度はもう少し高くてもいいかも なとも思ったのですが、「剣と荒野と放浪者」の続きであり、「剣と荒野と放浪者」がないと微妙な点がマイナスポイントです。
&br
でも、最初ではないにしても両方買うのおすすめです。
後述のバトルブックサプリである『グリフォンロード』もオーレルム地方が舞台なので、 &em_3冊買って遊びましょう！
      `,
    },
    {
      name: "冒険者たちの幻獣戦線",
      ossusume: 1,
      explain: `
リプレイ＆サプリです。
今回はサプリ紹介なので、リプレイ部分についてのコメントは書きませんが、個人的にはとても楽しみました。
&br
アルフレイム大陸北東にあるウルシラ地方（サイレックオードと同じ）の北端、スフバール聖鉄鎖公国を中心に紹介しています。
隣には &em_魔神に支配されているザムサスカ地方 もあり、 &em_魔神との最前線 です。
&br
フェローデータ（ &em_幻獣の！ ）や &em_シナリオ が載っており、 &em_アビス強化などに関する追加ルール もあります。
ちょっと初心者向けではないかもです……。
      `,
    },
  ],
};
const bb: SupplimentGroup = {
  id: "bb",
  type: "バトルブックサプリ",
  explain: `
1つの大きなシナリオ（キャンペーン）となっているサプリです。
&em_GMなしで1人でも遊ぶことができる のが特徴です。
2023年2月現在3冊出てます。
&br
-ヴァイスシティ
-デモンズライン
-グリフォンロード
`,
  items: [
    {
      name: "ヴァイスシティ",
      ossusume: 3,
      explain: `
魔神と蛮族によって &em_ぐっちゃぐちゃにされた街 を舞台に冒険できるサプリです。
&br
個人的な感想としてはめっちゃ面白かったです。
GMなしで1人から遊べるので &em_「遊ぶ人がいない！」って人はぜひ遊んでみてください 。
&em_1人で遊ぶと死を繰り返しながら攻略 することになりますが……。
&br
マップはランダムに配置されていくタイプなため、
&br
&em_死ぬと「魔神化」 していくのも面白いポイントです。
だんだんと「 &em_堕ち 」ていけます。
      `,
    },
    {
      name: "デモンズライン",
      ossusume: 3.5,
      explain: `
個人的な所感としては一番 &em_ルールがわかりやすいかも です。
&br
&em_かつての英雄たちと戦う 、なんかエモい感じのです。
バトルブックサプリの中では一番おすすめです。
&br
1人でまずはSW2.5やってみたいって方はぜひ！
      `,
    },
    {
      name: "グリフォンロード",
      ossusume: 2,
      explain: `
「剣と荒野と放浪者」で紹介された &em_荒野の広がるオーレルム地方で冒険をする 物語です。
&em_グリフォンと共に移動するキャラバン に助けられながら冒険するストーリーは &em_独特で、大変面白い です。
が、初心者向きかというと微妙なところです。
&br
「剣と荒野と放浪者」があった方が楽しめるので、そちらと一緒にぜひ。
      `,
    },
    {
      name: "エンシェントブルー",
      ossusume: 0,
      explain: `
2023年4月20日発売予定の最新作です。
現在発売前記事を掲載中です。
&button_/search?word=エンシェントブルー こちら
      `,
    },
  ],
};

interface Props {
  num: number
}
const Props = defineProps<Props>();

const group = computed(() => {
  return [big, cb, tour, bb][Props.num]
})
const explain = computed(() => {
  return [big, cb, tour, bb][Props.num]?.explain
})

</script>