<template>
    <pages-shinano>
        <card-array-by-andml :andml="andml_main" />
    </pages-shinano>
</template>

<script setup lang="ts">
const andml_main = `
&1 ガーディナー技能と陰陽術
魔法使い系技能・Aテーブル
&br
シナノシマにおいて妖との戦いの中、独自に生まれた魔法「陰陽術」を使う魔法使いがガーディナー、もしくは陰陽師です。
&br
ガーディナーの町や集落での役割は、「結界」を張ることです。結界には妖を遠ざける効果があり、きちんと張られた結界の中には妖は入れません。
逆に結界が維持できなければ町や集落の中にまで妖が襲ってきてしまいます。かつていくつもの集落が結界が維持できなかったことで滅びました。
そのため妖の脅威と隣り合わせのシナノシマにおいて、ガーディナーは必須の存在といえ、集落で最も強力なガーディナーは実質的な最高権力者となります。
&br
権力を行使するか、しないかはかなり個人によります。
また、優秀な指導者として集落を大きくすることもあれば、権力に溺れて失敗し集落後と滅びることもあります。
&br
冒険者となるガーディナーの多くは結界の維持をローテーションで行う、見習いから中堅クラスの者たちです。彼らは結界の維持を一時的に他の者へと任せ、他の冒険者仲間と冒険に出かけます。
冒険の中でもガーディナーは必須の存在です。いつ襲ってくるかわからない妖に対し、すぐに簡易的な結界を展開し、妖の攻撃から味方を守りつつ、隙があれば攻撃も行います。

&3 習得可能な言語
-「古代シナノシマ語」：会話/読本

&3 行える判定
- 魔法行使判定（『ルールブックI』p.116）
- 儀式判定

&3 ガーディナー技能を制限される種族
- なし
-- ただし真語魔法や操霊魔法を使えない種族はこの魔法も使用することはできません

&2 陰陽術
陰陽術はガーディナー技能を習得することで使用できる様になる魔法です。
原理的には真語魔法や操霊魔法に近いとされます。

&3 陰陽術の使用条件
- 魔法の発動体：真語・操霊魔法と同様に〈魔法の発動体〉が必須となります
-- シナノシマでは板に魔力を注入した〈札〉を使うことがほとんどです
- 移動：制限移動
&br
陰陽術を使用する際には舞うように動きながら、古代シナノシマ語によって詠唱を唱えます。
そのため、以下の条件があります。
&br
- 発声：古代シナノシマ語による発声ができない場合、魔法行使判定に-4のペナルティ修正を受けます
-- ［異貌］時のナイトメアはこの制限を受けません
- 自由の確保：自由に動けない場合、行使できません
- 鎧の制限：真語・操霊魔法（『ルールブックI』p.197）と同じです

&3 陰陽術の特徴
陰陽術には属性攻撃魔法・味方を守る魔法・敵の攻撃を減らす魔法が多いという特徴があります。

&1 儀式魔法と儀式判定
陰陽術には儀式魔法と呼ばれる特殊な魔法がいくつか存在します。
&br
儀式魔法には「儀式発動値」「継続発動値」「継続値」という3つの特殊な値があります。

&3 儀式の用意
儀式魔法を使う際、まず「儀式」を用意する必要があります。
「儀式」を用意できるのは儀式魔法である陰陽術を使用可能なキャラクターのみです。
「儀式」を用意することは補助動作で行うことができます。
&br
「儀式」は「儀式達成値」という値を持ちます。初期値は0です。
&br
「儀式」は陣営ごとに1つまでで、新たに「儀式」を用意すると前あった「儀式」はなくなります。
この際、前あった「儀式」の「儀式達成値」は引き継がれません。

&3 儀式判定と儀式達成値
「儀式」が用意されている陣営のキャラクターは、その儀式魔法の定めるMPを消費することで「儀式判定」を行うことができます。
「儀式判定」を行う際、ガーディナー技能は必須ではありません。
&br
「儀式判定」を行った場合、達成値を「儀式」の「儀式達成値」に足します。

&3 儀式達成値の持ち越し
「儀式達成値」は基本的に減ることはなく、ラウンドが変わっても持ち越されます。
ただし、ラウンドの終了時、このラウンドでの「儀式達成値」の上昇分が儀式魔法の「継続値」を下回っている場合、「儀式達成値」は0となってしまいます。

&3 儀式魔法の発動
「儀式達成値」が「儀式発動値」を初めて超えたとき、儀式魔法が発動します。
儀式魔法の対象の決定は発動する際に、儀式を用意したキャラクターが選びます。

&3 儀式魔法の継続発動
また、「儀式発動値」を超えたあとは、そのラウンドで初めて、このラウンドでの「儀式達成値」の上昇分が「継続発動値」を超えた場合、儀式魔法が発動します。
儀式魔法が発動する回数は、たとえキャラクターが何人「儀式判定」を行ったとしても、陣営ごと、ラウンドごとに1回だけです。
&br
「儀式達成値」が「儀式発動値」を超えた後であっても、ラウンドの終了時、このラウンドでの「儀式達成値」の上昇分が儀式魔法の「継続値」を下回っている場合、「儀式達成値」は0となってしまいます。

&3 儀式判定
基準値：ガーディナー技能レベル+知力ボーナス+精神力ボーナス
所要時間：10秒（1ラウンド）
解説：儀式魔法の発動のために使用する判定です。
この際、「陰陽術の使用条件」に記載される魔法行使判定の制限・ペナルティと同様の制限・ペナルティを受けます。
この判定は例外として、ガーディナー技能を持っていないキャラクターも、基準値として「精神力ボーナス」を使用することができます。この際には「陰陽術の使用条件」に記載される魔法行使判定の制限・ペナルティと同様の制限・ペナルティは受けません。
自動成功の場合、達成値は『ルールブックI』p.98の記載通りに処理されます。

&1 陰陽術データ
&2 レベル1
- 簡易結界
-- 消費：MP3
-- 対象：1エリア（半径10m）
-- 射程/形状：術者/–
-- 時間：1ラウンド
-- 抵抗：必中
-- 概要：小規模な結界を展開し、近くの妖怪から味方を守る。
-- 効果：効果時間中、エリア内の「分類：妖」のキャラクターは命中力と回避力に-1のペナルティ修正を受けます。
- 霊感
-- 消費：MP2
-- 対象：全エリア（半径30m）
-- 射程/形状：術者/–
-- 時間：一瞬
-- 抵抗：必中
-- 概要：妖の存在を感知する。
-- 効果：効果範囲内に「分類：妖」のキャラクターがいる場合、術者はそのことを知ります。ただし場所や数はわかりません。
- 陰陽の安定
-- 消費：MP3
-- 対象：任意の地点
-- 射程/形状：接触/–
-- 時間：一瞬
-- 抵抗：必中
-- 概要：結界内の陰陽のバランスを保ち、結界の安定性を高める。
-- 効果：効果範囲内に「分類：妖」のキャラクターがいる場合、術者はそのことを知ります。ただし場所や数はわかりません。

&br
&br
（随時執筆中）
`
</script>