<template>
  <card-array-by-andml :andml="andml_main" />
</template>

<script setup lang="ts">
const andml_main = `
&1 当サプリメントについて
&ruby_同人,オリジナル サプリメント「シナノシマ」（仮）はソード・ワールド2.5（SW2.5/ソドワ）のオリジナル設定集です。
管理人のしゃちほこ丸が、ラクシアでちょっぴり和風「風」な世界での冒険をするために作っています。
&br
「ソード・ワールド2.5なんだけど、ソード・ワールド2.5ではない。」
そんな冒険を楽しんでいただけたら幸いです。
&br
「ルールブックにあるルールだけで遊びたい。」
って方は他のページへご移動をお願いします。

&4 注意事項/お願い
このページの内容を使って遊んだり、さらに別のオリジナル設定を使う際は、 &em_以下を必ず記載ください。
よろしくお願いします。
&&gray
TRPGギルド支部〈しゃちほこの尾びれ亭〉の内容を参考にしています。
https://trpg.syachi.work/sw25/data
&&&
&br
また、 &em_このページの内容は現在執筆中です。
お気をつけください。
&br
もし見ていただけましたら、 &itwitter までご感想をいただけると凄く励みになります。
ぜひお願いします。

&4 影響を受けた作品
このサプリメントの制作にあたり、特に以下の作品から強く影響を受けております。
- &link_https://booth.pm/ja/items/2956157,ソード・ワールド2.0/2.5同人サプリメント第一弾『天津国』（TRPG¥sCircle¥sscramble様）
&br
こちらの同人サプリメントもソード・ワールドの世界で和風ファンタジーを楽しむというコンセプトは同じです。
本作は「和風らしさ」よりも「ラクシアらしさ」を意識して、0から作成しております。
こちらの『天津国』もぜひご覧ください。
&br
また、和風ファンタジーのイメージ形成において、僕は『東京レイヴンズ』（あざの耕平先生）の影響を強く受けています。

&1 シナノシマ
シナノシマはアルフレイム大陸から遥か南南西に位置する小さな島です。
神紀文明時代に、同じ第一の剣陣営でありながらもティダンへと戦いを挑み、敗れた神「カタミナス」が逃げ落ちた土地とされます。
&br
カタミナスは初期に第三の剣カルディアから神格を得た得た、と考えられています。
また、ライフォス・ティダン・キルヒアいずれかの息子とされることもあります。が、真偽は不明です。
&br
カタミナスが力尽きた際、この地には第三の剣の力が満ちました。
これはカルディアが砕けてマナが世界中に散らばるよりも前のことでした。
そしてこのシナノシマに満ちた力はカタミナスによってカルディアのものから少し変化していました。
一説によれば、カタミナスは「穢れ」を持っていたとされます。
&br
この特殊なマナから生まれたのがシナノシマ特有の種族「 &ruby_妖,アヤカシ 」です。
その成り立ちを考えればアルフレイム大陸における「妖精」と近い存在です。
しかし、妖精とは異なり、 &ruby_妖,アヤカシ は凶悪な性格のものが多いことが特徴的です。
&br
シナノシマの人々はこの妖の脅威と闘いながら暮らしています。
アルフレイム大陸同様に蛮族や魔神の脅威もあり、全くもって平和とは言えない日々です。

&3 シナノシマの気候
シナノシマは、年中雲がかかっています。日射が弱く、四季はあるものの、夏でも肌寒くなっています。
これは"太陽神"ティダンに嫌われているから、とされます。
一方で、以前から日射が弱かったことで、カタミナスがティダンから逃げてきたのではないかと考える学者もいます。

&3 シナノシマと大陸
シナノシマは魔動機文明時代中期にアルフレイム大陸の冒険家「マルコ・アース」（人間/男）によって発見されるまで、大陸の人々との交流が途絶えていました。
この原因はティダンらによって「禁足地」として定められ、少なくとも魔法文明時代中期まではこのことが伝わっていたからだ、と考えられています。とはいえ現代になって、この真偽はわからなくなっています。
&br
マルコ・アースによる発見以降もシナノシマ近海には妖の脅威があるため、アルフレイム大陸との船での交流はほとんどありませんでした。

&3 シナノシマの現在
蛮族や妖との闘いに明け暮れていることと、大陸との交流がなかったことによって、文明はあまり発達しませんでした。
&br
〈大破局〉の際の蛮族侵攻は、他の大陸に比べればかなり小規模でした。
魔神も少しばかり増えただけでしたが、妖との闘いでのパワーバランスが崩れ、あと少しで全滅のところまで追い込まれてしまいました。
&br
現在は港町であるカミスワが唯一「町」と呼べる規模で、人口は3,000人ほどです。
他にはカミスワから少し内陸のアズミノ、シノノイなど数箇所に人口50人〜500人ほどの集落があるのみです。
シナノシマ全体でも人口は10,000人弱であると考えられています。

&1 シナノシマにおける技能と技
シナノシマでは妖との闘いの中で、独自の技能がいくつか生まれ育ちました。

&3 ガーディナー技能/陰陽師
「ガーディナー」は独自に発達した魔法系統で、陰陽術と呼ばれる魔法を使います。
使用者は「陰陽師」とも呼ばれます。
&br
陰陽術には属性攻撃魔法・味方を守る魔法・敵の攻撃を減らす魔法が多いという特徴があります。
また、原理的には真語魔法や操霊魔法に近いとされます。

&4 儀式魔法
陰陽術には儀式魔法と呼ばれる魔法がいくつか存在します。
これらは複数ラウンドに渡って使うことで効果を発揮する魔法で、手間はかかりますが、とても強力な効果を発揮します。

&4 結界
ガーディナー技能を使うもの、すなわち陰陽師の最も大切な仕事が「結界」を張ることです。
結界には妖を遠ざける効果があります。
きちんと張られた結界の中には妖は入れないので、町の結界を維持することが生活を守ります。
&br
また戦闘中には「簡易結界」と呼ばれる簡易的な結界を作り、味方を守ることに使います。
&br
結界は一部の簡易結界を除き、儀式魔法によって張られます。

&button_/sw25/data/shinano/guardiner

&3 アパリシャー技能/妖術師
「アパリシャー」は &ruby_妖,あやかし の力を扱う技能です。
妖術と呼ばれる魔法を使い、使用者は「妖術師」とも呼ばれます。
&br
&ruby_妖,あやかし が妖精と近い存在であることから、フェアリーテイマー技能と近いと言えます。
一方で、危険な存在と協力するという点から、デーモンルーラー技能の方がより近いとも言うことができます。

&3 プリースト技能について
このシナノシマに伝わる神はカタミナスだけです。
そのためシナノシマの「プリースト」は全員がカタミナス神官となります。
&br
このカタミナス神官はかなり特殊です。
特殊神聖魔法が多いかわりに、一部の基本神聖魔法が使用できなかったり、使用できても効果が下がったりします。

&3 その他の技能について
&4 使われない技能
一方で大陸との交流が少なかったことからか、アルフレイム大陸で知られる魔法使い系技能を使うものはほとんどいません。
アルケミスト技能についても使う人はほぼ居ません。

&4 「失伝」がある技能
エンハンサー技能・ライダー技能・ウォーリーダー技能については一部の技が「失伝」しています。
シナノシマでこれらの技能を使用する場合、一部の練技・騎芸・鼓咆・陣卒を習得できません。

&4 同様に使われる技能
以上にあげていない戦士系技能、スカウト・レンジャー・セージ技能、バード技能、ジオマンサー技能はアルフレイム大陸と同様に使用されます。

&4 シナノシマの技
妖との戦いの中で独特の技が生み出されたのもシナノシマの特徴です。
&br
特徴的なものの1つに「タテシナ仙術」と呼ばれるものがあります。
これはシナノシマの練体士が使う、特殊な練技です。
なお、シナノシマの練体士は【ガゼルフット】【ビートルスキン】などが「失伝」によって使えません。
&br
また、「ウエダノシノビ術」はシナノシマに伝わる流派で、この使い手は「知を持って回避する」と言われます。
&br
これらの中にはシナノシマの生まれなら誰でも教えてもらえるものもありますし、入門するために一定以上の名声が必要なものもあります。

&1 PCとなる種族
&3 主な人族
シナノシマの人族は、約4割を人間が占め、リカントが2割ほど、タビットとナイトメアが1割ほどを占めます。
残りの2割は主にエルフ・ドワーフ・メリア・グラスランナー、そしてクローリーです。
&br
シナノシマではナイトメアが生まれやすく、その結果として人間やエルフ・ドワーフの数は大陸ほど多くありません。
ナイトメアはやはり、生まれる際に角によって母体を傷つけてしまうことがあります。
しかし、そもそも妖に襲われて死ぬことの多いこの島において。死は日常と隣り合わせです。
ナイトメアが多いこととも相まって、ほとんどナイトメアに対する迫害・差別は起きていません。
&br
アルフレイム大陸の人族のうち、ルーンフォークとソレイユは存在しません。
&br
ルーンフォークは妖精と同様に妖も見ることができないため、シナノシマにきても生きていくのは難しいでしょう。
&br
ソレイユが存在しないのは彼らがティダンの加護を受けているからだとされます。
シャドウもほとんど存在しません。これはやはりシーンの加護によるものだと考えられています。
&br
また、ウィークリングもほとんど見られません。
これは蛮族の住む地域から人里へ逃げる途中で妖に襲われてしまうからだと考えられています。
&br
その他の人族は少数存在します。
この中にはアルフレイム大陸やテラスティア大陸から渡ってきた冒険者やその子孫が多く含まれます。

&4 寿命について
シナノシマでは寿命を全うする人族は少なく、多くは妖や蛮族の襲撃によって命を落とします。
50年生き残れば御の字という社会です。
結果として長命種族のエルフや成人年齢が高いリルドラケンの割合が減り、短命なタビットやグラスランナーの割合が高くなっています。

&3 クローリー
シナノシマ以外ではほとんど見られない、ほぼ固有の種族がこのクロウリーです。
頭部が鳥の姿をしており、背中には翼が生え、手足も鳥の様です。
蛮族であるガルーダに酷似しており、シナノシマの外から来た人からは警戒されますが、歴とした穢れを持たない人族です。
体長は男女ともに1.8mほどで、ガルーダより小柄です。
&br
知力と精神力が高いため、ガーディナー技能やアパリシャー技能、バード技能などに適性があります。
器用度は低いですが、高い敏捷と知力を活かしてスカウト技能としても活躍できます。
&button_/sw25/data/shinano/crawley

&1 シナノシマの魔物
&3 &ruby_妖,アヤカシ
妖はカタミナスが力尽きた際に発生した変異したマナが、妖精と同じように自然現象と結びついて生まれた存在です。
かなり凶悪な性格をしており人を襲うため、シナノシマの人々は妖と闘いながら生きていくことを迫られています。
&br
彼らの体は実態を持たず、武器による攻撃でダメージを与えることは困難です。
しかしシナノシマでは武器に特殊な加工をしたり、自らの拳などに波導の力をこめたりすることで、彼らにダメージを与えています。
魔法の武器や銀の武器での攻撃は可能です。
&br
妖はその強さによって知能にかなり差があります。
低レベルの妖は本能的に暴れ回ります。
高レベルの妖には人を超える知能を持つものもおり、危険です。
&br
ただし知能が高い妖でも、目的は自らが暴れることであるため、結託して人々を襲うということは記録上ありません。
これがここまで人々が生きてこられた理由とされます。
&br
また人族だけでなく、蛮族・魔神・アンデッドなども襲います。
妖同士で戦うこともあります。
&br
なお、ルーンフォークがもしシナノシマに来た場合、妖精と同じように妖を見ることもできません。

&3 蛮族
シナノシマの蛮族はアルフレイム大陸と似た種族が存在します。
ただしドレイクやノスフェラトゥの存在は確認されておらず、シナノシマでもっとも脅威となる蛮族はバジリスクです。
&br
妖は蛮族も襲うため、蛮族も陰陽術を使って結界を張ることがあります。
また妖術を使う蛮族もいるようです。

&4 ナガノシ
ナガノシと呼ばれる蛮族の町は強力な結界が張られており、少なくとも数百の蛮族が暮らしているとされます。
また人族の奴隷が飼われているという噂もあります。
&br
このナガノシを支配する蛮族は"黒曜の"ヴァルラハバキ（オブシディアンバジリスク/男/年齢不詳）です。

&3 魔神
魔神はアルフレイム大陸ほどではありませんが、シナノシマにも出現します。
&br
シナノシマに現れる魔神のほとんどはアルフレイム大陸の方向から海を渡ってやってきます。
そのためシナノシマに出現する魔神は空を飛べる種族ばかりです。
&br
"奈落の魔域"の発生が確認されたことはありません。

&3 アンデッド
アンデッドはアルフレイム大陸同様に発生します。
しかしアンデッドも妖の襲撃を受けるため、それほど人族の脅威になっていません。

&1 シナノシマの特殊なアイテム
&3 ヒヒイロカネ
シナノシマのみで産出される、濃い赤色をした金属です。
シナノシマでは、ヒヒイロカネはカタミナスがティダンから奪った魔剣によって生成されると考えられています。
&br
武器にヒヒイロカネを使った加工を施すことで、妖に対しても有効な武器へすることができます。

&3 騎獣
シナノシマには以下の騎獣のみが存在します。

&4 ホース
ホースはアルフレイム大陸とほぼ同様で、同じデータとして扱います。
少しだけ小柄です。

&4 マンモス
マンモスは巨大な体と巨大な牙を持つ象です。
【チャージ】【トランプル】が強力になる能力「超突撃」、敵を遠くへ投げる「鼻で投げる」などの能力を持ちます。
乗るためには流派【シオジリ騎乗戦闘術】の秘伝《マンモス騎乗》が必要になります。


&1 アパリシャー技能と妖術
その他技能（スキル系）・Bテーブル
&br
アパリシャーは &ruby_妖,アヤカシ の力を利用する技能で、これを使う者は妖術師とも呼ばれます。
「妖術」と呼ばれる能力を操ります。
&br
「妖術」の中でも妖を呼び出して自らに憑依させる「口寄せ」はかなり危険ですが、とても強力な術となります。
&br
アパリシャーは町の中での結界維持が最も重要な役割であるガーディナーと異なり、結界の外での妖退治が最も重要な役割となります。
そのためアパリシャーのほとんどが冒険者となります。
&br
ガーディナーほど社会的地位は高くありませんが、妖に対抗するための重要な戦力であることは確かであり、昔からシナノシマで活躍しているため、偏見や差別はほとんどありません。

&4 習得可能な言語
-「古代シナノシマ語」：会話/読本

&4 行える判定
- 魔法行使判定（『ルールブックI』p.116）

&4 アパリシャー技能を制限される種族
- ルーンフォーク
-- 妖精魔法を使えない種族はこの魔法も使用することはできません

&3 妖術
妖術はアパリシャー技能を習得することで使用できる様になる魔法です。
原理的には妖が妖精と近いことから妖精魔法に近いとされますが、一方で敵対するものの力を強引に支配して使う点でデーモンルーラーの招異と近いともいわれます。

&3 口寄せ
妖術「口寄せ」を使用すると自らに妖を憑依させることができます。
この状態を「口寄せ状態」と呼びます。
口寄せ状態では憑依する妖にごとに特殊な能力を得たり特定の能力値が上昇したりします。これは「妖能力」と呼ばれます。
&br
口寄せによって憑依する妖は基本的にランダムに決まりますが、特定の妖を口寄せすることが可能になる妖術もあります。

&4 口寄せできる妖
口寄せできる妖は「口寄せデータ」を持っています。
&br
口寄せデータには「第一抵抗目標値」「第二抵抗目標値」「妖能力」があります。

&4 抵抗
口寄せ状態の時、自分の手番の開始時に精神抵抗判定を行います。
&br
達成値が妖の第二抵抗目標値以下だった場合、HPに（妖の魔物レベル）点の確定ダメージを受けます。
さらに達成値が妖の第一抵抗目標値以下だったなら、その手番は強制的に終了します。

&4 口寄せの終了
口寄せ状態の時、1ラウンドに1回だけ補助動作で「口寄せの終了」を試みることができます。
精神抵抗判定を行い、達成値が妖の第二抵抗目標値以下だった場合、口寄せを終了することができます。
&br
この際、精神抵抗判定が自動成功の場合を除き、HPに（妖の魔物レベル）点の確定ダメージを受けます。

&3 妖術データ
準備中……

&1 カタミナス神官の神聖魔法について
準備中……

&1 シナノシマの流派
準備中……

&1 ヒヒイロカネ加工
準備中……

&1 シナノシマでの冒険
&3 PCの立場
シナノシマで遊ぶ場合、PCはカミスワを拠点とし、カミスワ武者隊か黒龍隊かに入るのがおすすめです。
カミスワ武者隊は町の正規組織で、黒龍隊は傭兵隊ですが、現在はほぼ同様の活動をしており、どちらの所属としても問題ありません。
また、これらの組織をまたがってパーティーが組まれることもあります。
&br
パーティーは即興で組まれ、1つの依頼や任務を終えれば解散し、また次の際に即興で組まれる……ということが多いです。
ただしずっと同じメンバーで活動するパーティーも存在します。

&3 主に想定している遊び方
当サプリメントはオンラインセッションで遊ぶことを想定して作成しています。
冒険者レベルを4程度にすると、セッションではキャラクターの自己紹介、1回の道中での戦闘、ボス戦闘で2〜3時間程度で遊べる想定です。

&4 キャンペーンで遊ぶなら
キャンペーンで遊ぶなら、集落の冒険者としてその集落を大きくしていく、という遊び方がおすすめです。
カミスワではある程度の大きさがあるため拡大も慎重にならざるを得ませんが、他の集落であれば1つのパーティーの活躍で大きな変化をもたらすことができます。

&3 主な冒険
シナノシマでメインとなる冒険は「平定」「護衛/届け物」「冒険」です。
&br
「平定」は町の結界から少し行ったところの妖を全て倒すことがメインとなります。
妖を全て倒した上でその地に「杭」を立ててば依頼達成となります。あとは町の結界を張っているガーディナーが結界をその地域に広げてくれます。
こうして人が居住可能な土地を広げていくのです。
&br
「護衛/届け物」は他の集落へと行って帰る冒険です。
&br
「冒険」はかつての集落、特にマツモトなどへいき、使えるものを探してくる冒険です。
&br
いずれにせよ、背景がしっかりした凝ったシナリオよりも、妖の脅威に対処することがメインのシナリオが多くなります。
&br
GMやシナリオ制作者は他にも自由にシナリオを作って構いません。
蛮族による事件も起きますし、（稀ですが）魔剣の迷宮もあります。"奈落の魔域"が発生することもないとは言い切れません。

&1 "生き残りの港町"カミスワ
カミスワはシナノシマにある港町です。シナノシマで唯一「町」と呼べる規模で、人口は2,000人ほどいます。
シナノシマ全体の人口が5,000人いないくらいと考えられるため、約半数がここに住みます。
&br
もともと少し北のマツモトがシナノシマ最大の町でしたが〈大破局〉の際のパワーバランスの変化によって壊滅してしまいました。
&br
カミスワはアルフレイム大陸との交流における玄関口であったこともあり、魔動機なども使って対抗し、〈大破局〉前の約1/3まで抑え込まれたものの、なんとか町を守り切ることに成功しました。
その後の300年間で少しずつ結界の範囲を拡大し、現在は〈大破局〉前の約2/3ほどの範囲に結界を張っています。
&br
現在、町ではカミスワ港を結界の範囲内とするための「カミスワ港平定作戦」を展開しています。
カミスワ港は魔動機文明時代にはアルフレイム大陸からの船が来ていた港でしたが、現在は結界の外となってしまっており、数年に一度、物好きな冒険者が来るだけです。
ここを結界の範囲にいれてアルフレイム大陸との交流を活発にすることが現在のカミスワの願いです。

&3 カミスワの政治
カミスワでは少なくとも1000年以上前からアプセダール家が世襲で最高職である「太政官」を務めています。
独裁ですが、あまり問題は起きていません。
これは相談役として貴族だけでなく一般人も登用していることと、妖との戦いの中で太政官も民衆もすべきことをし続けなければ町が滅びることを知っているからです。

&3 カミスワ屋敷
カミスワの政治の中心となるアプセダール家の屋敷です。
すぐ横にはカミスワ近衛隊の詰所もあります。

&3 カミスワの軍隊
&4 カミスワ近衛隊
アプセダール家の人間やその相談役、およびカミスワ城所属のガーディナーたちを守る役割を担います。

&4 カミスワ警備隊
町内の治安維持を行う、警察のような存在です。
基本的には警備巡回と通報がメインで、事件の処理は武者隊に任せることが多いです。

&4 カミスワ &ruby_武者,ムシャ 隊
100人ほどが所属する、最大の戦力です。
町内での事件発生時に駆けつけたり、結界外での事件に対処します。
現在は「カミスワ港平定作戦」へ従事することが多いです。

&3 カミスワ城
かつてマツモトにあった城と比べれば規模が小さいですが、現状ではシナノシマ最大の城がこのカミスワ城です。
カミスワ屋敷のすぐ隣にあります。
&br
城はガーディナーが結界を張るための施設であり、最上階にガーディナーが集まって結界を維持するための儀式を日夜続けています。
現在、カミスワ城に所属するガーディナーは35人ほどです。基本的に1回10人ずつ1日3交代で働き、残りの5人は結界外での妖への対処などに出かけます。
彼らはカミスワで上から35人と言っていいほどの実力者です。
&br
他に見習いとして30人ほどが所属しています。

&3 黒龍隊
正規の軍隊ではない、傭兵のような立ち位置です。
平時は町と集落とを行き来する商人の護衛などを行なっており、アルフレイム大陸における冒険者とかなり近い役割です。
現在は200人ほどが所属していますが、そのうち半分以上は普段は農業などをしながら暮らすものたちです。
&br
黒龍隊はもともとマツモトが崩壊後になんとか逃げ延びた人々の組織で、現在も最大の目標はマツモトを平定することです。
隊長はマツモトを治めていた一家の子孫であるフランク・ブラックビット（タビット/28/男）です。
&br
現在はマツモト平定に向けての下準備としてカミスワ武者隊と協力して「カミスワ港平定作戦」をともに行っています。

&3 カミスワの市
カミスワ城へとまっすぐ伸びる道は市場となっており、両側に多数の店が並びます。
野菜や肉・魚を売る店もあれば、武器や防具を売る店もここにあります。

&3 カミスワの主なNPC
&4 &ruby_"陰陽頭",オンミョウノカミ セイメイ（クローリー/45/男）
鴉のクローリーであり、カミスワ城で結界を張るガーディナーの最高職「陰陽頭」を務める、名実ともに最強の陰陽師です。
特に政治の場に出ることはなく、空き時間は全て強力な結界を張るための鍛錬と見習いの修行に費やしています。

&4 "夜の守り人"コーソン（メリア（長命種）/155/男）
桜のメリアで、セイメイと交代で夜間の結界の責任者を務める陰陽師です。
かつては"陰陽頭"を務めたこともある実力者ですが、職は後進に譲り渡し、自身の鍛錬と見習いの修行に力を入れています。
セイメイは自身が見てきた中でも最高の実力者とのことです。

&4 "太政官"ユリウス・アプセダール（人間/50/男）
現在カミスワの政治を執り行うのがこのアプセダールです。
温厚な人柄で、皆から愛されています。
そろそろ息子に代替わりすることを考えています。

&4 "黒の血統"フランク・ブラックビット（タビット/28/男）
黒龍隊の隊長を務めるタビットで、〈大破局〉前はシナノシマ最大の町であったマツモトを治めていた一家の子孫です。
自身の生死は気にせず、とにかくいつかマツモトを平定・復興し、人々が暮らしやすくするため、できることからやっていっています。

&4 &ruby_"死に損ない",サバイバー ダンブルク（ナイトメア/75/男）
カミスワの人に「この町で一番強いのは誰か」と聞いたら誰もがダンブルクの名前をあげる、そのくらい武勇の高い戦士です。
かつてはカミスワ近衛隊やカミスワ武者隊で活躍し、カミスワ武者隊の隊長も務めていましたが、後進に道を譲り、自らは現場で戦うために黒龍隊へ入りました。
彼は「ただの死に損ないさ」と言いますが、現在でも鍛錬を続けており、ヒヒイロカネ加工の大剣を振るって戦うその姿から &ruby_"紅鋼の英雄",レッド・ヒーロー と呼ばれ親しまれています。

&1 終わりに
最後にお願いを繰り返させてください。
&br
このページの内容を使って遊んだり、さらに別のオリジナル設定を使う際は、 &em_以下を必ず記載してくださるよう、お願いします。
&&gray
TRPGギルド支部〈しゃちほこの尾びれ亭〉の内容を参考にしています。
https://trpg.syachi.work/sw25/data
&&&
&br
また、 &em_このページの内容は執筆中です。
お気をつけください。
&br
見ていただけましたら、 &itwitter までご感想をいただけるとすごく励みになります。
ぜひよろしくお願いします。


// &1 メモ
// &3 流派アイデア
// ・タテシナ仙術
//     エンハンサー拡張
//   【フォックスアイデア】
// ・ウエダシノビ術
//     スカウト/フェンサー
//   《みきり》
//   《一点集中》
// ・シオジリ騎乗戦闘術
//     ライダー
//   《名乗り攻撃》
//   《一斉突撃》
//   《マンモス騎乗》
// ・チクマ戦場指揮術
//     ウォーリーダー
//   《反撃の？陣》
// ・マツモト道場術
//     グラップラー
//   《波導撃》
`;
</script>
