<template>
  <card-array-by-andml :andml="andml1" />
</template>

<script setup lang="ts">
const andml1 = `
&1 参加にあたっての注意
しゃちほこ丸主催のマダミス『断ち切られるべき呪い』に参加を希望される場合には &em_必ずこのページの記載内容を全て確認 の上、応募してください。
&br
マーダーミステリーは &em_ネタバレに弱く1回しか遊べない ゲームです。
その1回を &em_全力で楽しむ ために、約束ごとをお守りください。
&br
そしてマーダーミステリーは &em_全員が容疑者となって疑い合う ゲームです。
苦手な方はとことん苦手だと思います。
また、ゲームの中でキャラクターを疑われ・疑っても、 &em_相手プレイヤーへのリスペクトは忘れない人 、 &em_ゲームが終わったら「強かったなぁ」「残念だったなぁ」で済ませられる人 だけご参加ください。

&1 マーダーミステリーとは
「マダミス」と略すこともあり、このウェブサイトでもそう略します。
トークをしながら殺人事件の謎を探り、 &em_犯人を見つける（もしくは自分が犯人なら逃げ切る）ことを目的 とします。

&3 PLとGM
プレイヤー（PL）とゲームマスター（GM）に分かれて遊ぶのはTRPGと一緒。
今回の『断ち切られるべき呪い』のようにGMなしで1人のPLが進行役を兼任して遊べるものもあります。

&3 シナリオ
シナリオがあるのもTRPGと一緒です。
基本的にシナリオは1つの殺人事件となっています。

&2 キャラクター
ただし、（多くの場合） &em_キャラクターは出来合いのもの を使います。
なのでもちろんですが、継続キャラクターなどは使えません。
&br
キャラクターは公開情報を見ながら話し合って選ぶ場合と、GMもしくは進行役がランダムに決定する場合があります。
&br
「犯人役をやりたい！」みたいなことはできません。
&em_探偵役でも犯人役でも楽しめる人のためのゲーム です。
&br
探偵役とは言いましたが、 &em_全員が容疑者 です。
疑い合いながら真犯人を見つけていきます。

&3 公開情報と秘匿情報
&em_キャラクターには公開情報と秘匿情報 があります。
すべての公開情報と自分の秘匿情報、「捜査」によって得られた情報を使って犯人を推理します。
&br
キャラクターが犯人なら秘匿情報にそのことが書いてあります。
「捜査」をしながら他の人に反抗を押し付けるべく行動しましょう。
&br
もしかすると秘匿情報に「犯人を庇いたい」みたいなことが書いてあるかもしれません。
そしたらその目的に向かって進んでください。

&2 ゲームの流れ
全員で話す場面（公開討論）、少人数で話す場面（密談）、情報（証拠）を捜査する場面といった場面を切り替えながら進んでいきます。
シーン制のTRPGに近い形です。
&br
最後は「犯人が誰だと思うか」を投票し、1番疑われた人が犯人扱いをされます。
&em_その人が真犯人なら他の人の勝ち、間違っていれば犯人の勝ち です。
&br
ただし前述の通り、場合によっては &em_秘匿情報に他の勝利条件がある場合 もあります。
&br
多くのシナリオの場合これらは &em_時間制限 によって進みます。
&br
この辺はシナリオによっても変わってきます。
今回の『断ち切られるべき呪い』では密談の時間がなく、証拠を集めながら公開討論を3回繰り返し、最終投票へ進みます。

&2 まとめ
- マーダーミステリーは殺人事件の犯人を追うゲーム
- キャラクターは出来合いのものを使う
- キャラクターは全員が容疑者
- キャラクターには公開情報と秘匿情報がある
- シーンが時間で切り替わる

&1 ソード・ワールド2.5とは
ソード・ワールド2.5（略称：SW2.5/ソドワ）はファンタジー世界で冒険者となって色々な依頼を解決するTRPGです。
詳しくは以下のページをご覧ください。
&button_/trpg
&button_/sw25

&1 『断ち切られるべき呪い』
『断ち切られるべき呪い』は &link_https://amzn.to/3AxEN8g,『ゲームマスタリーマガジンVOL.10』（2019/12/26発売） の付録として公開されたマーダーミステリーのシナリオです。
&button_https://amzn.to/3AxEN8g 購入はこちら

&3 ゲームマスタリーマガジンとは
略称は「GMマガジン」。
ソード・ワールド2.5の執筆などをしている &link_http://www.groupsne.co.jp/,グループSNE が出していたゲームサポート誌です。
&br
2023年4月現在は同じくグループSNEが出していたゲームサポート誌『ウォーロック・マガジン』と合体して『GMウォーロック』となりました。
『GMウォーロック』は3ヶ月に1回発売されています。
&br
余談ですが、GMウォーロックにはSW2.5の新情報なども多く、読んでいてとても楽しいです……！
SW2.5の新刊情報は以下をご覧ください。
&button_/sw25/new

&3 リプレイもついています
なお、プレイした後は同雑誌に付属しているリプレイを読んで楽しむこともできます。
面白かったらぜひ買ってください。
&button_https://amzn.to/3AxEN8g 購入はこちら

&2 シナリオ概要
&em_PL人数は5人 で、 &em_GMは不要 （PLの1人が進行役を兼任）のシナリオです。
&em_およそ2時間 でプレイできると書かれています。
&br
&em_舞台はソード・ワールド2.5の舞台であるラクシア でさまざまな種族や魔法・魔法のアイテムが出てきます。

&3 あらすじ
準備中です。

&1 募集
&2 第1回募集
&3 日時
5月8日（月）21:00〜
遅くとも24時には終了予定です。

&3 形式
ボイスセッション

&3 募集人数
4人（しゃちほこ丸を含め5人）

&3 募集条件
以下の条件に全て当てはまる方のみの募集とさせていただきます。
&br
- このページをここまで全て読んでくださった人
- ゲームの中でキャラクターを疑われ・疑っても、相手プレイヤーへのリスペクトは忘れない人
- ゲームが終わったら「強かったなぁ」「残念だったなぁ」で済ませられる人
- しゃちほこ丸がPL兼進行役を務めることを了承できる人
- ボイスセッションをスムーズにできる人
- ソード・ワールド2.5のルールブックI・IIを持っている人
- しゃちほこ丸の &itwitter をフォローしている人
&br
今回は「ソード・ワールド2.5世界でのマダミスを楽しもう！」というコンセプトで開きたいので、ルールブックI・IIを持っている人に限定させていただきます。
Twitterに関しては「これを読んでフォローした！」で構いません。

&3 応募方法
応募の際は &itwitter へDMをしてください。
その際、「好きなスイーツ」（和菓子でも洋菓子でも……）を教えてください。

&3 注意事項
応募者多数の場合は抽選とさせていただきます。
あらかじめご了承ください。

&amazon_ルールブック

&2 第2回募集
第1回を遊んだあと、第2回以降を考えます。
続報をお待ちください。
&br
しゃちほこ丸がGM専任で行います。
ソード・ワールド2.5のルールブックを持っていない方の募集も考えています。
`
</script>